{
  "type": "case-study",
  "title": "Case Study: aussieBum",
  "slug": "case-study-aussiebum",
  "companyName": "aussieBum",
  "excerpt": "Learn how aussieBum was able to increase conversions and decrease failed credit card transactions with Reach's Merchant of Record model and Guided Fraud Services.",
  "publishedAt": null,
  "heroImage": {
    "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-8152-ab9b-c260e4821a47/9a2efef4-f5a5-4c32-93ed-343571f2bdf6.jpg",
    "alt": "Case Study: aussieBum",
    "filename": "9a2efef4-f5a5-4c32-93ed-343571f2bdf6.jpg"
  },
  "companyLogo": null,
  "pdfUrl": null,
  "highlights": [],
  "categories": [],
  "caseStudyCategories": [],
  "content": {
    "type": "structured",
    "blocks": [
      {
        "blockType": "heading",
        "level": "h2",
        "text": "About aussieBum"
      },
      {
        "blockType": "paragraph",
        "text": "From its humble beginnings in the Inner West of Sydney, Australia, to its global success, aussieBum has dared to take risks. In their early days, aussieBum faced barriers to gaining traction in physical retail locations. This led them to dive in head first and develop their online retail channels. This pivot paid off and garnered aussieBum worldwide attention from retailers and consumers alike. Today the producer of quality men’s swimwear, underwear, and clothing produces over 1 million garments for markets worldwide and they continue to expand their digital footprint. Their cross-border success story has won them multiple Australian export and ecommerce awards, including multiple Australian export awards for ecommerce & manufacturing. aussieBum partnered with Reach to help optimize their global expansion and to help them increase payment approval rates in overseas markets."
      },
      {
        "blockType": "heading",
        "level": "h2",
        "text": "The Situation"
      },
      {
        "blockType": "paragraph",
        "text": "In 2022, aussieBum was looking to maximize its ability to scale in its international markets. While they had achievedsuccess globally, they noticed they were experiencing multiple friction points impacting their expansion and bottom line:"
      },
      {
        "blockType": "list",
        "style": "unordered",
        "items": [
          "As aussieBum only had an entity in Australia, which meant they were limited to processing transactions crossborder, they were experiencing decreased authorization rates in their global markets.",
          "AussieBum was also being subjected to high fees on their international transactions due to the costs of processing cross-border instead of locally.",
          "AussieBum was experiencing an influx of failed credit card transactions in international markets like the US due to fraud rejection. This meant they were losing potential revenue from valid transactions due to suspected fraud."
        ]
      },
      {
        "blockType": "blockquote",
        "quote": "“Reach increased our approval rates by 18% and reduced fraud rejection by 91.12%. Reach has been a great addition to our cross-border solution.” — Ash Doran, Creative Marketing Manager",
        "citation": ""
      },
      {
        "blockType": "heading",
        "level": "h2",
        "text": "The Solution"
      },
      {
        "blockType": "paragraph",
        "text": "Aussiebum decided to Integrate with Reach because of the clear advantage of its Merchant of Record model and Local Acquiring versus competing solutions. The ability to process transactions locally in the jurisdiction of their buyers empowered aussieBum to increase their international authorization rates and save on cross-border processing fees. aussieBum also leveraged Reach’s Guided Fraud Services to bolster its fraud controls. Supplementing their fraud controls with Reach’s global experts allowed them to significantly decrease failed credit card transactions due to fraud rejections. Thanks to the optimizations Reach’s Merchant of Record model provided, aussieBum has increased its conversions, revenue and enhanced its ability to scale globally."
      },
      {
        "blockType": "heading",
        "level": "h2",
        "text": "The Outcome"
      },
      {
        "blockType": "paragraph",
        "text": "Fraud rejection represented a total of 17% of all failed credit card transactions before Reach. Only 1.51% of failed credit card transactions represented fraud rejection after integrating with Reach’s Guided Fraud Services."
      },
      {
        "blockType": "imageBlock",
        "imageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/wp-content/uploads/2023/10/Screenshot-2023-10-18-141029.png",
        "imageAlt": "",
        "caption": null
      },
      {
        "blockType": "heading",
        "level": "h4",
        "text": "By reducing fees from 3.75% to 3.20%, aussieBum saved $94,621.45 with Reach."
      }
    ]
  },
  "meta": {
    "title": "Case Study: aussieBum",
    "description": "Learn how aussieBum was able to increase conversions and decrease failed credit card transactions with Reach's Merchant of Record model and Guided Fraud Services.",
    "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-8152-ab9b-c260e4821a47/9a2efef4-f5a5-4c32-93ed-343571f2bdf6.jpg"
  },
  "sourceUrl": "https://www.withreach.com/resources/case-studies/case-study-aussiebum"
}