[
  {
    "type": "post",
    "title": "Reach Announces Platform-Agnostic Global Tax Compliance Solution",
    "slug": "reach-announces-platform-agnostic-global-tax-compliance-solution",
    "excerpt": "Offered worldwide, this revolutionary service ensures ecommerce businesses are fully compliant with sales tax, VAT, GST and duties, with Reach assuming all liabilities and compliance risk.",
    "publishedAt": "2023-12-04T05:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-8170-9aca-cf07ec1bdfe3/01482528-38e4-48a8-8ec1-d258fe8bb200.png",
      "alt": "Reach Announces Platform-Agnostic Global Tax Compliance Solution",
      "filename": "01482528-38e4-48a8-8ec1-d258fe8bb200.png"
    },
    "authors": [],
    "categories": [
      "Newsroom"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "FOR IMMEDIATE RELEASE"
        },
        {
          "blockType": "paragraph",
          "text": "CALGARY, ALBERTA, CANADA - December 4, 2023 - Already a worldwide leader in providing Merchant of Record services to global businesses, Reach is excited to announce the worldwide expansion of its revolutionary global tax compliance solution. Unlike competing services, the Reach platform is a standalone service that can be seamlessly integrated into a merchant’s existing ecommerce infrastructure without the need for additional coding or technical lift. This service eliminates one of the most complicated pain points for online businesses scaling into international markets."
        },
        {
          "blockType": "paragraph",
          "text": "The challenges of selling cross-border into international markets don’t end with payment processing and logistics. Many online businesses don’t realize that they must also be registered with domestic tax authorities, and calculate, file, and remit sales tax, VAT, GST and duties. The penalties for not complying with local tax laws can be severe, and extend beyond large fines into the realm of criminal prosecution."
        },
        {
          "blockType": "paragraph",
          "text": "“Our aim at Reach is to eliminate pain points that deter or prevent online businesses from selling cross-border and reaching their full revenue potential. By combining our world-leading Merchant of Record model with robust global tax compliance, we are unmatched in the space.” Sam Ranieri, CEO of Reach, said."
        },
        {
          "blockType": "paragraph",
          "text": "With this revolutionary solution, Reach’s Merchant of Record network localizes the customer’s experience to increase conversions while taking on all the complexity with local tax authorities. This means that Reach manages the calculating, filing, and remitting of any tax incurred on online transactions, freeing ecommerce businesses from all the hassle and costs of managing tax internally."
        },
        {
          "blockType": "paragraph",
          "text": "“Online businesses often treat the ecommerce space as the ‘wild west’ where anything goes.” Explained Mr. Ranieri. “But international regulatory agencies are more vigilant than ever when it comes to cracking down on businesses that don’t pay what is proscribed by local tax laws. And those crackdowns can be harsh.”"
        },
        {
          "blockType": "paragraph",
          "text": "The Reach global tax compliance solution is available globally in over 50 of the world’s largest ecommerce markets, with additional jurisdictions being added on a regular basis. The solution is also not limited by business focus, as it is universally available to any economic sector, from B2C to B2B, for any marketplace or platform, and also for digital and SaaS merchants who struggle with the complexities of global taxation on recurring and subscription payments."
        },
        {
          "blockType": "paragraph",
          "text": "ABOUT REACH"
        },
        {
          "blockType": "paragraph",
          "text": "Reach is a global Merchant of Record that helps businesses scale in international markets, reduce risk and complexity, increase conversions and lower fees. Its vast network of local entities turns every international buyer into a local buyer, giving them the comfort and convenience of paying in their local currencies with the payment methods that they prefer. In addition to market-leading automated FX and global tax compliance, Reach offers a suite of integration options, ranging from no-code plug-and-play access to a powerful and fully customizable API."
        },
        {
          "blockType": "paragraph",
          "text": "For Media Inquiries:"
        },
        {
          "blockType": "paragraph",
          "text": "Reach Andrew Cunningham Head of Marketing & Media marketing@withreach.com"
        }
      ]
    },
    "meta": {
      "title": "Reach Announces Platform-Agnostic Global Tax Compliance Solution",
      "description": "Offered worldwide, this revolutionary service ensures ecommerce businesses are fully compliant with sales tax, VAT, GST and duties, with Reach assuming all liabilities and compliance risk.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-8170-9aca-cf07ec1bdfe3/01482528-38e4-48a8-8ec1-d258fe8bb200.png"
    },
    "sourceUrl": "https://www.withreach.com/resources/newsroom/reach-announces-platform-agnostic-global-tax-compliance-solution"
  },
  {
    "type": "post",
    "title": "Reach Bolsters Executive Leadership Team with Key Strategic Hires",
    "slug": "reach-bolsters-executive-leadership-team-with-key-strategic-hires",
    "excerpt": "New appointments in compliance, marketing, and product underscore Reach’s focus on global scale and subject-matter expertise",
    "publishedAt": "2025-07-24T04:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/23a9344f-6e66-80ea-acb5-c2c1a5b0865f/9dffe169-4b76-4500-92c6-a8f43b1e4138.webp",
      "alt": "Reach Bolsters Executive Leadership Team with Key Strategic Hires",
      "filename": "9dffe169-4b76-4500-92c6-a8f43b1e4138.webp"
    },
    "authors": [],
    "categories": [
      "Newsroom"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "CALGARY, ALBERTA, CANADA – July 24, 2025 – Reach, a leading Merchant of Record platform enabling seamless global ecommerce, is proud to announce the expansion of its senior leadership team with the appointments of Christopher Wassenaar as Chief Legal and Compliance Officer, Avneet Malhi as SVP of Marketing, and Kirk Johnson as VP of Product. These strategic hires reflect Reach’s continued investment in deep subject-matter expertise to support its rapid growth and strengthen its market leadership."
        },
        {
          "blockType": "paragraph",
          "text": "Christopher Wassenaar brings a wealth of executive and operational experience in international legal, regulatory, and compliance frameworks. With a background spanning multiple private equity and venture capital backed global financial services software and fintech platforms, Christopher will lead Reach's legal, regulatory, and compliance efforts, helping clients confidently navigate complex cross-border ecommerce challenges."
        },
        {
          "blockType": "paragraph",
          "text": "Joining as SVP of Marketing, Avneet Malhi brings two decades of experience leading global product marketing teams and scaling go-to-market operations in high-growth tech companies. Avneet has a strong track record of launching complex products—across Web3, payments, and SaaS—and leading cross-functional strategies. She will lead Reach’s global marketing strategy, brand evolution, and demand generation efforts."
        },
        {
          "blockType": "paragraph",
          "text": "Kirk Johnson, appointed VP of Product, has extensive experience driving product innovation for startups and scale-ups across multiple industries. He has led product teams in rapidly evolving markets, developing solutions that anticipate customer needs and deliver measurable impact. At Reach, Kirk will oversee the product roadmap, ensuring the platform continues to innovate for businesses and address the unique challenges of scaling globally."
        },
        {
          "blockType": "paragraph",
          "text": "“These hires mark an important chapter in Reach’s journey,” said Sam Ranieri, CEO of Reach. “Chris, Avneet, and Kirk each bring specialized expertise that strengthens our ability to serve enterprise businesses around the world. As we grow, we’re focused on assembling a team that not only understands the complexity of global commerce—but can simplify it for our customers.”"
        },
        {
          "blockType": "paragraph",
          "text": "This expanded leadership team is already at work supporting Reach’s mission: to make global ecommerce feel local, no matter where customers and merchants are."
        },
        {
          "blockType": "paragraph",
          "text": "ABOUT REACH"
        },
        {
          "blockType": "paragraph",
          "text": "Reach is the Merchant of Record for high-growth and established ecommerce retailers and SaaS businesses. Reach enables businesses to effortlessly activate global capabilities within the platforms they already use. This unlocks fraud prevention, tax compliance, and localized customer experiences without complex integration. Trusted by global brands, Reach streamlines cross-border operations, reduces costs, and improves transaction approval rates, empowering businesses to scale internationally with ease."
        }
      ]
    },
    "meta": {
      "title": "Reach Bolsters Executive Leadership Team with Key Strategic Hires",
      "description": "New appointments in compliance, marketing, and product underscore Reach’s focus on global scale and subject-matter expertise",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/23a9344f-6e66-80ea-acb5-c2c1a5b0865f/9dffe169-4b76-4500-92c6-a8f43b1e4138.webp"
    },
    "sourceUrl": "https://www.withreach.com/resources/newsroom/reach-bolsters-executive-leadership-team-with-key-strategic-hires"
  },
  {
    "type": "post",
    "title": "Reach Secures Major Investment to Accelerate its Global Expansion and Fuel Enterprise Merchant Growth",
    "slug": "reach-secures-major-investment-to-accelerate-its-global-expansion-and-fuel-enterprise-merchant-growth",
    "excerpt": "Backed by a significant investment from Primus Capital, Reach is positioned to deliver on its ambitious growth trajectory in 2025.",
    "publishedAt": "2025-02-20T05:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-81f9-9d42-d1c17f71111a/1ff6b4c5-76fb-4557-972e-31854e3fc90a.jpg",
      "alt": "Reach Secures Major Investment to Accelerate its Global Expansion and Fuel Enterprise Merchant Growth",
      "filename": "1ff6b4c5-76fb-4557-972e-31854e3fc90a.jpg"
    },
    "authors": [],
    "categories": [
      "Newsroom"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "heading",
          "level": "h2",
          "text": "FOR IMMEDIATE RELEASE"
        },
        {
          "blockType": "paragraph",
          "text": "Annual Gross Merchandise Volume (GMV) for Reach grew 95% year-over-year in Q4 2024 and the organization is primed to extend its leadership in the enterprise MoR market. The investment by Primus Capital will primarily be used to enhance support for enterprise businesses, further develop its ecommerce product mix, and expand its existing global entity network into additional in-demand markets."
        },
        {
          "blockType": "paragraph",
          "text": "“We’re thrilled to have Primus as a strategic partner as we continue to scale our solution for global merchants,” said Sam Ranieri, CEO of Reach. “This investment will allow us to strengthen our infrastructure, expand our international coverage, and empower our clients to unlock new markets and optimize cross-border operations with ease.”"
        },
        {
          "blockType": "paragraph",
          "text": "According to Ron Hess, Managing Director at Primus Capital, investing in Reach came down to a strong belief in the company’s value. “We’ve built a relationship with Sam and his team over the past few years and have witnessed the return on investment realized by Reach’s customers. The company’s impressive growth is driven by its innovative approach to solving the pain points of global expansion for retail and digital businesses. This investment will help fuel the company’s efforts to continue delivering unparalleled value to enterprise customers in the face of the challenges of a globalized marketplace.” Mr. Hess said. As a byproduct of this partnership, Reach is investing in new technology infrastructure and augmenting its team to support its evolving and rapidly-growing customer base, while concurrently developing its ecommerce product suite. The company’s expansion will further simplify cross-border transactions for its clients, which empowers businesses to focus on innovation while Reach handles the complexities of payments, tax, and fraud mitigation at scale."
        },
        {
          "blockType": "paragraph",
          "text": "Leveraging a Merchant of Record is essential for mid-market and enterprise businesses already active in cross-border ecommerce who need to unlock new levels of efficiency, revenue, and international performance. As businesses scale globally, managing local tax regulations and staying compliant with fluctuating tariffs and legal requirements becomes increasingly complex. An MoR simplifies this process by automating tax calculations and ensuring compliance across multiple markets, with much faster time to market than going alone."
        },
        {
          "blockType": "paragraph",
          "text": "“Given the current uncertainty surrounding international trade and cross-border sales, it’s critical for us to provide the most simple, robust, and complete global solution for our clients.” Mr. Ranieri said. “The investment from Primus will help us strengthen our position as a world leader in ecommerce, while continuing to find innovative ways for our clients to navigate the complex financial and regulatory borders standing between them and their customers.”"
        },
        {
          "blockType": "paragraph",
          "text": "RBC Capital Markets acted as the exclusive financial advisor to Reach on the transaction, and Osler, Hoskin & Harcourt LLP and Taft Law acted as legal advisors. Goodwin Procter LLP acted as legal adviser to Primus"
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "ABOUT REACH"
        }
      ]
    },
    "meta": {
      "title": "Reach Secures Major Investment to Accelerate its Global Expansion and Fuel Enterprise Merchant Growth",
      "description": "Backed by a significant investment from Primus Capital, Reach is positioned to deliver on its ambitious growth trajectory in 2025.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-81f9-9d42-d1c17f71111a/1ff6b4c5-76fb-4557-972e-31854e3fc90a.jpg"
    },
    "sourceUrl": "https://www.withreach.com/resources/newsroom/reach-secures-major-investment-to-accelerate-its-global-expansion-and-fuel-enterprise-merchant-growth"
  },
  {
    "type": "post",
    "title": "2025 US Tariffs Saga for E-commerce: Explained",
    "slug": "2025-us-tariffs-saga-for-e-commerce-explained",
    "excerpt": "Detailed breakdown of new US customs duties on Chinese, Mexican, and Canadian imports. Learn the chronology of events, de minimis thresholds, and what these tariff changes mean for e-commerce businesses and consumers in 2025.",
    "publishedAt": "2025-02-25T05:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-816d-9185-c95c0ffda5d1/8856b195-99a0-4944-a2ff-97083e35d8c7.png",
      "alt": "2025 US Tariffs Saga for E-commerce: Explained",
      "filename": "8856b195-99a0-4944-a2ff-97083e35d8c7.png"
    },
    "authors": [],
    "categories": [
      "Tarrifs",
      "Compliance",
      "United States",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "Now that the dust has settled, I want to provide a detailed breakdown of the customs duties that the US has imposed on China, Canada, and Mexico. Read on to understand what happened, the current situation, and what to expect in the future. This information will be useful for online sellers shipping goods to US buyers and buyers themselves."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "Chronology of Events"
        },
        {
          "blockType": "paragraph",
          "text": "Friday, February 1 – President Trump signs three executive orders, which impose the following trade restrictions on imports from Mexico, Canada, and China starting February 4:"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "An additional 25% tariff on all goods manufactured in Mexico.",
            "An additional 25% tariff on all goods manufactured in Canada (with exceptions for oil, gas, and other natural resources, which will be subject to a 10% tariff).",
            "An additional 10% tariff on all goods manufactured in China.",
            "These tariffs are imposed in addition to existing tariffs on goods from these countries.",
            "The duty-free threshold for parcels from these countries is eliminated. Previously, the duty-free threshold, also known as de minimis, was set at $800.",
            "Before this change, online purchases under $800 were exempt from customs duties. Read more about de minimis below."
          ]
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "President Trump speaks by phone with the President of Mexico and the Prime Minister of Canada.",
            "Mexico and Canada pledge additional funding to strengthen border security with the US to prevent drug smuggling and illegal immigration.",
            "President Trump delays the enforcement of the executive orders for Canada and Mexico by 30 days.",
            "The order concerning China remains in effect."
          ]
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "The executive order for China comes into effect.",
            "US Customs and Border Protection (CBP) announces that de minimis exemptions and simplified customs clearance are no longer applicable to goods from China and Hong Kong.",
            "The US Postal Service (USPS) suspends the acceptance of packages from China and Hong Kong."
          ]
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Hong Kong Post halts the acceptance of shipments to the US.",
            "Commercial couriers (DHL & UPS) start billing American recipients for additional tariffs and fees.",
            "President Trump signs an amendment to his executive order, which will be published on Friday, February 7. Keep this in mind—it's important.",
            "USPS unexpectedly resumes accepting shipments from China."
          ]
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Over a million unprocessed packages containing goods from China pile up at JFK Airport in New York.",
            "E-commerce sellers face chaos. As Reuters quotes one industry participant:"
          ]
        },
        {
          "blockType": "blockquote",
          "quote": "We're all running around like headless chickens at this moment in time, trying to second-guess what's going to happen.",
          "citation": ""
        },
        {
          "blockType": "paragraph",
          "text": "Friday, February 7:"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "The amendment to the executive order signed on Wednesday is published, reinstating the previously eliminated duty-free threshold for Chinese goods.",
            "However, this exemption is temporary and will remain in place only until the US Department of Commerce implements an \"adequate system for efficient processing and collection of customs duties.\""
          ]
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Hong Kong Post resumes accepting and sending shipments to the US.",
            "Ten days have passed since the executive orders were signed.",
            "The status quo is restored."
          ]
        },
        {
          "blockType": "paragraph",
          "text": "Thursday, February 27:"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "President Donald Trump confirmed that tariffs on Mexico and Canada will take effect on March 4.",
            "He also announced a tariff hike on Chinese imports, doubling the current 10% rate to 20%."
          ]
        },
        {
          "blockType": "paragraph",
          "text": "Monday, March 3:"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "President Trump issues two executive orders amending the original tariff orders for Canada and Mexico. The amendments confirm that de minimis will remain in place for both countries—at least temporarily—after March 4, 2025.",
            "A new executive order is published, doubling additional tariffs on China to 20%, as announced last week."
          ]
        },
        {
          "blockType": "paragraph",
          "text": "Tuesday, March 4:"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "U.S. Customs and Border Protection issues guidance confirming that tariffs on Canada, China, and Mexico take effect at midnight."
          ]
        },
        {
          "blockType": "paragraph",
          "text": "Friday, March 7:"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "A White House Fact Sheet confirms that the 25% tariffs will not apply to goods that meet the U.S.-Mexico-Canada Agreement (USMCA) rules of origin.",
            "Please read my new article to understand USMCA Rules of Origin and their impact on tariffs: https://www.linkedin.com/pulse/understanding-usmca-rules-origin-impact-tariffs-grigory-shchichko-yqhjf/"
          ]
        },
        {
          "blockType": "paragraph",
          "text": "🆕 Wednesday, April 2:"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "President Trump announces new reciprocal tariffs on imports from 83 countries.",
            "A separate Executive Order eliminates the $800 de minimis threshold for goods from China, effective May 2, 2025.",
            "From that date, all Chinese-origin goods—regardless of value—will be subject to full customs duties."
          ]
        },
        {
          "blockType": "paragraph",
          "text": "You may ask, \"What was that all about?\" And you'd be surprised if I told you this is just the beginning."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "What Foreign E-commerce Sellers and US Buyers Need to Know"
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "What is De Minimis?"
        },
        {
          "blockType": "paragraph",
          "text": "Many countries have a duty-free threshold for foreign purchases, known as de minimis. For example:"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "European Union: EUR 150",
            "United Kingdom: GBP 135",
            "Singapore: SGD 400",
            "Australia: AUD 1,000"
          ]
        },
        {
          "blockType": "paragraph",
          "text": "Online purchases from abroad below these thresholds are exempt from customs duties."
        },
        {
          "blockType": "paragraph",
          "text": "Until recently, the US had a single duty-free threshold of $800 for online purchases from all countries. One of the main points of the executive order was the removal of this exemption for all goods produced in China or Hong Kong."
        },
        {
          "blockType": "paragraph",
          "text": "Yes, the duty-free threshold for Chinese goods has been temporarily reinstated, but the key word is temporary. Once the US Department of Commerce is ready to efficiently collect customs duties, the exemption will be eliminated again."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Why Is De Minimis Important?"
        },
        {
          "blockType": "paragraph",
          "text": "Here’s a practical example of purchasing a women's dress made in China:"
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "New US Tariffs: Myths vs. Reality"
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Myth: Chinese goods will only become 10% more expensive."
        },
        {
          "blockType": "paragraph",
          "text": "✅ Reality: The February 2025 executive order adds a 10% tariff on top of existing ones. In practice, Chinese-made goods may face up to three different tariffs:"
        },
        {
          "blockType": "list",
          "style": "ordered",
          "items": [
            "Base tariff (varies by product, e.g., 14.9% for cotton dresses, 32% for synthetic skirts/blouses).",
            "Section 301 Tariff (imposed in 2018-2019, e.g., 7.5% on apparel, 15% on smartphones/laptops).",
            "New 20% tariff (10% was added in February and doubled in March 2025).",
            "Reciprocal tariff of 34% (effective April 5, 2025)"
          ]
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Myth: Goods from foreign e-commerce stores (e.g., UK, Australia) won't get more expensive."
        },
        {
          "blockType": "paragraph",
          "text": "✅ Reality: The tariffs apply to the country of origin, not just the shipping country. Example: A UK store sells China-made products from its warehouse. ➡️ Even if shipped from the UK, it will be taxed as a Chinese product."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Myth: De Minimis is back—no need to worry."
        },
        {
          "blockType": "paragraph",
          "text": "✅ Reality: The original executive order eliminating de minimis is still in effect. The exemption is only temporary."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Myth: Foreign online purchases under $800 aren’t subject to sales tax."
        },
        {
          "blockType": "paragraph",
          "text": "✅ Reality: De minimis only applies to customs duties, not state sales tax."
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Each state sets its own sales tax rules.",
            "Many states require foreign sellers to register and collect sales tax once they reach an economic nexus threshold (usually $100,000 in sales per year).",
            "Some states (e.g., California, New York, Texas) have a higher threshold: $500,000."
          ]
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Myth: These new tariffs are just temporary and will go away soon."
        },
        {
          "blockType": "paragraph",
          "text": "✅ Reality: Trump's economic policy aims to lower corporate and personal income taxes. ➡️ To compensate for lost revenue, tariffs on foreign goods are a key strategy."
        },
        {
          "blockType": "conclusion",
          "heading": "Conclusion",
          "text": "In my opinion, these tariffs could trigger a global chain reaction. E-commerce businesses and marketplaces must be ready to quickly adapt to changes in customs and tax policies —and explain them clearly to customers.\n\nSo, brace yourself for a Tariff Winter. ❄️\n\n📌 I’ll keep updating this article as new developments arise.\n\n• Updated on February 27, with tariffs for Mexico and Canada coming into effect on March 4.\n• Updated on March 3, with de minimis remaining after March 4.\n• Updated on March 4, with double tariffs for China.\n• Updated on March 10, with exemption for USMCA-compliant goods.\n• Updated on April 7, with reciprocal tariffs and abolishment of de minimis for China."
        }
      ]
    },
    "meta": {
      "title": "2025 US Tariffs Saga for E-commerce: Explained",
      "description": "Detailed breakdown of new US customs duties on Chinese, Mexican, and Canadian imports. Learn the chronology of events, de minimis thresholds, and what these tariff changes mean for e-commerce businesses and consumers in 2025.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-816d-9185-c95c0ffda5d1/8856b195-99a0-4944-a2ff-97083e35d8c7.png"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/2025-us-tariffs-saga-for-e-commerce-explained"
  },
  {
    "type": "post",
    "title": "A guide to optimizing your cross-border sales on Shopify",
    "slug": "a-guide-to-optimizing-your-cross-border-sales-on-shopify",
    "excerpt": "Enable local processing through your existing Shopify stores with our Merchant of Record model with zero technical lift.",
    "publishedAt": "2023-10-18T04:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-8128-a1f6-f8ff68b93f24/636c95c0-a400-4687-8059-10e86d4c8de1.jpg",
      "alt": "A guide to optimizing your cross-border sales on Shopify",
      "filename": "636c95c0-a400-4687-8059-10e86d4c8de1.jpg"
    },
    "authors": [],
    "categories": [
      "Localized Customer Experience",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Summary"
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Shopify Markets"
        },
        {
          "blockType": "blockquote",
          "quote": "“Markets is an attractive and cost-effective option for Shopify merchants, as it allows them to expand and test a new region with lower costs to market. This gives you time to prove your business case before investing further time, money and staff resources in that region. When used in conjunction with Expansion Stores, Markets can also help to broaden your reach and serve additional markets beyond those where you are already established.“ Nichola Birch, Lead Product Manager at Swanky",
          "citation": ""
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Expansion Stores"
        },
        {
          "blockType": "paragraph",
          "text": "This independence is critical for brands seeking a more robust approach to localizing their presence in individual markets. As each expansion store functions independently, you can implement optimizations in areas like region-specific content, promotional campaigns and discounts to enhance your ability to convert more in a chosen jurisdiction."
        },
        {
          "blockType": "paragraph",
          "text": "Expansion stores also enable functionality that's not just consumer-facing. They allow for the payout of multiple currencies, so if you need to be paid in currency local to your store in a specific region, extension stores can make that happen. The multi-store approach also enables a more straightforward solution for complex pricing, shipping, tax, and warehousing rules. As you can manage each store individually, you can tailor your stores for each of these areas to meet the requirements of a specific geography."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Increased Cost"
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Increased Time Managing Stores"
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Not Truly Local"
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Taking Shopify Expansion Stores To The Next Level"
        },
        {
          "blockType": "blockquote",
          "quote": "“Our unified codebase allows you to retain the localized content and functionality of each regional store, while managing shared components from the central codebase. Once the master code has been created, future expansion stores can be easily spun out for new regions, whilst any new updates or improvements can be automatically rolled out across all the stores simultaneously. “ Ian Jamieson, Head of Technology at Swanky",
          "citation": ""
        },
        {
          "blockType": "paragraph",
          "text": "Furthermore, you can unlock local processing in over 70 markets worldwide with a no-code integration using our Merchant of Record model. By localizing your payments through the Reach MoR network, you can increase your conversions by up to 20% and gain fee savings of up to 40% in your Shopify expansion stores."
        },
        {
          "blockType": "paragraph",
          "text": "Explore the analysis below of an Australian based retailer selling into the US which factors in both the benefits and additional cost of having an localized extension store vs. Shopify Markets."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "What would You do with an Extra $20K per Month?"
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Go Global with The Right Partners"
        },
        {
          "blockType": "paragraph",
          "text": "Reach & Swanky can enhance your businesses' ability to scale efficiently with Shopify expansion stores, save on fees, increase conversions, and get the best ROI while you grow internationally."
        },
        {
          "blockType": "paragraph",
          "text": "Learn more about our Merchant of Record model’s seamless no-code integration for your Shopify extension stores."
        },
        {
          "blockType": "paragraph",
          "text": "Learn more about Swanky’s unified codebase solution for managing multiple Shopify Plus expansion stores."
        },
        {
          "blockType": "paragraph",
          "text": "Further, explore Shopify Markets and expansion stores in Swanky’s in-depth blog."
        }
      ]
    },
    "meta": {
      "title": "A guide to optimizing your cross-border sales on Shopify",
      "description": "Enable local processing through your existing Shopify stores with our Merchant of Record model with zero technical lift.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-8128-a1f6-f8ff68b93f24/636c95c0-a400-4687-8059-10e86d4c8de1.jpg"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/a-guide-to-optimizing-your-cross-border-sales-on-shopify"
  },
  {
    "type": "post",
    "title": "Beyond the App Store: Why the Epic v. Apple Ruling Doesn't Solve the Monetization Puzzle (1)",
    "slug": "beyond-the-app-store-why-the-epic-v-apple-ruling-doesnt-solve-the-monetization-puzzle-1",
    "excerpt": "App monetization in the U.S. just got flipped on its head. In a landmark ruling on April 30, 2025, in the Epic v. Apple case, a U.S. court declared that Apple can no longer prevent app developers from directing U.S. users to external payment options.",
    "publishedAt": "2025-05-26T04:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/2819344f-6e66-80b3-8b1b-e9ccacc3283e/e0595d06-a0ae-4a2e-a419-6db93d73db77.jpg",
      "alt": "Beyond the App Store: Why the Epic v. Apple Ruling Doesn't Solve the Monetization Puzzle (1)",
      "filename": "e0595d06-a0ae-4a2e-a419-6db93d73db77.jpg"
    },
    "authors": [
      "Shayne Plesa-Naden"
    ],
    "categories": [
      "Recurring Payments",
      "Tax",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "However, this newfound freedom comes with responsibilities. Managing your own payments means you're now responsible for handling the core payment functionalities that Apple once did, like tax compliance, fraud, chargebacks and more. Let's unpack what this means and how you can get the most out of this ruling."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "What the Ruling Delivers"
        },
        {
          "blockType": "paragraph",
          "text": "The Epic v. Apple decision brought about significant shifts for app developers in the United States. You can now integrate links within your app that guide U.S. users to your website or payment gateway to complete purchases, and Apple is now barred from including negative messages on these payment links. Along with the newfound freedom, Apple can no longer charge their 15 to 30 percent commission on these external payments. Instantly, that's more money back in your pocket. Plus, you now have more freedom to inform U.S. users about these alternative payment options directly within your app."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "The Upsides for Your App Business"
        },
        {
          "blockType": "paragraph",
          "text": "This ruling unlocks powerful new avenues for revenue growth in the U.S. market and increased control over your payments, giving you the ability to:"
        },
        {
          "blockType": "paragraph",
          "text": "Reclaim Your Margin"
        },
        {
          "blockType": "paragraph",
          "text": "The most immediate benefit is the potential to retain a significant percentage of revenue that previously went to Apple, directly impacting your bottom line."
        },
        {
          "blockType": "paragraph",
          "text": "Leverage Your Preferred Payment Processor"
        },
        {
          "blockType": "paragraph",
          "text": "Integrate seamlessly with payment gateways of your choice to gain more flexibility in terms of fees, features, and reporting."
        },
        {
          "blockType": "paragraph",
          "text": "Unlock Flexible Pricing and Promotions"
        },
        {
          "blockType": "paragraph",
          "text": "Implement your own pricing strategies, offer exclusive discounts through your own channels, and tailor promotions directly to your audience."
        },
        {
          "blockType": "paragraph",
          "text": "Own Your Customer Data"
        },
        {
          "blockType": "paragraph",
          "text": "By directing U.S. consumers to your own checkout, you can now capture valuable first-party customer data, including email addresses, enabling more personalized marketing and improved attribution tracking."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "The Catch: You Have to Manage Your Own Payments"
        },
        {
          "blockType": "paragraph",
          "text": "While the Epic v. Apple ruling provides you with a huge opportunity to maximize your growth in the U.S. marketplace, there are challenges you will have to navigate when operating your own web stores' payments."
        },
        {
          "blockType": "paragraph",
          "text": "Tax Compliance"
        },
        {
          "blockType": "paragraph",
          "text": "You are responsible for understanding the nuances and complexity of tax compliance yourself. That means navigating tax regulations in every individual U.S. state you sell into and VAT, GST, and sales tax across numerous international jurisdictions. Failure to meet tax compliance requirements will result in damaging penalties, legal repercussions, and damage to your brands reputation."
        },
        {
          "blockType": "paragraph",
          "text": "Fraud and Chargeback Management"
        },
        {
          "blockType": "paragraph",
          "text": "Selling anything online exposes you to the risks of fraudulent transactions and costly chargebacks, which can have a much more significant impact on your bottom line than Apple’s 30% commission ever did."
        },
        {
          "blockType": "paragraph",
          "text": "Without Apple's infrastructure managing all these critical functions of your payments, you will have to manage tax compliance, fraud prevention, chargeback management, and cross-border payments complexity, such as currency conversion in-house. Building out the specialized teams to manage all of this is not only costly, it requires a lot of time and effort to do it right."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "How to Optimize Your Operations in a Post-Apple Fee World"
        },
        {
          "blockType": "paragraph",
          "text": "To capitalize on the Epic vs. Apple ruling, you need a partner who simplifies the complexity of payments. That’s where we come in. As the trusted Merchant of Record for leading digital businesses worldwide, we handle managing payments, tax compliance, and fraud, so you can focus on growing your app. Already integrated with leading platforms like Stripe, Adyen and Checkout.com, Reach is easy to activate and built to optimize your operations."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "Ready to Turn This Ruling into Revenue?"
        },
        {
          "blockType": "paragraph",
          "text": "The Epic v. Apple decision opens exciting doors, but capturing true success gets significantly easier with a partner equipped to handle the challenges of digital ecommerce for you. Don't let the complexities of taxes, fraud, and payments limit your newfound freedom."
        },
        {
          "blockType": "paragraph",
          "text": "Contact us today and enhance your app's growth without sacrificing your hard-earned revenue to app store fees or the hidden costs of owning your online payments."
        }
      ]
    },
    "meta": {
      "title": "Beyond the App Store: Why the Epic v. Apple Ruling Doesn't Solve the Monetization Puzzle (1)",
      "description": "App monetization in the U.S. just got flipped on its head. In a landmark ruling on April 30, 2025, in the Epic v. Apple case, a U.S. court declared that Apple can no longer prevent app developers from directing U.S. users to external payment options.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/2819344f-6e66-80b3-8b1b-e9ccacc3283e/e0595d06-a0ae-4a2e-a419-6db93d73db77.jpg"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/beyond-the-app-store-why-the-epic-v-apple-ruling-doesnt-solve-the-monetization-puzzle-1"
  },
  {
    "type": "post",
    "title": "Creating Sticky Shoppers with Alternative Payment Methods In Europe",
    "slug": "creating-sticky-shoppers-with-alternative-payment-methods-in-europe",
    "excerpt": "Learn how unlocking alternative payment methods can enable you to convert more and create higher consumer retention in the European marketplace.",
    "publishedAt": "2023-10-06T04:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-81c8-9853-e4d59780fb92/5e67226e-1f37-466e-a3d4-036a0c9dcf68.webp",
      "alt": "Creating Sticky Shoppers with Alternative Payment Methods In Europe",
      "filename": "5e67226e-1f37-466e-a3d4-036a0c9dcf68.webp"
    },
    "authors": [],
    "categories": [
      "Localized Customer Experience",
      "Alternative Payment Methods",
      "Europe",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "Europe offers lucrative opportunities for businesses looking to scale globally, but capturing conversions and solidifying shopper retention in each continent can be tricky. Europe's population is culturally diverse, and each nationality comes with its own preferences for how consumers shop online and how they pay for ecommerce goods and services."
        },
        {
          "blockType": "paragraph",
          "text": "Due to this vast array of consumer behavior and stratification of desired payment experiences, Europe does not have a one-size-fits-all preferred payment method. For instance, you can't just offer credit cards and hope that will work for all shoppers. Instead, you may have to provide alternative methods that they know and trust in order to secure recurring and loyal customers."
        },
        {
          "blockType": "paragraph",
          "text": "Let's take a closer look at a specific European country, Sweden, for example, to explore what this looks like."
        },
        {
          "blockType": "paragraph",
          "text": "Sweden is a powerhouse of ecommerce revenue potential as 9 out of 10 consumers in the Nordic region regularly shop online, and the country as a whole spent an estimated 22 billion Euros online in 2021. However, tapping into the market can be difficult if you don't offer the payment experience the country's consumers expect. For instance, Sweden loves to pay in installments, with approximately 25% of their ecommerce buyers using the payment method to shop online. If you don't offer this payment method when selling in the country and others like it, you introduce friction into your consumer's checkout experience, which can result in lost conversions."
        },
        {
          "blockType": "paragraph",
          "text": "To ensure your European shoppers can pay in a method that’s local to them, you have to integrate with a payment partner that can offer the methods they want. Two ways of doing this include connecting directly with a payment processor that’s integrated with alternative payment methods you need, or integrating with a Merchant of Record (MOR)."
        },
        {
          "blockType": "paragraph",
          "text": "Integrating directly with a payment processor lets you offer the alternative payment methods your customers demand. However, you may have to repeat this process for each of the payment methods you need, since the processor may have integration gaps in the alternative methods you want to offer. Additionally, this option will only allow you to process cross-border unless you have an established local entity in the region. This means you will be exposed to higher processing fees and false declines when selling internationally."
        },
        {
          "blockType": "paragraph",
          "text": "Alternatively, you can integrate with a Merchant of Record. Since a MOR already has a network of established relationships with payment processors and banks, you can unlock a full suite of alternative payment methods without requiring multiple integrations. Connecting with a MOR can also unlock local acquiring in your desired regions, since the MOR has already done the heavy lifting to set up global entities. Enabling local acquiring increases your international transactions' health and approval rates, and decreases processing fees. Overall, integrating with a Merchant of Record provides the most seamless approach to offering alternative payment methods in regions like Sweden and the rest of Europe. The MOR model only requires one integration to empower you to offer optimized alternative payment methods like Klarna. And thanks to the MOR model's ability to provide local acquiring, you can gain savings on processing fees while increasing your overall conversions simultaneously. This ensures you're creating loyal and recurring consumers in the European marketplace while capturing more revenue."
        },
        {
          "blockType": "paragraph",
          "text": "Want to learn more about creating sticky customers in the European marketplace? Connect with our team and explore our Merchant of Record model to see how we can help you scale internationally with preferred alternative payment methods like Klarna."
        },
        {
          "blockType": "paragraph",
          "text": "Check out Klarna to discover how they're elevating consumer experiences worldwide and helping brands grow with the smoothest and safest way to offer installment payments."
        }
      ]
    },
    "meta": {
      "title": "Creating Sticky Shoppers with Alternative Payment Methods In Europe",
      "description": "Learn how unlocking alternative payment methods can enable you to convert more and create higher consumer retention in the European marketplace.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-81c8-9853-e4d59780fb92/5e67226e-1f37-466e-a3d4-036a0c9dcf68.webp"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/creating-sticky-shoppers-with-alternative-payment-methods-in-europe"
  },
  {
    "type": "post",
    "title": "Decoding Ecommerce in Argentina: Fraud and Payment Trends",
    "slug": "decoding-ecommerce-in-argentina-fraud-and-payment-trends",
    "excerpt": "Explores the unique ecommerce challenges shaped by Argentina's economy, currency preferences, government regulations, and the rise of \"affordable luxury\" fraud. Learn practical tips to adapt your fraud prevention strategies and succeed in Argentina.",
    "publishedAt": "2025-04-09T04:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-81f7-a226-e3d33d94f7db/1b66e0da-37af-4762-b4dc-187e61788e1b.jpg",
      "alt": "Decoding Ecommerce in Argentina: Fraud and Payment Trends",
      "filename": "1b66e0da-37af-4762-b4dc-187e61788e1b.jpg"
    },
    "authors": [],
    "categories": [
      "Fraud",
      "Argentina",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "If you’re looking to expand your ecommerce business into Argentina, there are a few things you’ll want to understand about the local market—especially when it comes to online fraud. Argentina’s economic and political history has shaped how people shop online and, in turn, how fraud shows up."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "How the Economy Shapes Ecommerce Fraud"
        },
        {
          "blockType": "paragraph",
          "text": "Argentina’s economy has seen a lot of ups and downs. Currency instability and high inflation have led many people to prefer cash over digital payments. Credit card use isn’t as common, thanks to sky-high interest rates and concerns about the value of the peso.\nBecause of the country’s bigger social and economic challenges, local authorities often focus their resources on more serious crimes—meaning fraud prevention isn’t always a top priority. That makes the online space a little riskier for ecommerce businesses."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "Why Cash and the U.S. Dollar Are So Popular"
        },
        {
          "blockType": "paragraph",
          "text": "In recent years, the peso hasn’t held its value well, so many Argentinians prefer to save and spend in U.S. dollars when they can. This often leads people to shop online in USD—even using VPNs to look like they're buying from the U.S.—which can trip up fraud detection systems. If your business only accepts pesos, you might see fewer conversions as a result.\nWith the use of USD for goods shipped to Argentina, out-of-the-box fraud filters might flag these transactions as suspicious just because the currency, billing address, or shipping info doesn’t line up, which leads to false declines and lost sales."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "How Government Rules Can Create Unusual Shopping Behaviors"
        },
        {
          "blockType": "paragraph",
          "text": "To protect its economy, Argentina has often placed limits on how much people can buy online and what they can import. While well-intentioned, these restrictions can have unintended side effects."
        },
        {
          "blockType": "paragraph",
          "text": "In the past, people who don’t use their limit would sell access to their accounts to let others buy more online. This frequently leads to purchases with mismatched names and addresses. To a fraud engine, that looks shady. But in reality, it might just be someone trying to get around the system."
        },
        {
          "blockType": "paragraph",
          "text": "Some shoppers take things a step further, using credit cards from neighboring countries like Chile or Bolivia to get past restrictions. This leads to a rise in cross-border transactions—and more confusion for fraud prevention systems."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "The Rise of “Affordable Luxuries” in Fraud"
        },
        {
          "blockType": "paragraph",
          "text": "You might think fraudsters only go after big-ticket items, but that’s not always the case in Argentina. With fewer goods available due to import rules and tight budgets, there's high demand for small, desirable items—like phone accessories or beauty products. These “affordable luxuries” are easier to sell and less likely to draw attention than more expensive items.\nSometimes these items are bought with stolen credit card info and then sold in person with cash transactions."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "Tips for Selling Online in Argentina"
        },
        {
          "blockType": "paragraph",
          "text": "To succeed in Argentina, you need more than a strong product—you need to understand how people shop and the challenges they face. Here are a few ways to set yourself up for success:"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Offer cash-based payment options where possible.",
            "Keep an eye on economic and political changes—they affect how people shop.",
            "Don’t rely too heavily on red flags like mismatched names or billing addresses. In Argentina, they might not mean fraud.",
            "Adjust your fraud tools to reflect local behaviors, rather than using a global template.",
            "Learn how your Argentinian customers shop and what motivates their purchases."
          ]
        },
        {
          "blockType": "paragraph",
          "text": "The Argentinian market is complex, but it’s also full of opportunity. With the right local insight and tools in place, you can protect your business and connect more effectively with your customers."
        },
        {
          "blockType": "paragraph",
          "text": "🎥 Want to dive deeper?"
        },
        {
          "blockType": "paragraph",
          "text": "Watch our latest episode of True Fraud featuring expert Pablo Torres, where we unpack everything you need to know about ecommerce in Argentina."
        },
        {
          "blockType": "paragraph",
          "text": "Ready to make your store global-ready?"
        },
        {
          "blockType": "paragraph",
          "text": "See how Reach can help."
        }
      ]
    },
    "meta": {
      "title": "Decoding Ecommerce in Argentina: Fraud and Payment Trends",
      "description": "Explores the unique ecommerce challenges shaped by Argentina's economy, currency preferences, government regulations, and the rise of \"affordable luxury\" fraud. Learn practical tips to adapt your fraud prevention strategies and succeed in Argentina.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-81f7-a226-e3d33d94f7db/1b66e0da-37af-4762-b4dc-187e61788e1b.jpg"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/decoding-ecommerce-in-argentina-fraud-and-payment-trends"
  },
  {
    "type": "post",
    "title": "Duty Avoidance in Cross-Border Ecommerce: The Risks Behind the Shortcut",
    "slug": "duty-avoidance-in-cross-border-ecommerce-the-risks-behind-the-shortcut",
    "excerpt": "Beware of duty avoidance schemes in cross-border ecommerce. Learn the serious customs, tax, and reputational risks of using shell importers to slash import duties. Don't fall for risky shortcuts.",
    "publishedAt": "2025-10-29T04:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/29b9344f-6e66-80ab-a87f-da649d0b2575/023849e5-f6f1-4960-86d3-0a3d248ab8ff.png",
      "alt": "Duty Avoidance in Cross-Border Ecommerce: The Risks Behind the Shortcut",
      "filename": "023849e5-f6f1-4960-86d3-0a3d248ab8ff.png"
    },
    "authors": [],
    "categories": [
      "Tarrifs",
      "United States",
      "Merchant of Record",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "With tariffs rising and cross-border shipping costs squeezing margins, it’s no surprise that ecommerce brands are looking for creative ways to manage their landed costs. But there’s a growing tactic being pitched to DTC retailers that comes with significant hidden risks: duty avoidance through shell importers."
        },
        {
          "blockType": "paragraph",
          "text": "Here’s how it typically works: a brand sets up a U.S. shell company, often in Delaware, to act as the Importer of Record (IOR) for shipments coming into the U.S. Instead of declaring the full retail value of the product sold to the consumer, the shell company “buys” the product at cost — say, $10 instead of the $185 the customer pays. The idea is that this artificial “cost price” gets declared to U.S. Customs, slashing the import duty."
        },
        {
          "blockType": "paragraph",
          "text": "At first glance, it may seem like a clever workaround. But this strategy sits on shaky legal ground and opens up brands to serious customs, tax, and reputational consequences. Here’s what you need to know."
        },
        {
          "blockType": "paragraph",
          "text": "## The Real Cost of Cutting Corners"
        },
        {
          "blockType": "paragraph",
          "text": "U.S. Customs and Border Protection (CBP) requires importers to declare the true value of goods — not an internal transfer price created for tax or logistics convenience. If the U.S. shell company is related to the foreign seller (which it usually is), then any sale between them is considered a related-party transaction and must reflect arm’s-length pricing. Declaring the low manufacturing cost as the value — without markup — is likely a violation of customs valuation rules. If you’re headquartered outside the U.S., don’t assume you’re immune — the IRS has mutual collection agreements with countries like Australia and the UK, meaning they can work with foreign tax agencies to enforce and collect unpaid duties and penalties internationally."
        },
        {
          "blockType": "paragraph",
          "text": "Violations can result in:"
        },
        {
          "blockType": "paragraph",
          "text": "- Back duties owed on the full retail value - Fines up to the full value of the goods - Seizure of goods at port - Lose Importer license - Potential criminal charges if deemed intentional fraud"
        },
        {
          "blockType": "paragraph",
          "text": "In other words, duty avoidance via artificial transfer pricing isn’t optimization — it’s often customs fraud."
        },
        {
          "blockType": "paragraph",
          "text": "## Why the “Shell Importer” Model Triggers Scrutiny"
        },
        {
          "blockType": "paragraph",
          "text": "The problem with the shell importer model is that it often mimics the structure of a legitimate B2B2C setup — without the substance. U.S. Customs looks closely for indicators of fraud, including:"
        },
        {
          "blockType": "paragraph",
          "text": "- A U.S. entity that lacks real independence: no staff, no expenses, no bank activity - Repeated related-party imports declared at unusually low prices - Use of commercial clearance on individual customer orders, rather than bulk entries — a red flag in standard B2B operations"
        },
        {
          "blockType": "paragraph",
          "text": "These signals can trigger a CBP investigation, especially if there's a pattern suggesting the structure was designed solely to mask the true transaction value. Even if the U.S. entity appears valid on paper, proving the transfer price is arm’s-length is a high bar — and many retailers fail to meet it."
        },
        {
          "blockType": "paragraph",
          "text": "The result? Back duties, fines, audits, shipment delays, and potential enforcement actions. In the chaos of adapting to new tariff regimes, retailers may be unknowingly walking into avoidable legal and financial exposure."
        },
        {
          "blockType": "paragraph",
          "text": "## Enforcement Is Heating Up"
        },
        {
          "blockType": "paragraph",
          "text": "U.S. regulators are not only aware of these schemes — they’re actively targeting them. In 2025, the Department of Justice launched a Trade Fraud Task Force focused specifically on cracking down on customs fraud, undervaluation, and shell company tactics. CBP has also ramped up its data analytics, identifying abnormal pricing patterns or repeated undervaluation attempts."
        },
        {
          "blockType": "paragraph",
          "text": "Recent examples include:"
        },
        {
          "blockType": "paragraph",
          "text": "- $12.4M False Claims Act settlement against a Texas importer who falsified customs declarations - A multi-agency probe into over $250M in duty evasion involving shell companies routing goods from China through third countries - DOJ’s use of criminal statutes like wire fraud, conspiracy, and smuggling to prosecute duty evasion rings"
        },
        {
          "blockType": "paragraph",
          "text": "If a company tries this model and gets caught, it’s not just a slap on the wrist. It can lead to audits, lawsuits, and long-term import restrictions."
        },
        {
          "blockType": "paragraph",
          "text": "## Beyond Fines: Tax, Operational, and Brand Risks"
        },
        {
          "blockType": "paragraph",
          "text": "Even if customs risks don’t scare you off, consider the broader tax and operational exposure this model creates."
        },
        {
          "blockType": "paragraph",
          "text": "### 1. Federal & State Tax Obligations Still Apply"
        },
        {
          "blockType": "paragraph",
          "text": "Incorporating a shell importer in Delaware doesn’t make your tax obligations disappear:"
        },
        {
          "blockType": "paragraph",
          "text": "- The shell entity is still subject to U.S. corporate income tax on any profits it books (e.g., retail price minus import “cost”)."
        },
        {
          "blockType": "paragraph",
          "text": "Failure to register and collect properly can lead to back taxes, interest, and state penalties. The tax authorities in these states are just as aggressive as federal agencies when it comes to enforcement."
        },
        {
          "blockType": "paragraph",
          "text": "### 2. Reputational Fallout"
        },
        {
          "blockType": "paragraph",
          "text": "Consumers expect modern brands to be transparent and ethical. If your company gets publicly linked to duty evasion — whether through government action or whistleblower lawsuits — the PR damage can be severe. In a competitive DTC landscape, trust is hard to earn and easy to lose."
        },
        {
          "blockType": "paragraph",
          "text": "## There Are Compliant Models — But They Take Real Work"
        },
        {
          "blockType": "paragraph",
          "text": "To be clear, there are legitimate ways to optimize duties for cross-border ecommerce. Some retailers choose to set up a fully operational U.S. subsidiary with local staff, a bank account, physical presence (like a 3PL), and their own decision-making authority. If structured properly, these entities can buy inventory at a true transfer price from the parent company and import it at that value — but only if they meet arm’s-length standards and obtain validation from CBP or a customs valuation ruling."
        },
        {
          "blockType": "paragraph",
          "text": "However, this setup isn’t fast or cheap. It requires:"
        },
        {
          "blockType": "paragraph",
          "text": "- A functioning U.S. entity with real operations (not just paper filings) - Investment in local infrastructure and compliance controls - Transfer pricing documentation that can survive an audit - Often, upfront engagement with CBP to get approval for valuation methods"
        },
        {
          "blockType": "paragraph",
          "text": "In short, this is a real business expansion — not a workaround. It’s how large, global retailers do it right. But in the scramble to manage new tariffs, some brands are opting for riskier shortcuts without fully understanding the consequences."
        },
        {
          "blockType": "paragraph",
          "text": "## Ask the Right Questions Before You Say Yes"
        },
        {
          "blockType": "paragraph",
          "text": "If a partner or consultant pitches a model that sounds “too good to be true,” pressure test it. Ask:"
        },
        {
          "blockType": "paragraph",
          "text": "- Will your organization assume liability if customs flags the value? - Is the declared value defensible under CBP rules? - Do you have customs to sign off from the CBA? - What legal opinions back up the strategy — and who pays if it fails? - Are duties being prepaid or deferred — and by whom?"
        },
        {
          "blockType": "paragraph",
          "text": "If the answers are vague or the risks are brushed aside, that’s a sign to walk away."
        },
        {
          "blockType": "paragraph",
          "text": "## Final Thoughts"
        },
        {
          "blockType": "paragraph",
          "text": "In today’s competitive landscape, controlling cross-border costs is crucial — but compliance matters more. While shell importer schemes promise fast savings, they open the door to legal, financial, and reputational harm. U.S. authorities are watching closely, and the consequences are real."
        },
        {
          "blockType": "paragraph",
          "text": "Brands that build sustainable, compliant international operations will outlast those chasing shortcuts. Invest in proper strategy, ask the hard questions, and remember: there’s no such thing as “free duty.”"
        }
      ]
    },
    "meta": {
      "title": "Duty Avoidance in Cross-Border Ecommerce: The Risks Behind the Shortcut",
      "description": "Beware of duty avoidance schemes in cross-border ecommerce. Learn the serious customs, tax, and reputational risks of using shell importers to slash import duties. Don't fall for risky shortcuts.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/29b9344f-6e66-80ab-a87f-da649d0b2575/023849e5-f6f1-4960-86d3-0a3d248ab8ff.png"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/duty-avoidance-in-cross-border-ecommerce-the-risks-behind-the-shortcut"
  },
  {
    "type": "post",
    "title": "Ecommerce Fraud & Payment Breaches: What Every Online Business Needs to Know",
    "slug": "ecommerce-fraud-payment-breaches-what-every-online-business-needs-to-know",
    "excerpt": "Cybersecurity is no longer just an IT concern – it’s a business imperative for ecommerce companies. This blog post explores the core principles of ecommerce security, from protecting customer data and maintaining trust to addressing rising threats like payment breaches and insider risks.",
    "publishedAt": "2025-05-21T04:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/13c9344f-6e66-818e-bdab-d0aaced37d5e/ae30c6f1-2c25-4ed3-bc17-75ce092e6000.jpg",
      "alt": "Ecommerce Fraud & Payment Breaches: What Every Online Business Needs to Know",
      "filename": "ae30c6f1-2c25-4ed3-bc17-75ce092e6000.jpg"
    },
    "authors": [],
    "categories": [
      "Fraud",
      "Cybersecurity",
      "Compliance",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "Cybersecurity isn’t just something for your IT team to worry about, it’s a core part of doing business online. For ecommerce companies, protecting customer data, preventing fraud, and securing transactions are essential to earning trust and keeping your store running smoothly."
        },
        {
          "blockType": "paragraph",
          "text": "As online shopping continues to grow, so do the risks. Understanding those risks, and how to stay ahead of them, is a must for anyone in digital commerce."
        },
        {
          "blockType": "paragraph",
          "text": "### Cybersecurity Basics for Ecommerce"
        },
        {
          "blockType": "paragraph",
          "text": "At its core, ecommerce cybersecurity is about protecting three key things: your customers’ data, your ability to process transactions, and the trust you’ve built with your audience."
        },
        {
          "blockType": "paragraph",
          "text": "This is where the CIA triad comes into play."
        },
        {
          "blockType": "paragraph",
          "text": "- Confidentiality means keeping customer information and payment details private. - Integrity ensures that orders and transactions aren’t tampered with. - Availability means your store remains accessible and functional for customers."
        },
        {
          "blockType": "paragraph",
          "text": "If even one of these foundational elements is compromised, your business could face serious disruptions and reputational harm."
        },
        {
          "blockType": "paragraph",
          "text": "### Payment Breaches Are on the Rise"
        },
        {
          "blockType": "paragraph",
          "text": "Cybercriminals are constantly looking for ways to steal payment data like credit card numbers, billing addresses, and CVV codes. Unfortunately, ecommerce platforms often present a tempting target. Attackers may skim cards through compromised plugins or third-party scripts, use stolen login credentials to access customer accounts through credential stuffing, or intercept transactions during insecure checkout processes through man-in-the-middle attacks."
        },
        {
          "blockType": "paragraph",
          "text": "If your business stores or processes payment data, PCI DSS compliance is more than a box to check—it’s a critical baseline. But being compliant isn’t enough. You also need to actively monitor your systems and have a rapid response plan for anything suspicious."
        },
        {
          "blockType": "paragraph",
          "text": "### Don’t Overlook Insider Threats"
        },
        {
          "blockType": "paragraph",
          "text": "Cybersecurity isn’t just about firewalls or software - it’s about people. Everyone on your team, from customer service agents to warehouse staff, plays a role in fraud prevention. That includes knowing how to spot phishing attempts, recognizing signs of refund scams, and understanding how fraudsters might test stolen credit cards. When your staff is trained and alert, they become one of your strongest defenses. Additionally, it’s important to foster a company culture where employees feel empowered to report anything unusual without fear of retaliation."
        },
        {
          "blockType": "paragraph",
          "text": "### What’s Next in Ecommerce Fraud"
        },
        {
          "blockType": "paragraph",
          "text": "Ecommerce threats are evolving fast. Expect to see more ransomware attacks, fake checkout pages, supplier-targeted email scams, and AI-driven synthetic identities."
        },
        {
          "blockType": "paragraph",
          "text": "Cybersecurity isn’t just an IT issue—it’s a business strategy. With the right tools, training, and mindset, you can protect your store and earn customer trust in an increasingly high-risk environment. Invest in fraud detection tools that can save your business before it gets hit."
        },
        {
          "blockType": "paragraph",
          "text": "Want to dive deeper? Check out our latest podcast episode with cybersecurity expert Tim Graham on True Fraud."
        },
        {
          "blockType": "paragraph",
          "text": "Need help tightening your fraud defenses? Our team is here to support you."
        }
      ]
    },
    "meta": {
      "title": "Ecommerce Fraud & Payment Breaches: What Every Online Business Needs to Know",
      "description": "Cybersecurity is no longer just an IT concern – it’s a business imperative for ecommerce companies. This blog post explores the core principles of ecommerce security, from protecting customer data and maintaining trust to addressing rising threats like payment breaches and insider risks.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/13c9344f-6e66-818e-bdab-d0aaced37d5e/ae30c6f1-2c25-4ed3-bc17-75ce092e6000.jpg"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/ecommerce-fraud-payment-breaches-what-every-online-business-needs-to-know"
  },
  {
    "type": "post",
    "title": "Everything You Need to Know About Chargebacks",
    "slug": "everything-you-need-to-know-about-chargebacks",
    "excerpt": "Learn how to protect your ecommerce business from the challenges of chargebacks. Discover their origins, the impact of friendly fraud, and strategies like the representment process to safeguard your revenue.",
    "publishedAt": "2025-01-15T05:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-818e-801c-e2dbb718ff9c/a3b429aa-94a5-4e73-bf98-54a2b8684a04.webp",
      "alt": "Everything You Need to Know About Chargebacks",
      "filename": "a3b429aa-94a5-4e73-bf98-54a2b8684a04.webp"
    },
    "authors": [],
    "categories": [
      "Fraud",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "heading",
          "level": "h2",
          "text": "What Are Chargebacks?"
        },
        {
          "blockType": "paragraph",
          "text": "Chargebacks originated in the 1960s with the establishment of the credit card industry, primarily designed to protect consumers from fraudulent transactions. They allow consumers to dispute charges and seek refunds when goods or services are not delivered as promised.\nThe ecosystem of chargebacks involves multiple players including the consumer, the issuing bank, the merchant, and the acquiring processor. When a consumer files a chargeback, the issuing bank assesses its validity and processes the claim, often to the detriment of the merchant. Consequently, merchants face significant challenges in managing chargebacks, especially when they represent a large percentage of their transactions."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "The Impact of Friendly Fraud"
        },
        {
          "blockType": "paragraph",
          "text": "As the system evolved, it developed vulnerabilities that led to \"friendly fraud\"—when consumers exploit the chargeback process after receiving their purchased goods or services.\nToday, friendly fraud makes up 60-70% of all chargebacks, severely impacting merchants. Beyond the immediate financial losses, this practice drains valuable time and resources. Merchants must shift their focus from core business operations to fighting these fraudulent disputes."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "The Representment Process - How to challenge chargebacks and protect your business"
        },
        {
          "blockType": "paragraph",
          "text": "It’s important to know when you should fight back against chargeback claims - especially with the rise of friendly fraud. This is known as the representment process, where merchants provide compelling evidence to contest chargebacks."
        },
        {
          "blockType": "paragraph",
          "text": "This process can be slow and cumbersome, often relying on human decision-making, which introduces subjectivity and potential errors."
        },
        {
          "blockType": "paragraph",
          "text": "Often, the costs associated with handling chargebacks can range from $20 to $100 per incident, which can be a significant financial strain on merchants, especially those with lower-priced products."
        },
        {
          "blockType": "paragraph",
          "text": "A common misconception among merchants is that winning a representment will negate the chargeback from their records. However, it’s very important to know that any chargeback that passes through the system counts against the merchant's monthly threshold. To mitigate risk, merchants are encouraged to utilize technology and pre-chargeback alerts that can help prevent chargebacks before they occur."
        },
        {
          "blockType": "conclusion",
          "heading": "Conclusion",
          "text": "While chargebacks serve as a vital consumer protection tool, their unintended consequences can pose serious challenges for merchants. Understanding the chargeback and representment process is crucial for protecting your business from any financial and legal implications.\n\nBy leveraging advanced technologies and proactive strategies, including partnering with the right businesses that understand the complexities of fraud systems, merchants can minimize the risk of disputes, safeguard their revenue, and focus on growing their operations. A balanced approach that combines awareness, preparedness, and innovation will empower businesses to navigate the complexities of chargebacks effectively.\n\nFor more insights and detailed discussions on chargebacks, check out our interview with Vinay Shiriwastaw from ChargebackHelp on True Fraud. Subscribe to the podcast on your favourite platform to stay informed about the latest trends in chargebacks and fraud prevention.\n\nDiscover how our global experts and Merchant of Record model can maximize your international potential today and in the future here."
        }
      ]
    },
    "meta": {
      "title": "Everything You Need to Know About Chargebacks",
      "description": "Learn how to protect your ecommerce business from the challenges of chargebacks. Discover their origins, the impact of friendly fraud, and strategies like the representment process to safeguard your revenue.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-818e-801c-e2dbb718ff9c/a3b429aa-94a5-4e73-bf98-54a2b8684a04.webp"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/everything-you-need-to-know-about-chargebacks"
  },
  {
    "type": "post",
    "title": "How to Prepare Your Ecommerce Store for Peak Sales Seasons",
    "slug": "how-to-prepare-your-ecommerce-store-for-peak-sales-seasons",
    "excerpt": "The world of retail ecommerce has changed significantly in recent years. Black Friday and Boxing Day are now weeks-long shopping events. Learn how your business can stay competitive through adaptation.",
    "publishedAt": "2024-11-13T05:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-8192-ae44-e90d6ab4a95c/7e4738a6-8083-423b-b254-9d2524f12df6.webp",
      "alt": "How to Prepare Your Ecommerce Store for Peak Sales Seasons",
      "filename": "7e4738a6-8083-423b-b254-9d2524f12df6.webp"
    },
    "authors": [],
    "categories": [
      "Localized Customer Experience",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "The world of retail ecommerce has changed significantly in recent years. What used to be limited to single-day sales events like Black Friday or Boxing Day has now expanded into weeks-long shopping events. This shift means customers can enjoy more opportunities to shop, and businesses have more chances to boost their sales. But with this change, both customers and businesses have had to adapt."
        },
        {
          "blockType": "paragraph",
          "text": "Online shopping continues to gain traction during these busy periods. Compared to brick-and-mortar stores, ecommerce platforms offer more flexibility with pricing, promotions, and overall profit margins due to lower overhead costs. The growth of online shopping has also gone global, making it easier for businesses to reach customers around the world."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Tips for Optimizing Your Ecommerce Store"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Offer Multiple Payment Options: Include popular payment methods like Shop Pay, PayPal, credit cards, and buy now, pay later (BNPL) options to cater to different preferences.",
            "Reduce Steps to Purchase: The fewer clicks it takes to complete a purchase, the better. Simplifying this process helps lower cart abandonment rates.",
            "Allow Guest Checkout: Let new customers complete their purchase without creating an account to make first-time shopping quicker and easier.",
            "Use Digital Wallets and Autofill: Integrate tools like Apple Pay that allow customers to autofill their information, speeding up the checkout process."
          ]
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Speed Up Your Website: Slow-loading pages can drive potential buyers away. Ensure your site is fast to keep customers engaged.",
            "Make It Mobile-Friendly: Most shoppers use their phones, so make sure your website looks and works great on all devices.",
            "Provide Clear Product Details: Include well-written descriptions, high-quality images, and customer reviews so shoppers feel confident about their purchase.",
            "Add Live Chat Support: Help customers instantly by answering questions and resolving issues as they shop."
          ]
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Review and Improve After the Sale"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Conversion rates",
            "Average order value",
            "Cart abandonment rate",
            "Popular payment methods used",
            "Geographic sales trends",
            "Site load times",
            "Customer feedback and reviews"
          ]
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Stay Competitive by Adapting"
        },
        {
          "blockType": "paragraph",
          "text": "Learn how our Merchant of Record model can enhance your global checkout and help you convert during peak sales periods here."
        },
        {
          "blockType": "paragraph",
          "text": "Dive into more tips on how to navigate major sales periods in our Business Over Borders podcast episode with Reach’s Head of Sales, Cayleigh Palen, where she shares top tips for making the most of BFCM and holiday shopping."
        }
      ]
    },
    "meta": {
      "title": "How to Prepare Your Ecommerce Store for Peak Sales Seasons",
      "description": "The world of retail ecommerce has changed significantly in recent years. Black Friday and Boxing Day are now weeks-long shopping events. Learn how your business can stay competitive through adaptation.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-8192-ae44-e90d6ab4a95c/7e4738a6-8083-423b-b254-9d2524f12df6.webp"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/how-to-prepare-your-ecommerce-store-for-peak-sales-seasons"
  },
  {
    "type": "post",
    "title": "International Ecommerce on Shopify: Practical Tips for Higher Conversions",
    "slug": "international-ecommerce-on-shopify-practical-tips-for-higher-conversions",
    "excerpt": "Learn how to grow your Shopify store through global ecommerce best practices. Explore how to create fully localized shopping experiences that boost international conversions—from regional storefronts and localized checkout to tax display and local payment methods. Discover how partnering with a Merchant of Record can simplify expansion and help you scale smarter across borders.",
    "publishedAt": "2025-05-30T04:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/2009344f-6e66-80d3-a9b4-cb567b47c5e4/3313e04b-a590-4834-8b9a-e00db01a03e8.jpg",
      "alt": "International Ecommerce on Shopify: Practical Tips for Higher Conversions",
      "filename": "3313e04b-a590-4834-8b9a-e00db01a03e8.jpg"
    },
    "authors": [],
    "categories": [
      "Localized Customer Experience",
      "Shopify",
      "Retail",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "As more Shopify merchants expand into international markets, one thing becomes clear: scaling globally isn’t just about offering worldwide shipping. True success lies in creating seamless, localized experiences that meet the expectations of customers in every market."
        },
        {
          "blockType": "paragraph",
          "text": "To maximize conversions across borders, brands need to move beyond surface-level translation and embrace full-spectrum localization. That means tailoring everything from language and sizing to payment methods and tax display."
        },
        {
          "blockType": "paragraph",
          "text": "## Start with a Local Audience Strategy"
        },
        {
          "blockType": "paragraph",
          "text": "Optimization starts with clarity. Without a deep understanding of your target market, efforts to localize or improve your store risk being misaligned or ineffective."
        },
        {
          "blockType": "paragraph",
          "text": "Language is one of the most visible aspects of localization and a machine-translation service often won’t cut it. Regional slang, tone, and phrasing all impact customer trust and understanding. Savvy brands are increasingly launching region-specific Shopify expansion stores. These local storefronts allow for language and currency customization, culturally appropriate messaging, and tailored promotions that resonate on a local level."
        },
        {
          "blockType": "paragraph",
          "text": "Notable differences don’t stop with language though - even if your customers all speak English, there’s major seasonal differences between the U.S. and Australia. For example, a July summer campaign for your US customers may fall flat in Australia where the Southern Hemisphere is deep in winter. Aligning marketing calendars, promotions, and product displays with regional timing and customer behavior is essential to staying relevant and driving engagement."
        },
        {
          "blockType": "paragraph",
          "text": "## Optimize the Checkout Experience"
        },
        {
          "blockType": "paragraph",
          "text": "Cart abandonment often happens at checkout, making it the highest-impact area for conversion optimization. Three key areas to address are taxes, shipping, and payment methods."
        },
        {
          "blockType": "paragraph",
          "text": "### 1. Display Taxes the Way Customers Expect"
        },
        {
          "blockType": "paragraph",
          "text": "Tax presentation norms vary by region. In the U.S., it’s standard to list prices exclusive of sales tax, which is then added during checkout. In Europe, however, taxes like VAT are expected to be included in the listed price."
        },
        {
          "blockType": "paragraph",
          "text": "Failing to meet local expectations around tax display can lead to confusion, sticker shock, and ultimately, abandoned carts. Shopify makes it easy to toggle between inclusive and exclusive tax displays per region, so make use of this functionality to align with what your audience is accustomed to."
        },
        {
          "blockType": "paragraph",
          "text": "### 2. Get Strategic About Shipping"
        },
        {
          "blockType": "paragraph",
          "text": "Unexpected shipping costs are one of the most common reasons for cart abandonment. Clear communication about shipping costs, timelines, and thresholds for free shipping helps manage expectations and reduce drop-off."
        },
        {
          "blockType": "paragraph",
          "text": "Consider incorporating shipping into your product pricing or offering free shipping incentives when customers hit a certain order value. This encourages larger purchases while improving the perceived value of your offering."
        },
        {
          "blockType": "paragraph",
          "text": "### 3. Offer Localized Payment Options"
        },
        {
          "blockType": "paragraph",
          "text": "Customers have strong preferences when it comes to payment methods, and those preferences vary widely by country. While U.S. shoppers often prefer credit cards and Shop Pay, markets like Germany favor PayPal or Klarna. Ignoring these preferences can create unnecessary friction at the most critical point in the buyer journey."
        },
        {
          "blockType": "paragraph",
          "text": "Shopify supports a broad range of payment methods, but not all are available in every region. Brands looking to offer localized payment methods without creating new legal entities abroad can activate providers like Reach, which simplify access to regional options."
        },
        {
          "blockType": "paragraph",
          "text": "## Final Thoughts"
        },
        {
          "blockType": "paragraph",
          "text": "Global ecommerce success isn’t about reaching more people, it’s about reaching them in the right way. A localized, frictionless experience is what turns browsers into buyers."
        },
        {
          "blockType": "paragraph",
          "text": "With the right combination of Shopify’s built-in features and strategic Merchant of Record like Reach, brands can create checkout experiences that meet local expectations while maximizing global conversions. Whether you're refining tax settings or rolling out region-specific payment options, every optimization helps pave the way for scalable growth."
        },
        {
          "blockType": "paragraph",
          "text": "Ready to take unlock the full potential of your Shopify store? Get in touch to see how you can expand smarter today."
        },
        {
          "blockType": "paragraph",
          "text": "For more insights on optimizing your Shopify store for international markets check out our recent episode of Business Over Borders, where Cayleigh Palen shares actionable strategies for boosting conversions around the globe."
        }
      ]
    },
    "meta": {
      "title": "International Ecommerce on Shopify: Practical Tips for Higher Conversions",
      "description": "Learn how to grow your Shopify store through global ecommerce best practices. Explore how to create fully localized shopping experiences that boost international conversions—from regional storefronts and localized checkout to tax display and local payment methods. Discover how partnering with a Merchant of Record can simplify expansion and help you scale smarter across borders.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/2009344f-6e66-80d3-a9b4-cb567b47c5e4/3313e04b-a590-4834-8b9a-e00db01a03e8.jpg"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/international-ecommerce-on-shopify-practical-tips-for-higher-conversions"
  },
  {
    "type": "post",
    "title": "Navigating the Future: Key Payment Trends and Priorities for 2025",
    "slug": "navigating-the-future-key-payment-trends-and-priorities-for-2025",
    "excerpt": "Explore key payment trends and priorities for 2025, including the surge of digital wallets, AI-enhanced security, personalized loyalty programs, and the rise of digital currencies. Learn how businesses can prepare for the future of payments and stay competitive in an evolving financial landscape.",
    "publishedAt": "2024-11-20T05:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/13c9344f-6e66-81ed-8942-c83331bef0f4/bc650562-2a62-4542-8654-d78a8696ec5e.jpg",
      "alt": "Navigating the Future: Key Payment Trends and Priorities for 2025",
      "filename": "bc650562-2a62-4542-8654-d78a8696ec5e.jpg"
    },
    "authors": [],
    "categories": [
      "Localized Customer Experience",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "heading",
          "level": "h2",
          "text": "Digital Wallets: Transforming Payment Landscapes"
        },
        {
          "blockType": "paragraph",
          "text": "Digital wallets are at the forefront of payment trends, revolutionizing how consumers pay on online global storefronts. Key factors driving the digital wallet boom include:"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Explosive Growth: An estimated 3.1 billion digital buyers are expected by 2025, with mobile e-commerce projected to capture 77% of the market.",
            "Seamless Integration: Digital wallets like PayPal and Apple Pay are becoming essential, offering user-friendly experiences that foster consumer loyalty.",
            "Super App Evolution: As digital wallets can integrate with various platforms and even government-issued IDs, they’re becoming “super apps” for managing daily life."
          ]
        },
        {
          "blockType": "paragraph",
          "text": "This shift towards digital wallets is driven by increasing internet accessibility and the convenience of mobile shopping. As more consumers embrace this trend, it’s important for businesses to address ways to include digital wallet options in their checkouts."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "Artificial Intelligence: Enhancing Security and User Experience"
        },
        {
          "blockType": "paragraph",
          "text": "It would be difficult not to mention Artificial Intelligence (AI) when talking about upcoming changes in the tech world. We’re already seeing developments within the payments space that are increasingly impacting key areas, such as;"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Real-time Analysis: AI algorithms can quickly process large transaction data, providing valuable insights that improve decision-making in payment routing, risk assessment, and approval rate optimization.",
            "Fraud Detection: Advanced AI models will enhance fraud detection and prevention by analyzing real-time data and industry trends. This will boost the quality of payment security and reduce false declines."
          ]
        },
        {
          "blockType": "paragraph",
          "text": "The integration of AI into payment systems will not only improve security measures but also streamline the user experience, making transactions faster and more intuitive for consumers and ecommerce businesses alike."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "Loyalty Programs: The Renaissance of Personalized Rewards"
        },
        {
          "blockType": "paragraph",
          "text": "2025 is expected to usher in a resurgence of loyalty initiatives but with a modern twist. These next-generation loyalty programs will leverage data, analytics, and AI to offer:"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Hyper-personalized Experiences: Tailored rewards based on individual consumer preferences and behaviours.",
            "Real-time Rewards: Instant gratification through immediate point redemption or cashback offers.",
            "Cross-platform Integration: Seamless loyalty experiences across various shopping channels and payment methods."
          ]
        },
        {
          "blockType": "paragraph",
          "text": "With the additional rise of digital wallets, rewards cards will go digital making them more accessible for a larger consumer base. Businesses that develop modern loyalty programs can boost customer retention and drive repeat purchases in a competitive global market."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "Digital Currencies: A New Era of Transactions"
        },
        {
          "blockType": "paragraph",
          "text": "The regulation and acceptance of digital currencies, particularly digital versions of established fiat currencies like the US Dollar and Euro, will mark a significant shift in the payments landscape in the near future. Their introduction will bring about:"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Increased Transaction Speed: Near-instantaneous settlements for both domestic and international payments.",
            "Enhanced Security: Blockchain technology underlying these digital currencies will provide increased security features.",
            "Reduced Costs: Lower transaction fees compared to traditional banking systems, benefiting both merchants and consumers."
          ]
        },
        {
          "blockType": "paragraph",
          "text": "Although there’s a long way to go before digital currencies become a reality, once they gain popularity, businesses should start exploring how to integrate these payment options into their global checkouts to stay ahead of the curve."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "Fraud: Balancing Security and User Experience"
        },
        {
          "blockType": "paragraph",
          "text": "A crucial priority for businesses in 2025 will be maintaining a balance between security measures and frictionless user experiences. This holistic approach will involve:"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Implementing and Improving Multi-factor Authentication: Enhancing security without significantly impacting the user experience.",
            "Adopting Biometric Verification: Utilizing fingerprint or facial recognition for quick and secure transactions.",
            "Ensuring Regulatory Compliance: Staying up-to-date with changing global regulations impacting ecommerce while maintaining user-friendly systems."
          ]
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "Preparing for the Future of Payments"
        },
        {
          "blockType": "paragraph",
          "text": "The payments landscape of 2025 promises exciting opportunities that will reshape global ecommerce. To stay competitive and meet changing consumer expectations, you should consider:"
        },
        {
          "blockType": "list",
          "style": "ordered",
          "items": [
            "Adopt digital wallets into your international checkout to increase conversions and reduce consumer friction.",
            "Invest in AI and machine learning capabilities to improve fraud detection and personalize user experiences.",
            "Develop innovative loyalty programs that leverage data analytics for personalized rewards.",
            "Explore the integration of digital currencies into existing payment systems as they become available.",
            "Prioritize a balanced approach to security and user experience."
          ]
        },
        {
          "blockType": "paragraph",
          "text": "By focusing on these key trends in your 2025 playbook, your business can position itself to stay ahead of the curve and capitalize next year and beyond."
        },
        {
          "blockType": "paragraph",
          "text": "Learn more about the future of global payments in 2025 and beyond on our podcast, Business Over Borders, here."
        },
        {
          "blockType": "paragraph",
          "text": "Discover how our global experts and Merchant of Record model can maximize your international potential today and in the future here."
        }
      ]
    },
    "meta": {
      "title": "Navigating the Future: Key Payment Trends and Priorities for 2025",
      "description": "Explore key payment trends and priorities for 2025, including the surge of digital wallets, AI-enhanced security, personalized loyalty programs, and the rise of digital currencies. Learn how businesses can prepare for the future of payments and stay competitive in an evolving financial landscape.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/13c9344f-6e66-81ed-8942-c83331bef0f4/bc650562-2a62-4542-8654-d78a8696ec5e.jpg"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/navigating-the-future-key-payment-trends-and-priorities-for-2025"
  },
  {
    "type": "post",
    "title": "Navigating the Growing Maze of Global Tax Compliance",
    "slug": "navigating-the-growing-maze-of-global-tax-compliance",
    "excerpt": "Navigating the complexities of global tax compliance for online businesses? This blog breaks down the growing importance of international sales tax, the differences between taxing digital and physical goods, and offers practical solutions like partnering with a Merchant of Record to simplify the process and confidently expand your global reach.",
    "publishedAt": "2025-04-16T04:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/13c9344f-6e66-81da-87db-c301acdea487/e9a87c38-2e6a-401e-91f7-284fd99e1afe.jpg",
      "alt": "Navigating the Growing Maze of Global Tax Compliance",
      "filename": "e9a87c38-2e6a-401e-91f7-284fd99e1afe.jpg"
    },
    "authors": [],
    "categories": [
      "Tax",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "The world of online commerce has exploded, connecting businesses with customers across borders like never before. While this presents incredible opportunities for growth, it also brings a significant and complex challenge: global tax compliance. It's a topic that's becoming increasingly important for anyone selling across borders, but we can break it down and make it easier to understand."
        },
        {
          "blockType": "paragraph",
          "text": "### Why the Growing Focus on Global Tax?"
        },
        {
          "blockType": "paragraph",
          "text": "It’s been a short time since global tax compliance became such a big topic. In fact, only a few years back, in 2015, about 33 countries had rules about taxing digital services sold from other countries. Fast forward to today, and that number has jumped to a significant 90. And if you consider the United States, with its different tax rules in each of its nearly 50 states, the world of international tax has become a much more intricate landscape for businesses like yours."
        },
        {
          "blockType": "paragraph",
          "text": "### What Prompted This Change? The Rise of the Digital Economy"
        },
        {
          "blockType": "paragraph",
          "text": "The shift really started in 2015, with the European Union leading the way. They introduced rules requiring sellers outside the EU to handle taxes on digital services sold to EU consumers. This move set a precedent, and as more and more countries saw the growth of online commerce – especially during the pandemic – they realized the importance of collecting their share of revenue from these international sales."
        },
        {
          "blockType": "paragraph",
          "text": "### Understanding the Difference: Digital vs. Physical Goods"
        },
        {
          "blockType": "paragraph",
          "text": "When we talk about taxes, it's helpful to understand that digital services (like subscriptions or streaming) and physical goods (like that cozy sweater you're shipping) are often treated differently. For digital services, the rule is usually pretty straightforward: they're taxed in the country where the customer is located. Plus, many countries require you to register for tax from your very first digital sale."
        },
        {
          "blockType": "paragraph",
          "text": "Physical goods, however, have a slightly different set of rules. Currently, fewer countries (around 40) require international sellers to collect taxes on physical items at the time of purchase compared to digital services. Additionally, while digital services often have a standard tax rate, the tax rate for physical goods can vary depending on the product and the country."
        },
        {
          "blockType": "paragraph",
          "text": "Another important concept for physical goods is the \"low-value goods threshold.\" Some countries only require you to collect taxes if the item you're selling is below a certain price. For example, in Australia, this threshold is around $1000. If your item is cheaper, you collect the tax. If it's more expensive, the customer might pay taxes and duties when it arrives."
        },
        {
          "blockType": "paragraph",
          "text": "### Navigating the Complexities of International Sales Tax"
        },
        {
          "blockType": "paragraph",
          "text": "If you're selling to customers in multiple countries, the idea of figuring out the right tax, collecting it, and then sending it to the correct government can feel overwhelming. Each country has its own rules and regulations, and keeping track of it all can be a real challenge."
        },
        {
          "blockType": "paragraph",
          "text": "On top of that, some countries have \"registration thresholds\" for physical goods. This means that if your sales in that country are below a certain amount per year, you might not even need to collect taxes there. But if you exceed that threshold, you'll need to register and start collecting. The registration process itself can be time-consuming and involve a fair amount of paperwork, especially in countries where English isn't the primary language. And then, of course, you'll need to file tax returns regularly."
        },
        {
          "blockType": "paragraph",
          "text": "### Finding the Right Path: Managing Global Tax Compliance"
        },
        {
          "blockType": "paragraph",
          "text": "So, how do you handle all of this? One option is to hire an in-house tax expert or a team to manage your global tax obligations. They would be responsible for understanding the rules, ensuring you're registered correctly, and handling tax filings. However, this can be a significant investment, potentially costing hundreds of thousands of dollars annually. Plus, staying on top of ever-changing tax laws requires continuous effort and expertise."
        },
        {
          "blockType": "paragraph",
          "text": "### A Helpful Alternative: Merchant of Record"
        },
        {
          "blockType": "paragraph",
          "text": "A more popular solution is to partner with a Merchant of Record (MOR). Think of an MOR as a partner that handles the sales transaction on your behalf. They not only provide your customers with various payment options but also help with calculating, collecting, and remitting taxes."
        },
        {
          "blockType": "paragraph",
          "text": "### Looking Ahead: What the Future Holds for Global Tax"
        },
        {
          "blockType": "paragraph",
          "text": "The trend towards greater global tax compliance is likely to continue. With most countries having some form of sales tax, and a growing awareness of the revenue generated through online sales, more nations are expected to implement or expand their rules for international sellers."
        },
        {
          "blockType": "paragraph",
          "text": "Governments are also focused on creating a level playing field for both local and international businesses. Without these regulations, sellers based outside a country could have an unfair price advantage over local businesses that are required to collect and remit taxes."
        },
        {
          "blockType": "paragraph",
          "text": "Additionally, we're seeing the emergence of Digital Service Taxes (DSTs), which target the revenue of large digital companies. While these currently affect mostly larger businesses, they indicate a growing focus on taxing the digital economy."
        },
        {
          "blockType": "paragraph",
          "text": "### Final Thoughts: Making Global Taxes Manageable"
        },
        {
          "blockType": "paragraph",
          "text": "Navigating global taxes might seem complex, but it's a crucial part of doing business internationally. Understanding the rules and exploring solutions like a Merchant of Record can help you manage these obligations effectively, allowing you to confidently expand your reach and connect with customers worldwide without the overwhelming burden of tax complexities."
        },
        {
          "blockType": "paragraph",
          "text": "Learn more with our tax eBooks."
        },
        {
          "blockType": "paragraph",
          "text": "Looking for help with your businesses’ taxes? Reach out to see how we can help."
        }
      ]
    },
    "meta": {
      "title": "Navigating the Growing Maze of Global Tax Compliance",
      "description": "Navigating the complexities of global tax compliance for online businesses? This blog breaks down the growing importance of international sales tax, the differences between taxing digital and physical goods, and offers practical solutions like partnering with a Merchant of Record to simplify the process and confidently expand your global reach.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/13c9344f-6e66-81da-87db-c301acdea487/e9a87c38-2e6a-401e-91f7-284fd99e1afe.jpg"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/navigating-the-growing-maze-of-global-tax-compliance"
  },
  {
    "type": "post",
    "title": "New US Tariffs: What You Need to Know and How to Prepare",
    "slug": "new-us-tariffs-what-you-need-to-know-and-how-to-prepare",
    "excerpt": "In this blog, we explain President Trump’s contemplated tariffs against China, Mexico, and Canada, and provide tips and strategies for how to mitigate their impacts on your business.",
    "publishedAt": "2025-02-04T05:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-81d6-b8f7-ea56e331550c/7967eaac-7268-4bdc-b894-79a331dca083.jpg",
      "alt": "New US Tariffs: What You Need to Know and How to Prepare",
      "filename": "7967eaac-7268-4bdc-b894-79a331dca083.jpg"
    },
    "authors": [],
    "categories": [
      "Tarrifs",
      "Compliance",
      "United States",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "Despite these delays, it is highly likely that certain aspects of the proposed tariffs will be enacted in the near future. Therefore, it is crucial for global retailers targeting the U.S. market to understand the potential implications and consider proactive strategies."
        },
        {
          "blockType": "paragraph",
          "text": "Who will be affected by the proposed tariffs?"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Direct Imports from China: Retailers that ship their products directly from China will face an additional 10% tariff on these imports.",
            "Indirect Imports with Chinese Origin: Retailers shipping items into the U.S. from locations outside China, where the country of origin is China, will also be subject to the additional 10% tariff.",
            "Direct Imports from Canada: Retailers that ship their products directly from Canada will face a 25% tariff on these imports.",
            "Indirect Imports with Canada Origin: Retailers shipping items into the U.S. from locations outside Canada, where the country of origin is Canada, will also be subject to a 25% tariff.",
            "Direct Imports from Mexico: Retailers that ship their products directly from Mexico will face a 25% tariff on these imports.",
            "Indirect Imports with Mexico Origin: Retailers shipping items into the U.S. from locations outside Mexico, where the country of origin is Mexico, will also be subject to a 25% tariff."
          ]
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "You will no longer benefit from the de minimis provision, which allows tariff-free entry of packages valued under $800.",
            "Your products will be subject to the new duty rates, which will be held at customs until the amount is paid by the customer if the product is shipped DDU - delivery duties unpaid.",
            "The US customs agent and carriers do not have the structure to handle these new regulations. If enacted, there will be severe delays and holding of shipments.",
            "Most US customers do not understand duties, so any delay or surprise additional fees due at the border will lead to an increase in chargebacks."
          ]
        },
        {
          "blockType": "paragraph",
          "text": "Consider an Australian-based retailer shipping from an AU warehouse with Chinese-made silk dresses. Previously, an order worth $200 would have been under the $800 de minimis threshold, exempting it from duties. With the new tariffs, however, this same order would now be subject to 16.9% duty (6.9% standard duty + 10% new tariff). If shipped DDU, US customs would hold the order until the $33.80 duty is collected from the customer, who will likely be unaware of this additional cost. The process would add further fees and frustrations, potentially leading to customer dissatisfaction."
        },
        {
          "blockType": "paragraph",
          "text": "Steps to take now"
        },
        {
          "blockType": "paragraph",
          "text": "If you’re affected by these changes, here are some steps to take:"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Post notifications on your website and social media, and consider sending email alerts to explain the tariff changes and potential shipping delays. Transparency will help maintain customer trust and reduce chargebacks."
          ]
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Ensure your customers are informed about the tariffs, especially regarding potential delays and extra duties. This proactive communication can help prevent negative reviews."
          ]
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Consider increasing U.S. pricing to cover the new duties and switch to DDP (Delivery Duty Paid) shipping to mitigate the impact on your customers. You may also want to reassess your supply chain, exploring alternative sourcing options or using a 3PL in the U.S."
          ]
        },
        {
          "blockType": "paragraph",
          "text": "Reach is here to help"
        },
        {
          "blockType": "paragraph",
          "text": "We’re committed to supporting our global clients through this challenging time. Our team is actively monitoring developments, and we are always available to offer guidance. For any questions or to schedule a consultation, please contact us."
        }
      ]
    },
    "meta": {
      "title": "New US Tariffs: What You Need to Know and How to Prepare",
      "description": "In this blog, we explain President Trump’s contemplated tariffs against China, Mexico, and Canada, and provide tips and strategies for how to mitigate their impacts on your business.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-81d6-b8f7-ea56e331550c/7967eaac-7268-4bdc-b894-79a331dca083.jpg"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/new-us-tariffs-what-you-need-to-know-and-how-to-prepare"
  },
  {
    "type": "post",
    "title": "Optimizing Global Payments: Data-Driven Strategies for Higher Authorization Rates",
    "slug": "optimizing-global-payments-data-driven-strategies-for-higher-authorization-rates",
    "excerpt": "Global payments seem simple, but hidden complexities can hinder success. Learn how to navigate international banking, optimize transactions, and boost authorization rates.",
    "publishedAt": "2025-02-19T05:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/13c9344f-6e66-81ab-a577-da5ce56be9cc/423a8578-f74e-490b-b5be-f41f0a74b601.jpg",
      "alt": "Optimizing Global Payments: Data-Driven Strategies for Higher Authorization Rates",
      "filename": "423a8578-f74e-490b-b5be-f41f0a74b601.jpg"
    },
    "authors": [],
    "categories": [
      "Authorization Rates",
      "Data",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "In the global age of the internet, it can seem easy to sell to customers all around the world. However, as those who have started this journey know, it can be difficult to navigate the complexities and nuances of cross-border transactions with currencies and tax regulations outside your businesses’ home location."
        },
        {
          "blockType": "paragraph",
          "text": "In the fast-paced world of global payments, understanding the complexities of banks and international transactions is vital for maintaining customer satisfaction. Optimizing payment processes across borders requires leveraging data-driven insights and building effective banking relationships."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "The Challenge of Global Payments"
        },
        {
          "blockType": "paragraph",
          "text": "As businesses expand their reach internationally, they face unique challenges in managing payments. Confusion often arises around how transactions flow from consumer to merchant, especially when multiple banks are involved. The transaction process is more intricate than it appears; when a consumer swipes their credit card, the acquiring bank of the merchant communicates with the issuing bank of the consumer. This journey involves numerous intermediaries, and understanding this flow is essential for improving authorization rates—the percentage of transactions that are approved."
        },
        {
          "blockType": "paragraph",
          "text": "When a consumer swipes their credit card, the acquiring bank of the merchant communicates with the issuing bank of the consumer. When it’s within one country, most of these banks have pre-existing relationships, making the inter-bank communication much easier. However, when money is travelling cross-border, this journey involves numerous intermediaries. Understanding this flow and knowing how banks communicate is essential for improving authorization rates."
        },
        {
          "blockType": "paragraph",
          "text": "Authorization rates are critical to the success of payment transactions. When a transaction is declined, it could be due to various reasons, such as fraud detection systems or mismatches between the banks involved. The goal is to ensure that transactions are approved as often as possible, which not only enhances customer experience but also benefits retailers by capturing more sales."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "Leveraging Data for Better Outcomes"
        },
        {
          "blockType": "paragraph",
          "text": "One surprising aspect of global payments is that not all banks coexist harmoniously. Even if two banks are located in the same region, they may not work well together, potentially leading to declined transactions. By understanding these relationships, businesses can strategically avoid pairing incompatible banks, thus minimizing transaction failures.\nAt the heart of successful global payment strategies is a robust data-driven approach. By collecting and analyzing authorization rates across different banking paths and payment methods, companies can make informed decisions about which banks to pair for optimal transaction success. This method allows them to navigate the complexities of international banking relationships and ensure smoother transaction processes for their clients."
        },
        {
          "blockType": "conclusion",
          "heading": "Conclusion",
          "text": "The beauty of this approach lies in its ability to abstract the complexity of payment processes from the end user. Consumers can shop confidently, knowing that the payment platform is working behind the scenes to facilitate smooth transactions. Retailers benefit from higher authorization rates without needing to understand the intricacies of international banking.\n\nAs the landscape of global payments evolves, leveraging data and fostering strong relationships between banks are key to enhancing payment success across borders. Businesses that invest in these strategies can ensure a smoother and more reliable transaction process, driving better outcomes for consumers and retailers alike.\n\nWant to partner with someone who already knows these intricacies from decades navigating the global ecommerce environment? We can help. Reach out to learn how you can best optimize your global transaction flows."
        }
      ]
    },
    "meta": {
      "title": "Optimizing Global Payments: Data-Driven Strategies for Higher Authorization Rates",
      "description": "Global payments seem simple, but hidden complexities can hinder success. Learn how to navigate international banking, optimize transactions, and boost authorization rates.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/13c9344f-6e66-81ab-a577-da5ce56be9cc/423a8578-f74e-490b-b5be-f41f0a74b601.jpg"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/optimizing-global-payments-data-driven-strategies-for-higher-authorization-rates"
  },
  {
    "type": "post",
    "title": "Optimizing Your SaaS Checkout for Global Markets",
    "slug": "optimizing-your-saas-checkout-for-global-markets",
    "excerpt": "Optimize SaaS subscription revenue by mastering the initial transaction. Learn how to minimize checkout friction, maximize authorization rates, and navigate cross-border challenges with strategies like using a Merchant of Record. Discover insights to impr",
    "publishedAt": "2025-04-01T04:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-818b-9fc4-c7460c031bea/e991e4ef-595a-41b8-8e5f-d44d6b6b817c.jpg",
      "alt": "Optimizing Your SaaS Checkout for Global Markets",
      "filename": "e991e4ef-595a-41b8-8e5f-d44d6b6b817c.jpg"
    },
    "authors": [],
    "categories": [
      "Recurring Payments",
      "Authorization Rates",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "In the ever-evolving landscape of software-as-a-service (SaaS), businesses are increasingly adopting subscription models to enhance revenue streams. This shift raises a crucial question: Why charge customers once for your software when you can generate recurring revenue every month? However, transitioning to this model isn't as simple as clicking a button; it requires careful consideration of various factors to ensure success."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "The Importance of the Initial Transaction"
        },
        {
          "blockType": "paragraph",
          "text": "The customer-initiated transaction (CIT), which is the first transaction in the subscription cycle, is the lifeblood of subscription-based businesses. This first transaction is critical for ensuring that subsequent recurring transactions are successful. The key to optimizing this process lies in minimizing friction during checkout, which can be achieved by reducing the amount of information customers need to provide.\nFor digital goods, a streamlined checkout process is essential. Businesses should focus on collecting necessary data, such as the customer's billing address and credit card information, while avoiding overwhelming them with requests for excessive details. This balance is vital—too little information can lead to authorization declines, while too much can deter potential subscribers from completing their transactions."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "Maximizing Authorization Rates"
        },
        {
          "blockType": "paragraph",
          "text": "Authorization rates can significantly impact a business's bottom line, especially for subscription services. In the U.S., many digital businesses see authorization rates drop to 50-60% for cross-border transactions compared to 80-90% in domestic markets. This discrepancy is often attributed to the differences in how banks handle international transactions, as they may flag them as high risk, leading to declines.\nBusinesses must be proactive in addressing these challenges. For instance, providing full billing information rather than just ZIP codes can help improve authorization rates. The goal is to ensure that banks clearly understand the nature of the transaction, thus reducing the likelihood of declines due to perceived fraud."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "Navigating Cross-Border Challenges"
        },
        {
          "blockType": "paragraph",
          "text": "Expanding into international markets introduces additional complexities. Companies may find that while U.S. customers present a lucrative opportunity, the costs associated with advertising and acquiring these customers can skyrocket if authorization rates are low. This is particularly true for software companies based outside the U.S. trying to sell to American consumers.\nOne effective strategy to mitigate these challenges is to consider using a merchant of record. This approach allows businesses to leverage a third-party distributor to handle transactions in the U.S. market, thus avoiding the need to establish a physical entity in the country. This not only simplifies compliance with local regulations but also helps optimize authorization rates."
        },
        {
          "blockType": "conclusion",
          "heading": "Conclusion",
          "text": "As the subscription model continues to gain traction, understanding how to optimize the checkout process for global markets becomes increasingly important. By focusing on minimizing friction in initial transactions, maximizing authorization rates, and exploring alternative routes such as using a Merchant of Record for entering new markets, businesses can set themselves up for success in the competitive SaaS landscape.\n\nFor more insights into navigating the complexities of global commerce when it comes to your SaaS business, check out our recent episode of Business Over Borders, where Matthew Steinbrecher shares his experiences and strategies for thriving in international markets.\n\nReady to increase your authorization rates in global markets? Learn how Reach can help."
        }
      ]
    },
    "meta": {
      "title": "Optimizing Your SaaS Checkout for Global Markets",
      "description": "Optimize SaaS subscription revenue by mastering the initial transaction. Learn how to minimize checkout friction, maximize authorization rates, and navigate cross-border challenges with strategies like using a Merchant of Record. Discover insights to impr",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-818b-9fc4-c7460c031bea/e991e4ef-595a-41b8-8e5f-d44d6b6b817c.jpg"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/optimizing-your-saas-checkout-for-global-markets"
  },
  {
    "type": "post",
    "title": "Product Market Fit: Evolving Your Business in a Changing World",
    "slug": "product-market-fit-evolving-your-business-in-a-changing-world",
    "excerpt": "Discover how to achieve and maintain product market fit in an ever-changing world. Learn strategies for adapting to evolving customer needs, tackling integration challenges, addressing global tax complexities, and knowing when to pivot.",
    "publishedAt": "2025-01-09T05:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-811b-9573-c3a136d4538a/5c4eec53-c445-43e9-b180-568176e75a9b.webp",
      "alt": "Product Market Fit: Evolving Your Business in a Changing World",
      "filename": "5c4eec53-c445-43e9-b180-568176e75a9b.webp"
    },
    "authors": [],
    "categories": [
      "Integration",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "Product market fit is essential for any company's success, but it’s not a one-time achievement. Instead, it represents a continuous process where businesses must adapt to changing customer needs, competitive landscapes, and market conditions to remain relevant and successful."
        },
        {
          "blockType": "paragraph",
          "text": "While Reach's fundamental goal of helping companies sell globally has remained constant over the past decade, how we achieve this has transformed significantly. Initially, we aimed to simplify the complexities of currency conversion and local processing. Today, while the core mission remains the same, the methods have been refined to address evolving customer needs and market dynamics, such as global tax compliance."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Evolution of Integration: Adapting to Market Needs"
        },
        {
          "blockType": "paragraph",
          "text": "In our first iteration, Reach's solution required custom API integrations, which involved tailoring software interfaces to connect seamlessly with clients' systems. This approach often demanded significant technical resources and collaboration between teams. This approach was effective for larger retailers with bespoke platforms, but as the market evolved, these integrations became a barrier to adoption. Recognizing this, we pivoted to develop an embedded solution that eliminated the need for extensive technical integration, making their services more accessible and scalable.\nThe transition to an embedded solution highlights a broader lesson:"
        },
        {
          "blockType": "paragraph",
          "text": "By removing integration challenges, we not only improved customer adoption rates but also expanded its appeal to a broader market."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Expanding Core Functionality"
        },
        {
          "blockType": "paragraph",
          "text": "Global tax regulations underwent significant changes in 2020-2021, creating new challenges for retailers shipping products internationally. In response, we evolved our tax solution from a secondary feature to a primary offering. By addressing this growing pain point, Reach positioned itself as a critical partner for businesses navigating complex tax environments."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Measuring Product Market Fit"
        },
        {
          "blockType": "paragraph",
          "text": "Continually assessing product market fit through various metrics offers valuable insights into a product's performance and relevance:"
        },
        {
          "blockType": "paragraph",
          "text": "Initial adoption and usage tracking helps determine whether new customers are finding value in the product and can highlight areas for improvement. Tracking how quickly and effectively users integrate a product into their workflows offers early indications of alignment with market needs."
        },
        {
          "blockType": "paragraph",
          "text": "Client referrals serve as a reflection of customer satisfaction and trust. A high referral rate indicates that customers not only find value in the product but also feel confident enough to recommend it to others, signaling strong product market fit."
        },
        {
          "blockType": "paragraph",
          "text": "Predictable growth demonstrates consistent alignment between the product and market needs. When a business experiences steady and sustainable growth, it signifies that the product addresses persistent customer pain points effectively."
        },
        {
          "blockType": "paragraph",
          "text": "provides a clear measure of long-term profitability. An advantageous CAC-to-LTV ratio shows that the product is not only attracting customers but also retaining them, ensuring enduring success."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Recognizing When to Pivot"
        },
        {
          "blockType": "paragraph",
          "text": "Recognizing when a product is no longer meeting market needs can be challenging. Businesses may struggle with changing course, especially when they have experienced prior success. The difficulty lies in evaluating whether to stay the course or pivot based on new market realities. Businesses can maintain product market fit by staying attuned to global regulations and market trends, monitoring competitor actions and industry developments, continuously gathering and acting on customer feedback, and looking beyond internal metrics to understand the broader market context."
        },
        {
          "blockType": "conclusion",
          "heading": "Conclusion",
          "text": "Achieving and maintaining product market fit is an ongoing process that requires vigilance, adaptability, and a willingness to evolve. By staying closely attuned to market needs and being prepared to make significant changes when necessary, businesses can ensure they remain relevant and continue to grow in an ever-changing global marketplace."
        }
      ]
    },
    "meta": {
      "title": "Product Market Fit: Evolving Your Business in a Changing World",
      "description": "Discover how to achieve and maintain product market fit in an ever-changing world. Learn strategies for adapting to evolving customer needs, tackling integration challenges, addressing global tax complexities, and knowing when to pivot.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-811b-9573-c3a136d4538a/5c4eec53-c445-43e9-b180-568176e75a9b.webp"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/product-market-fit-evolving-your-business-in-a-changing-world"
  },
  {
    "type": "post",
    "title": "Protecting Your Business from Friendly Fraud ",
    "slug": "protecting-your-business-from-friendly-fraud",
    "excerpt": "Learn about Friendly fraud and its impacts on global ecommerce, and discover how our Merchant of Record model can help protect you from evolving fraud patterns.\r\n",
    "publishedAt": "2023-05-18T04:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1769344f-6e66-8149-a76a-d775c74bcf91/2fb9789a-ef21-47be-ac96-5ebd2d97dd41.webp",
      "alt": "Protecting Your Business from Friendly Fraud ",
      "filename": "2fb9789a-ef21-47be-ac96-5ebd2d97dd41.webp"
    },
    "authors": [],
    "categories": [
      "Fraud",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "As more businesses expand their digital offerings and grow into new global markets, cross-border ecommerce also rapidly evolves. However, with this growth comes increased potential for cyber crime as fraudsters look to take advantage of unsuspecting or unprepared businesses. To complicate this matter, the types of fraud vary as widely as the growth opportunities available in the global marketplace."
        },
        {
          "blockType": "paragraph",
          "text": "One form of fraud that has become prevalent is \"friendly fraud,\" and it's quickly becoming one of the most significant challenges for ecommerce brands worldwide. Friendly fraud is a leading factor in the increase of fraudulent chargebacks filed globally, and they ultimately result in lost revenue for countless ecommerce businesses. In fact, recent data has shown that approximately 40% of online merchants worldwide have experienced chargebacks related to friendly fraud."
        },
        {
          "blockType": "paragraph",
          "text": "But what is friendly fraud, and how can you identify and prevent it? Let's take a deep dive into this widespread form of payments fraud and explore how your cross-border business can prepare for it."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "What is Friendly Fraud?"
        },
        {
          "blockType": "paragraph",
          "text": "“Friendly” or first-party fraud occurs when a cardholder reports a transaction as fraudulent even though it was a valid purchase. Once this happens, the cardholder initiates a chargeback, and the seller loses the revenue from the transaction."
        },
        {
          "blockType": "paragraph",
          "text": "This form of fraud is termed “friendly” because not all instances occur with nefarious intentions behind them. Some examples of potential friendly fraud causes include:"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "The buyer may have forgotten about the purchase, or the buyer did not read or misunderstood the merchant's full descriptor and thought they did not make the purchase.",
            "A family member may have used a card without the cardholder's permission, or the cardholder had forgotten that they had given permission and were unaware of the purchase."
          ]
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "The buyer had buyer's remorse and did not want to go through a return process, or they wanted to bypass a store policy (such as policies for lost/stolen goods, delayed delivery, store credit, workmanship, custom fees, or wrong product selected)."
          ]
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "The buyer believes they have been scammed or purchased a product from a false company."
          ]
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "The buyer reported a subscription or recurring shipment as fraudulent to bypass the cancellation process, or they may have found the process too difficult to unsubscribe."
          ]
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "The buyer commits intentional consumer fraud by reporting the purchase as illegitimate as soon as the product is on the way, has been received, or used."
          ]
        },
        {
          "blockType": "paragraph",
          "text": "As you can see, friendly fraud isn't exactly black and white, nor undertaken with malicious intent. Some cases are opened innocently and caused due to a buyer's misunderstanding or mistake. This is where this variant of fraud earns its \"friendly\" moniker. However, while some examples aren't nefarious in nature, others most certainly are."
        },
        {
          "blockType": "paragraph",
          "text": "In these cases, the consumer actively initiates a chargeback under false pretenses, and they're anything but friendly. These situations happen when a buyer believes it is easier to report a transaction as fraudulent rather than go through the proper channels for consumer disputes. Or, the buyer may feel justified in their actions believing the charge should be reversed due to unfair or inconvenient circumstances. Some cases are purely fraudulent, as the buyer intends to receive goods and services without paying for them."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "Identifying Friendly Fraud Vs. Regular Fraud"
        },
        {
          "blockType": "paragraph",
          "text": "One important indication that a chargeback may not be regular fraud is that with friendly fraud, the user has supplied the correct cardholder information. This means the cardholder's name, card security info, address, and email address all match the buyer."
        },
        {
          "blockType": "paragraph",
          "text": "In the case of regular criminal fraud, the cardholder's name, delivery address, and device location may be completely mismatched or have other suspicious activity and trends that would be flagged through fraud-based analytics. Friendly fraud transactions may elude fraud controls as all the billing and shipping information matches, and there are no trends that would indicate the purchase is fraudulent. However, even if all the cardholder information matches, it may still be a fraudulent transaction if the cardholder's personal information is compromised."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "Preventative Measures"
        },
        {
          "blockType": "paragraph",
          "text": "The best way to protect your global business against any chargeback is by implementing preventative measures. These items can also be used as evidence to help dispute these types of chargebacks should they occur."
        },
        {
          "blockType": "paragraph",
          "text": "Some recommended preventative measures include:"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Clearly outlining shipping information and details that include the shipped to address and define terms and conditions of your returns policy."
          ]
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Enabling notifications and communications that are automatically generated when a purchase is made and for shipping/ delivery updates."
          ]
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Ensure that any communications from the buyer include their name, email address or phone number, and date."
          ]
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Refund transactions that are clear cases of fraud before a chargeback is started because once a chargeback is opened, a chargeback fee is applied regardless."
          ]
        },
        {
          "blockType": "paragraph",
          "text": "If a chargeback is filed against you, reach out to the customer to see if they recognize the transaction and if there were any issues with the order. If they don't respond to the recorded notice, you can use this communication as evidence to show a further attempt was made to rectify possible issues. If the buyer replies, they now recognize their transaction, and you can request that they withdraw the chargeback. If it is withdrawn, the chargeback fee will still be applicable, but the loss of revenue from the disputed products will be prevented. The entire communication can also be submitted as evidence that the buyer is aware of and authorized the purchase."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "How Reach Can Help with Chargebacks and Friendly Fraud"
        },
        {
          "blockType": "paragraph",
          "text": "While no set of fraud controls can entirely eliminate chargebacks or change their outcome, our fully managed fraud solution can help identify chargeback trends before they become a problem. As a Merchant of Record, we must maintain an extremely low fraud threshold. As such, we assure you that any fraud that may occur will be minimal as we’re fully invested in keeping it below this threshold. And that’s truly the best protection you can have."
        },
        {
          "blockType": "paragraph",
          "text": "Our team also has extensive experience monitoring transaction trends throughout different markets and payment processors. We review data used during a transaction, historical data regarding previous disputes, and the overall online presence of the buyer to identify potential fraud before it makes an impact. We are always on top of evolving payments fraud and will notify you of any pattern or group causing spikes in chargebacks or a decrease in authorization rates. Best of all, our solution works with your existing in-house fraud controls to enhance them instead of replacing them. Our robust fraud engine works in tandem with yours to analyze a broader spectrum of data to build specific controls based on the combination of that data's findings."
        },
        {
          "blockType": "paragraph",
          "text": "Along with fraud monitoring, we also suggest the types of controls you can deploy and the criteria your internal teams should be looking at to flag future fraudulent activity."
        },
        {
          "blockType": "paragraph",
          "text": "So if you're looking to grow friendly conversions instead of fraud, connect with the fully managed fraud solution designed to make that happen. Integrate today and spend less time focusing on fraud and more time focusing on the growth of your global business."
        }
      ]
    },
    "meta": {
      "title": "Protecting Your Business from Friendly Fraud ",
      "description": "Learn about Friendly fraud and its impacts on global ecommerce, and discover how our Merchant of Record model can help protect you from evolving fraud patterns.\r\n",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1769344f-6e66-8149-a76a-d775c74bcf91/2fb9789a-ef21-47be-ac96-5ebd2d97dd41.webp"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/protecting-your-business-from-friendly-fraud"
  },
  {
    "type": "post",
    "title": "Selling to EU Customers? Here's How to Navigate VAT and Customs",
    "slug": "selling-to-eu-customers-heres-how-to-navigate-vat-and-customs",
    "excerpt": "Navigating EU VAT and customs for your online retail business can be complex. Learn about shipping options (DDU, DDP, IOSS) and how to simplify EU expansion with Reach.",
    "publishedAt": "2025-04-10T04:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-8159-bde5-f0edaf7e8823/f6444c12-47af-4171-8eef-0c4ecdb944b5.jpg",
      "alt": "Selling to EU Customers? Here's How to Navigate VAT and Customs",
      "filename": "f6444c12-47af-4171-8eef-0c4ecdb944b5.jpg"
    },
    "authors": [],
    "categories": [
      "Tax",
      "Compliance",
      "United Kingdom",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "Expanding your online retail business into the European Union (EU) market can open doors to new opportunities. However, navigating VAT and customs requirements when shipping internationally can be challenging."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "Option 1: Shipping DDU (Delivered Duties Unpaid)"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Negative Customer Experiences: Customers receive unexpected charges upon delivery, potentially leading to dissatisfaction.",
            "Higher Return Rates: Refusals to accept packages due to additional costs increase returns and shipping expenses.",
            "Delays at Customs: Shipments can be held at customs, resulting in delivery delays and negative reviews."
          ]
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "Option 2: Shipping DDP (Delivered Duties Paid)"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Higher Shipping Fees: Shipping providers typically charge higher fees for handling DDP shipments due to the additional administrative tasks involved.",
            "Complex Pricing Models: Predicting precise duties, taxes, and associated shipping fees upfront can be challenging, complicating pricing strategies.",
            "Administrative Burden: Each shipment involves detailed paperwork and compliance tasks, increasing operational complexity."
          ]
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "Option 3: Using the Import One Stop Shop (IOSS)"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Transparent Pricing: Customers see the full cost upfront, enhancing satisfaction.",
            "Faster Customs Clearance: Reduced risk of shipment delays and additional charges upon delivery."
          ]
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Registration and Intermediary Requirement: Non-EU retailers must appoint an EU-based intermediary for registration and VAT management.",
            "Monthly VAT Reporting: Detailed monthly VAT filings are required, along with currency conversion management and adherence to varying VAT rates across the EU.",
            "Complex Record-Keeping: Retailers must meticulously track and report every sale, creating additional workload for accounting teams."
          ]
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "Simplify EU Sales with Reach"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Comprehensive VAT Management: Reach handles VAT registration, collection, filings, and reporting.",
            "Seamless Customer Experience: Transparent pricing and hassle-free deliveries build customer trust.",
            "Cost-Effective Integration: No complex technical integrations required; you can retain your current setup and leave the complexities to us."
          ]
        }
      ]
    },
    "meta": {
      "title": "Selling to EU Customers? Here's How to Navigate VAT and Customs",
      "description": "Navigating EU VAT and customs for your online retail business can be complex. Learn about shipping options (DDU, DDP, IOSS) and how to simplify EU expansion with Reach.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-8159-bde5-f0edaf7e8823/f6444c12-47af-4171-8eef-0c4ecdb944b5.jpg"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/selling-to-eu-customers-heres-how-to-navigate-vat-and-customs"
  },
  {
    "type": "post",
    "title": "Succeeding in the U.S. market: Why local processing and consumer knowledge matter",
    "slug": "succeeding-in-the-us-market-why-local-processing-and-consumer-knowledge-matter",
    "excerpt": "Learn how local processing, a Merchant of Record, and U.S. consumer insights can boost approval and conversion rates in global ecommerce.",
    "publishedAt": "2025-06-04T04:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/13c9344f-6e66-8163-8702-e6f7b66b6db8/b08263bd-b821-42e6-924d-f58f25800765.jpg",
      "alt": "Succeeding in the U.S. market: Why local processing and consumer knowledge matter",
      "filename": "b08263bd-b821-42e6-924d-f58f25800765.jpg"
    },
    "authors": [],
    "categories": [
      "Localized Customer Experience",
      "United States",
      "Alternative Payment Methods",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "You can’t scale in the U.S. without adapting to what American shoppers expect: local processing, instant gratification, and seamless checkout. American shoppers have unique expectations shaped by decades of credit-based purchasing, fast delivery models, and frictionless online experiences. Businesses selling into the U.S. must adapt their strategies to meet these local demands - otherwise, they risk lower approval rates and lost conversions."
        },
        {
          "blockType": "paragraph",
          "text": "### Credit Cards Drive U.S. Consumer Spending"
        },
        {
          "blockType": "paragraph",
          "text": "In the U.S., credit cards drive the entire ecommerce industry. With an average of 4.5 credit cards per person, American consumers are highly dependent on lines of credit to make everyday purchases."
        },
        {
          "blockType": "paragraph",
          "text": "Unlike in many other countries where debit or bank transfer options dominate, U.S. consumers prefer credit cards not only for convenience but also for rewards. Cashback, travel points, and other perks are major incentives to spend. International retailers who fail to offer the full range of major credit card options (Visa, Mastercard, American Express) will see it reflected in lower conversion rates."
        },
        {
          "blockType": "paragraph",
          "text": "### Fast, Free, and Frictionless: The New Standard in U.S. Shopping"
        },
        {
          "blockType": "paragraph",
          "text": "Thanks to Amazon, American consumers have grown accustomed to same-day or next-day shipping. This expectation now extends to most ecommerce experiences. Offering free and fast shipping isn’t a bonus - it’s a requirement. For global ecommerce brands, mimicking this level of service requires localized logistics and fulfillment strategies."
        },
        {
          "blockType": "paragraph",
          "text": "The expectation for a fast, seamless checkout also puts pressure on international sellers to eliminate any unnecessary steps in the buying journey. That includes things like 3D Secure (3DS). While common in Europe and other regions, 3DS introduces friction in U.S. checkout flows, which can hurt conversion rates."
        },
        {
          "blockType": "paragraph",
          "text": "### Why Local Processing and Local Presence Matter"
        },
        {
          "blockType": "paragraph",
          "text": "One of the most common mistakes global ecommerce businesses make is failing to localize their payment infrastructure. If you're routing payments through foreign banks or unfamiliar payment flows, U.S. issuing banks may flag transactions as risky, even if they’re legitimate."
        },
        {
          "blockType": "paragraph",
          "text": "This is where a merchant of record becomes especially powerful. By working with a provider that enables local processing, your business can increase approval rates by appearing as a trusted local entity to both consumers and their banks. The result? A smoother transaction experience and fewer declines at checkout."
        },
        {
          "blockType": "paragraph",
          "text": "Additionally, local processing helps reduce chargebacks and customer service friction, especially in a credit-heavy market like the U.S. where consumers are quick to dispute charges that feel unfamiliar."
        },
        {
          "blockType": "paragraph",
          "text": "### Timing Is Everything: U.S. Buying Cycles"
        },
        {
          "blockType": "paragraph",
          "text": "U.S. ecommerce has clear seasonal peaks. Black Friday, Cyber Monday, and the holiday shopping season (from Thanksgiving through New Year’s) represent the most lucrative period for retailers. But success during these times hinges on being prepared to meet heightened expectations for speed, personalization, and discounts."
        },
        {
          "blockType": "paragraph",
          "text": "This is also when local consumer knowledge pays off. Americans are heavily influenced by sentiment and tradition (often gift giving) during the holiday season. Understanding these cultural patterns allows brands to tailor promotions that resonate, boost conversion rates, and increase customer lifetime value."
        },
        {
          "blockType": "paragraph",
          "text": "### 4 Takeaways for Selling into the U.S. Market"
        },
        {
          "blockType": "paragraph",
          "text": "To optimize your global ecommerce performance in the U.S., follow these best practices:"
        },
        {
          "blockType": "paragraph",
          "text": "1. Enable frictionless checkout"
        },
        {
          "blockType": "paragraph",
          "text": "Simplify the payment flow by offering the right mix of credit card options and removing obstacles like 3DS unless absolutely necessary."
        },
        {
          "blockType": "paragraph",
          "text": "2. Leverage local processing"
        },
        {
          "blockType": "paragraph",
          "text": "Route payments through U.S.-based acquiring banks to improve approval rates and reduce declines."
        },
        {
          "blockType": "paragraph",
          "text": "3. Offer fast, free shipping"
        },
        {
          "blockType": "paragraph",
          "text": "Compete with Amazon-level logistics to win on delivery expectations."
        },
        {
          "blockType": "paragraph",
          "text": "4. Use a Merchant of Record"
        },
        {
          "blockType": "paragraph",
          "text": "A Merchant of Record can manage compliance, taxes, and payments while giving your brand the local presence it needs to succeed."
        },
        {
          "blockType": "paragraph",
          "text": "---"
        },
        {
          "blockType": "paragraph",
          "text": "### Final Thoughts"
        },
        {
          "blockType": "paragraph",
          "text": "Cracking the U.S. market requires more than just offering products. To truly compete, global ecommerce brands must understand every part of their customers’ journey from the initial marketing touchpoint, to how they pay at checkout. When you combine strong local consumer knowledge with seamless payments and fast delivery, the payoff is clear: higher approval rates, better conversion rates, and more loyal customers."
        },
        {
          "blockType": "paragraph",
          "text": "In a market shaped by instant expectations, your ability to localize isn’t a nice-to-have - it’s your competitive edge."
        },
        {
          "blockType": "paragraph",
          "text": "Looking for a Merchant of Record to help your sales in the U.S. and beyond? Reach out."
        },
        {
          "blockType": "paragraph",
          "text": "Want to go deeper on U.S. consumer behavior? Hear firsthand insights from industry expert, Matthew Steinbrecher, in Business Over Borders: Consumer Behaviour in the USA."
        }
      ]
    },
    "meta": {
      "title": "Succeeding in the U.S. market: Why local processing and consumer knowledge matter",
      "description": "Learn how local processing, a Merchant of Record, and U.S. consumer insights can boost approval and conversion rates in global ecommerce.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/13c9344f-6e66-8163-8702-e6f7b66b6db8/b08263bd-b821-42e6-924d-f58f25800765.jpg"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/succeeding-in-the-us-market-why-local-processing-and-consumer-knowledge-matter"
  },
  {
    "type": "post",
    "title": "The Cross-Border Commerce Surge: Why BFCM 2025 Proves Global is the New Default",
    "slug": "the-cross-border-commerce-surge-why-bfcm-2025-proves-global-is-the-new-default",
    "excerpt": "Black Friday and Cyber Monday 2025 didn't just break sales records—they confirmed a fundamental shift in how consumers shop. The data is clear: cross-border commerce isn't a nice-to-have expansion strategy anymore. It's rapidly becoming the default way people buy online.",
    "publishedAt": "2026-01-15T05:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/2e99344f-6e66-8011-a490-f16e77587e4c/a8370b7d-41a8-49ef-b21b-8a1a86c04092.jpeg",
      "alt": "The Cross-Border Commerce Surge: Why BFCM 2025 Proves Global is the New Default",
      "filename": "a8370b7d-41a8-49ef-b21b-8a1a86c04092.jpeg"
    },
    "authors": [],
    "categories": [
      "Merchant of Record",
      "Retail",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "## The BFCM Numbers That Tell the Story"
        },
        {
          "blockType": "paragraph",
          "text": "The 2025 BFCM weekend showcased the explosive power of cross-border commerce. Shopify merchants alone generated $14.6 billion in global sales—a 27% increase from 2024\\."
        },
        {
          "blockType": "paragraph",
          "text": "But here's what makes this significant: cross-border orders grew at 31% year-over-year during BFCM 2024, dramatically outpacing the 23% growth rate of total orders. Stripe reported cross-border transaction volume hit a record $3.2 billion over the four-day period, while cross-border freight volumes jumped 18% year-over-year."
        },
        {
          "blockType": "paragraph",
          "text": "## The Bigger Picture: A $18 Trillion Opportunity"
        },
        {
          "blockType": "paragraph",
          "text": "BFCM provides a concentrated snapshot, but the broader market tells an even more compelling story. The global cross-border e-commerce market reached $1.98 trillion in 2024 and is projected to hit $18.2 trillion by 2034—a compound annual growth rate of 23.5%."
        },
        {
          "blockType": "paragraph",
          "text": "Cross-border e-commerce is expanding at a 28.3% faster rate than domestic e-commerce through 2030\\. About 59% of global shoppers now purchase from retailers outside their country, with 35% doing so at least monthly. In Canada, 55.5% of online shoppers have purchased internationally in the past year—the highest rate in North America."
        },
        {
          "blockType": "paragraph",
          "text": "## Where the Growth Is Happening"
        },
        {
          "blockType": "paragraph",
          "text": "Our data reveals clear patterns in market performance during BFCM:"
        },
        {
          "blockType": "paragraph",
          "text": "Top Volume Markets (in GMV):"
        },
        {
          "blockType": "paragraph",
          "text": "- United States: \\+94% YoY - Canada: \\+78% YoY - United Kingdom: \\+85% YoY - Australia: \\+63% YoY"
        },
        {
          "blockType": "paragraph",
          "text": "Explosive Growth Markets:"
        },
        {
          "blockType": "paragraph",
          "text": "- France: \\+120% YoY - Spain: $+171% YoY - Switzerland: \\+96% YoY"
        },
        {
          "blockType": "paragraph",
          "text": "The full-year 2025 data reinforces this isn't just holiday momentum."
        },
        {
          "blockType": "paragraph",
          "text": "## Why Consumers Are Going Global"
        },
        {
          "blockType": "paragraph",
          "text": "Several factors are driving this surge:"
        },
        {
          "blockType": "paragraph",
          "text": "Mobile-First Shopping: Over 70% of BFCM purchases happened on mobile devices, making international shopping as easy as domestic."
        },
        {
          "blockType": "paragraph",
          "text": "Seamless Payments: Digital wallets (53% of transactions), credit cards (20%), and debit cards (12%) work effortlessly across borders."
        },
        {
          "blockType": "paragraph",
          "text": "Product Access: Consumers seek authentic brands, limited editions, and niche products unavailable locally."
        },
        {
          "blockType": "paragraph",
          "text": "## What Separates Winners from Everyone Else"
        },
        {
          "blockType": "paragraph",
          "text": "The highest-performing cross-border operations share key characteristics:"
        },
        {
          "blockType": "paragraph",
          "text": "Localization at Scale: They adapt pricing, payment options, shipping methods, and marketing for each market—not just translation."
        },
        {
          "blockType": "paragraph",
          "text": "Strategic Market Focus: They prioritize markets with proven demand like North America, Europe, and Australia while testing emerging opportunities in Mexico and other regions."
        },
        {
          "blockType": "paragraph",
          "text": "Operational Excellence: They meet the 5-7 day delivery window consumers now expect, with transparent costs and reliable tracking."
        },
        {
          "blockType": "paragraph",
          "text": "Data-Driven Optimization: They continuously analyze AOV by country, conversion by region, and customer lifetime value by geography to double down on what works."
        },
        {
          "blockType": "paragraph",
          "text": "## The Urgency of Now"
        },
        {
          "blockType": "paragraph",
          "text": "By 2030, cross-border B2C e-commerce will reach $7.9 trillion globally. Asia-Pacific—already 40% of the market at $882 billion—will grow at 32.5% CAGR. Europe and North America continue expanding steadily."
        },
        {
          "blockType": "paragraph",
          "text": "The brands that will dominate the next decade are building truly global operations today. They're investing in international infrastructure, understanding diverse customer bases, and creating seamless experiences regardless of where customers live."
        },
        {
          "blockType": "paragraph",
          "text": "The BFCM 2025 results aren't just impressive statistics—they're a signal. Global consumers are ready and eager to buy internationally. The infrastructure exists. The demand is proven. The growth rates are accelerating."
        },
        {
          "blockType": "paragraph",
          "text": "Your competitors are already capturing customers in markets you haven't entered. The surge in cross-border commerce isn't an anomaly—it's the new normal."
        },
        {
          "blockType": "paragraph",
          "text": "---"
        },
        {
          "blockType": "paragraph",
          "text": "Data sources: Shopify BFCM Reports, Adobe Analytics, Stripe Transaction Data, Precedence Research, Market.us, Capital One Shopping Research, Reach Internal Data, and Polaris Market Research."
        }
      ]
    },
    "meta": {
      "title": "The Cross-Border Commerce Surge: Why BFCM 2025 Proves Global is the New Default",
      "description": "Black Friday and Cyber Monday 2025 didn't just break sales records—they confirmed a fundamental shift in how consumers shop. The data is clear: cross-border commerce isn't a nice-to-have expansion strategy anymore. It's rapidly becoming the default way people buy online.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/2e99344f-6e66-8011-a490-f16e77587e4c/a8370b7d-41a8-49ef-b21b-8a1a86c04092.jpeg"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/the-cross-border-commerce-surge-why-bfcm-2025-proves-global-is-the-new-default"
  },
  {
    "type": "post",
    "title": "The End of an Era: Why the Old Merchant of Record Model No Longer Works",
    "slug": "the-end-of-an-era-why-the-old-merchant-of-record-model-no-longer-works",
    "excerpt": "Learn how traditional Merchant of Record models failed, and why the future of this model belongs to those who can provide flexible, cost-effective solutions.",
    "publishedAt": "2025-02-25T05:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-81fb-931b-fe95f01a3f1b/b28aeb42-8d59-4109-9406-d309a8a9e912.jpg",
      "alt": "The End of an Era: Why the Old Merchant of Record Model No Longer Works",
      "filename": "b28aeb42-8d59-4109-9406-d309a8a9e912.jpg"
    },
    "authors": [],
    "categories": [
      "Merchant of Record",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "heading",
          "level": "h2",
          "text": "Why the Traditional Merchant of Record Model Failed"
        },
        {
          "blockType": "paragraph",
          "text": "Broad, But Shallow Functionality"
        },
        {
          "blockType": "paragraph",
          "text": "Traditional MoR providers spread their services across multiple functions but lacked depth in key areas. Their subscription management tools weren’t as sophisticated as best-in-class platforms, their fraud prevention couldn’t compete with dedicated risk solutions, and their global payment capabilities were limited."
        },
        {
          "blockType": "paragraph",
          "text": "High Costs with Low Adaptability"
        },
        {
          "blockType": "paragraph",
          "text": "Bundling all these services into one platform came with substantial price tags, literally and figuratively. Through traditional MoRs, High-growth and established brands ended up paying very high fees while being locked into a rigid system that couldn’t adapt to their evolving requirements."
        },
        {
          "blockType": "paragraph",
          "text": "Slow to Evolve, Hard to Integrate"
        },
        {
          "blockType": "paragraph",
          "text": "Traditional MoR solutions were built on monolithic platforms that required a heavy lift to integrate with modern tech stacks. Custom API connections, lengthy onboarding times, and inflexible workflows meant that global businesses couldn’t quickly adapt to new payment methods, tax regulations, or global expansion opportunities."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "The Future of MoR: Embedded, Flexible, and Cost-Effective"
        },
        {
          "blockType": "paragraph",
          "text": "Activate our MoR capabilities into your existing payment and subscription platforms without having to rip and replace your current infrastructure and start from square one."
        },
        {
          "blockType": "paragraph",
          "text": "Avoid Complex Integrations, as our streamlined embedded integrations can get you up and running fast. This means zero technical lift on your end and no costly downtimes for your international consumers, saving you money and time."
        },
        {
          "blockType": "paragraph",
          "text": "Stay agile with our lightweight, cost effective, and adaptable model that evolves and scales with your international business."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "Making the Switch: What’s Next for Digital River Merchants?"
        },
        {
          "blockType": "paragraph",
          "text": "The era of the traditional Merchant of Record is over. The future belongs to agile, cost-efficient solutions that enhance your existing systems—not replace them."
        }
      ]
    },
    "meta": {
      "title": "The End of an Era: Why the Old Merchant of Record Model No Longer Works",
      "description": "Learn how traditional Merchant of Record models failed, and why the future of this model belongs to those who can provide flexible, cost-effective solutions.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-81fb-931b-fe95f01a3f1b/b28aeb42-8d59-4109-9406-d309a8a9e912.jpg"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/the-end-of-an-era-why-the-old-merchant-of-record-model-no-longer-works"
  },
  {
    "type": "post",
    "title": "The Future of Merchant Payments: Localized, Intelligent & Global",
    "slug": "the-future-of-merchant-payments-localized-intelligent-global",
    "excerpt": "Scaling across borders is complex. See how smarter payment infrastructure helps merchants simplify, comply, and grow globally.",
    "publishedAt": "2025-10-03T04:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1ff9344f-6e66-80f9-a0cf-f00b42acce3d/f2b160ab-5c13-4d31-ac22-8c32914c3b0c.jpg",
      "alt": "The Future of Merchant Payments: Localized, Intelligent & Global",
      "filename": "f2b160ab-5c13-4d31-ac22-8c32914c3b0c.jpg"
    },
    "authors": [],
    "categories": [
      "Merchant of Record",
      "Local Processing",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "## Payments as a Growth Engine"
        },
        {
          "blockType": "paragraph",
          "text": "Payments used to be thought of as a “back-end” function — something that happened quietly after a customer clicked “buy.” But today, payments are at the heart of business growth."
        },
        {
          "blockType": "paragraph",
          "text": "Global e-commerce sales are expected to hit US $6.42 trillion by 2025 (emarketer). That growth comes with massive opportunity — but also with complexity. Customers expect localized payment experiences, regulators demand compliance across markets, and merchants face real costs when payments aren’t optimized."
        },
        {
          "blockType": "paragraph",
          "text": "Forrester highlights how merchant payment providers are central to growth. In their Q4 2025 Merchant Payment Provider Landscape, they include Reach as a solution to the complexity merchants face worldwide."
        },
        {
          "blockType": "paragraph",
          "text": "## Why Merchant Payments Matter More Than Ever"
        },
        {
          "blockType": "paragraph",
          "text": "The numbers are clear: payments are no longer “just” operational. They’re strategic."
        },
        {
          "blockType": "paragraph",
          "text": "- E-commerce is booming. Online consumer goods spending exceeded US $4.12 trillion in 2024, growing 14.6% year over year (The Global Statistics). - Digital payments are mainstream. Nearly 90% of consumers in the U.S. and Europe report using some form of digital payments in the past year (McKinsey). - Payments are fragmented. More than 25 payment types across 48 countries drive over 90% of global GDP, creating operational headaches for merchants (McKinsey)."
        },
        {
          "blockType": "paragraph",
          "text": "As Forrester notes, merchants rely on providers not just to process transactions, but to ensure payments are secure, compliant, and successful. That’s a tall order in today’s fragmented landscape — and it’s exactly why payments are now a growth lever, not just a cost center."
        },
        {
          "blockType": "paragraph",
          "text": "## Three Trends Shaping the Future of Merchant Payments"
        },
        {
          "blockType": "paragraph",
          "text": "### 1. Localized Payments = Higher Conversions"
        },
        {
          "blockType": "paragraph",
          "text": "Brands that don’t localize lose conversions. In fact, merchants who adapt checkout experiences to local expectations consistently report double-digit improvements in completion rates."
        },
        {
          "blockType": "paragraph",
          "text": "Consumers want to pay in a way that feels natural. That means:"
        },
        {
          "blockType": "paragraph",
          "text": "- Local currencies. - Familiar payment methods (like Afterpay, Shop Pay Installments, Klarna, or local debit schemes). - Seamless checkout experiences embedded in their preferred channels."
        },
        {
          "blockType": "paragraph",
          "text": "Forrester highlights localization as a critical capability for providers — and it’s one we see every day with merchants expanding globally."
        },
        {
          "blockType": "paragraph",
          "text": "### 2. Intelligence & Automation Are Non-Negotiable"
        },
        {
          "blockType": "paragraph",
          "text": "Payments aren’t just about processing anymore. They’re about optimization."
        },
        {
          "blockType": "paragraph",
          "text": "- AI and machine learning are being deployed to improve authorization rates, detect fraud, and dynamically route transactions. - Data-driven insights are turning payments into a revenue lever — helping merchants understand where money is being lost and where conversion can be gained. - Composable architectures and API-driven models allow brands to innovate without ripping apart their existing systems (Capgemini)."
        },
        {
          "blockType": "paragraph",
          "text": "As Forrester’s research reinforces, the future belongs to providers who don’t just move money — they actively help merchants grow."
        },
        {
          "blockType": "paragraph",
          "text": "### 3. Global Scale, Local Trust"
        },
        {
          "blockType": "paragraph",
          "text": "Merchants want to expand fast — into new regions, new channels, new categories. But the reality is that every market comes with new layers of regulation, tax complexity, and compliance requirements."
        },
        {
          "blockType": "paragraph",
          "text": "- In the U.S., sales tax compliance alone is a major operational burden. - In Europe, PSD2 requirements demand stronger authentication and stricter standards. - Across APAC and LATAM, local card schemes and regulatory frameworks add further complexity."
        },
        {
          "blockType": "paragraph",
          "text": "Forrester highlights this tension between global ambition and local compliance. Payments providers who solve for both enable merchants to scale confidently and sustainably."
        },
        {
          "blockType": "paragraph",
          "text": "## How Reach Fits In"
        },
        {
          "blockType": "paragraph",
          "text": "Being included in Forrester’s Merchant Payment Providers Landscape, Q4 2025 isn’t just recognition — it’s validation of how Reach is addressing exactly these challenges:"
        },
        {
          "blockType": "paragraph",
          "text": "- Localized checkout experiences that reduce abandonment and boost conversions. - Global tax and compliance coverage that removes operational headaches. - Data-driven optimization that helps merchants cut costs and grow revenue. - Scalable infrastructure that supports expansion without compromise."
        },
        {
          "blockType": "paragraph",
          "text": "By staying merchant-focused, we’ve built solutions that align directly with the trends Forrester points to as shaping the future of payments."
        },
        {
          "blockType": "paragraph",
          "text": "## The Road Ahead"
        },
        {
          "blockType": "paragraph",
          "text": "Being named in Forrester’s Landscape is a milestone — but it’s not the destination."
        },
        {
          "blockType": "paragraph",
          "text": "For merchants, the next chapter of growth will be written by those who:"
        },
        {
          "blockType": "paragraph",
          "text": "- Offer truly localized payment experiences. - Harness intelligence to optimize not just transactions, but revenue. - Scale globally while navigating compliance complexity with ease."
        },
        {
          "blockType": "paragraph",
          "text": "At Reach, this has been our mission from day one. We’re proud of the recognition, but even more excited about what’s ahead: helping merchants unlock new levels of growth in the rapidly evolving payments landscape."
        },
        {
          "blockType": "paragraph",
          "text": "To learn more book a demo!"
        },
        {
          "blockType": "paragraph",
          "text": "## Disclaimer"
        },
        {
          "blockType": "paragraph",
          "text": "Forrester does not endorse any company, product, or service depicted in its research publications."
        }
      ]
    },
    "meta": {
      "title": "The Future of Merchant Payments: Localized, Intelligent & Global",
      "description": "Scaling across borders is complex. See how smarter payment infrastructure helps merchants simplify, comply, and grow globally.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1ff9344f-6e66-80f9-a0cf-f00b42acce3d/f2b160ab-5c13-4d31-ac22-8c32914c3b0c.jpg"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/the-future-of-merchant-payments-localized-intelligent-global"
  },
  {
    "type": "post",
    "title": "The Hidden Risks of Tax Non-Compliance for SaaS Companies",
    "slug": "the-hidden-risks-of-tax-non-compliance-for-saas-companies",
    "excerpt": "Tax compliance is a growing risk for global SaaS companies, and too many are unprepared. Learn why it matters, what’s at stake, and how to build a scalable compliance strategy.",
    "publishedAt": "2025-05-14T04:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/13d9344f-6e66-81f5-b217-ebcce7743754/140f9228-644c-4190-ab3b-a3951a28f8c6.jpg",
      "alt": "The Hidden Risks of Tax Non-Compliance for SaaS Companies",
      "filename": "140f9228-644c-4190-ab3b-a3951a28f8c6.jpg"
    },
    "authors": [],
    "categories": [
      "Tax",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "In the fast-moving world of SaaS, it’s easy to stay focused on product innovation, customer growth, and market expansion. But there’s one critical area that too often gets overlooked: tax compliance."
        },
        {
          "blockType": "paragraph",
          "text": "A recent study found that only 16% of Forbes' top AI companies are fully compliant with indirect tax rules. That stat might seem surprising, but it highlights a growing issue in SaaS. As companies scale globally, many are finding themselves unprepared for the complex tax rules that come with it."
        },
        {
          "blockType": "paragraph",
          "text": "This article breaks down why tax compliance matters, what’s at stake if it’s ignored, and how your team can stay ahead of the risks."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "The Growing Complexity of Global Tax"
        },
        {
          "blockType": "paragraph",
          "text": "If you’re selling digital products or services across borders, you’re probably subject to a patchwork of tax rules, many of which change regularly. Today, nearly 100 countries require SaaS providers to register, collect, and remit taxes. Keeping up isn’t just hard; it can be overwhelming without the right systems and support."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Financial Risk: It Adds Up Fast"
        },
        {
          "blockType": "paragraph",
          "text": "Non-compliance can come with serious financial consequences. Companies that fall behind on tax obligations often owe back taxes plus interest, and some jurisdictions tack on steep penalties that can cost more than the original tax bill."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Operational Disruption: When Things Grind to a Halt"
        },
        {
          "blockType": "paragraph",
          "text": "In some cases, non-compliance can lead to frozen accounts, blocked payouts, or even full service shutdowns in specific countries. These disruptions don’t just impact sales, they can ripple out across supply chains and operations, affecting customers and teams far beyond the original issue."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Reputational Fallout"
        },
        {
          "blockType": "paragraph",
          "text": "High-profile companies caught in tax scandals often face intense media scrutiny, damaging their public image. Customers may view non-compliant companies as unethical or unreliable; investors, partners, and employees may lose confidence in the company's leadership and long-term viability."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Barriers to Growth"
        },
        {
          "blockType": "paragraph",
          "text": "As more investors and acquirers include tax compliance in their due diligence, unresolved issues can stall funding or delay acquisitions. If you’re looking to grow into new markets, a history of tax non-compliance can influence regulators in other regions - holding you back from expansion. For companies with big plans, this can mean missed opportunities at critical moments."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "What You Can Do About It"
        },
        {
          "blockType": "paragraph",
          "text": "The good news? This is solvable. SaaS companies that prioritize compliance early can avoid costly surprises down the road. That starts with:"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Bringing in tax advisors who understand digital business models",
            "Automating tax calculation and reporting where possible",
            "Keeping a close eye on changing global requirements",
            "Addressing any issues quickly and transparently"
          ]
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Final Thoughts"
        },
        {
          "blockType": "paragraph",
          "text": "Global tax rules are only getting more complex, but staying compliant doesn’t have to be painful. By building compliance into your operations early, your business can grow confidently and sustainably. And you’ll spend less time putting out fires, and more time doing what you do best."
        },
        {
          "blockType": "paragraph",
          "text": "Learn more about tax compliance with our World of Tax podcast, where you’ll get more insights into what happens when SaaS businesses aren’t tax compliant."
        },
        {
          "blockType": "paragraph",
          "text": "Looking for an all-in-one Merchant of Record solution to handle your tax compliance? Reach out to our team."
        }
      ]
    },
    "meta": {
      "title": "The Hidden Risks of Tax Non-Compliance for SaaS Companies",
      "description": "Tax compliance is a growing risk for global SaaS companies, and too many are unprepared. Learn why it matters, what’s at stake, and how to build a scalable compliance strategy.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/13d9344f-6e66-81f5-b217-ebcce7743754/140f9228-644c-4190-ab3b-a3951a28f8c6.jpg"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/the-hidden-risks-of-tax-non-compliance-for-saas-companies"
  },
  {
    "type": "post",
    "title": "The Rise of Digital Wallets: Transforming the Payment Landscape",
    "slug": "the-rise-of-digital-wallets-transforming-the-payment-landscape",
    "excerpt": "Explore how digital wallets are reshaping the payment landscape, from advanced security features to widespread adoption. Learn why mobile commerce is projected to reach 77% of transactions by 2025, and discover why offering digital payment solutions is becoming essential for business success.",
    "publishedAt": "2024-12-04T05:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/13e9344f-6e66-8062-ae21-faeb3f20a972/e1dc9a7a-71d0-4d80-b5b6-6726548aa38d.jpg",
      "alt": "The Rise of Digital Wallets: Transforming the Payment Landscape",
      "filename": "e1dc9a7a-71d0-4d80-b5b6-6726548aa38d.jpg"
    },
    "authors": [],
    "categories": [
      "Alternative Payment Methods",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "Digital wallets are revolutionizing the way we make payments, offering convenience and security in an increasingly digital world. Over the last year, there has been remarkable growth in mobile commerce, and it’s projected that by 2025, there will be an estimated 3.1 billion digital buyers, with mobile ecommerce reaching a staggering 77% of transactions. This shift towards mobile payments is driven by increased internet penetration and the ease of shopping on-the-go, making it simpler than ever for consumers to make purchases from their smartphones."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "Security and Authentication in Digital Wallets"
        },
        {
          "blockType": "paragraph",
          "text": "A critical aspect of digital wallets is payment security and the need for robust authentication methods. As these payment methods become more ingrained in everyday transactions, it is important to ensure that both consumers and merchants are aware of the steps they can take to keep payment data secure.\nDigital wallets use tokenization, which ensures consumer data is protected by replacing sensitive data with a single-use token. Even if the token is intercepted, it cannot be used outside of its original intended use. This reduces card-not-present fraud, and has the additional benefit of being PCI compliant."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "What digital wallets to offer your customers"
        },
        {
          "blockType": "paragraph",
          "text": "With any payment option, there’s trends that span across the globe and payment offerings that have more weight in specific markets. Digital wallets such as PayPal and Apple Pay are becoming a necessity to offer no matter what market you’re selling into. Their seamless user experience and trustworthiness have fostered loyalty among consumers, driving widespread adoption."
        },
        {
          "blockType": "paragraph",
          "text": "Wallet offerings are growing in other areas as well, specifically with BNPL. Businesses, such as Klarna, operate similarly to a digital wallet while offering the additional benefit of buy now pay later."
        },
        {
          "blockType": "paragraph",
          "text": "As these digital wallets integrate with various platforms, including Google Pay and even driver's licenses, the concept of a \"super app\" is becoming a reality. These apps allow consumers to manage multiple aspects of their lives from a single device."
        },
        {
          "blockType": "conclusion",
          "heading": "Conclusion",
          "text": "As we look to the future of payments, the momentum behind digital wallets shows no signs of slowing down. With projected growth to 3.1 billion digital buyers by 2025, businesses must adapt to meet evolving consumer preferences. The combination of robust security measures, seamless user experiences, and the evolution toward \"super app\" functionality positions digital wallets as not just a trend, but a fundamental shift in how we handle transactions.\n\nFor businesses looking to stay competitive in this rapidly evolving landscape, incorporating popular digital payment solutions like PayPal and Apple Pay isn't just an option—it's becoming a necessity for success in the digital age.\n\nWith Reach, you can easily add these digital wallets to your checkout flow. Discover how our global experts and Merchant of Record model can maximize your international potential today and in the future here.\n\nLearn more about the rise of digital wallets in our Business Over Borders podcast."
        }
      ]
    },
    "meta": {
      "title": "The Rise of Digital Wallets: Transforming the Payment Landscape",
      "description": "Explore how digital wallets are reshaping the payment landscape, from advanced security features to widespread adoption. Learn why mobile commerce is projected to reach 77% of transactions by 2025, and discover why offering digital payment solutions is becoming essential for business success.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/13e9344f-6e66-8062-ae21-faeb3f20a972/e1dc9a7a-71d0-4d80-b5b6-6726548aa38d.jpg"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/the-rise-of-digital-wallets-transforming-the-payment-landscape"
  },
  {
    "type": "post",
    "title": "Understanding Canadian Consumer Behaviour for Cross-Border Retail Success",
    "slug": "understanding-canadian-consumer-behaviour-for-cross-border-retail-success",
    "excerpt": "Expand your business into Canada with insights on Canadian consumer behavior, payment preferences, pricing strategies, shipping options, and key shopping patterns. Discover how to tailor your approach to succeed in this lucrative market by partnering with Reach’s merchant of record services.",
    "publishedAt": "2025-01-22T05:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/13c9344f-6e66-81cd-9d49-e46f8fd47133/56f2153c-808c-41f0-9668-10189224a2fe.jpg",
      "alt": "Understanding Canadian Consumer Behaviour for Cross-Border Retail Success",
      "filename": "56f2153c-808c-41f0-9668-10189224a2fe.jpg"
    },
    "authors": [],
    "categories": [
      "Localized Customer Experience",
      "Canada",
      "Alternative Payment Methods",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Payment Preferences in Canada"
        },
        {
          "blockType": "paragraph",
          "text": "Canadians lean heavily toward credit cards as their primary payment method, making them indispensable for online retail. While options like PayPal and Interac (a local debit network) are also popular, credit cards dominate for everyday purchases. Ensuring seamless credit card integration is essential for businesses looking to cater to this market."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Pricing Expectations and Currency Considerations"
        },
        {
          "blockType": "paragraph",
          "text": "Pricing is a unique topic for Canadian shoppers. Although they prefer to see prices listed in Canadian dollars (CAD) when shopping online, with the country’s proximity to the U.S., Canadians are well-versed in current exchange rates and can easily identify discrepancies. Therefore, transparency is key—customers won’t accept inflated exchange rates or hidden markups. If pricing in CAD involves a significant premium, they’ll often opt to pay in U.S. dollars instead, provided the overall cost offers better value. Retailers must strike a balance by providing competitive exchange rates and clear pricing in CAD."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Duties, Taxes, and Shipping Options"
        },
        {
          "blockType": "paragraph",
          "text": "Shipping and handling pose unique challenges in Canada due to duties and taxes. Two main shipping options shape the customer experience:"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Delivered Duty Paid (DDP): This option allows shoppers to pay all duties, taxes, and fees upfront at checkout. It guarantees no surprise charges upon delivery, providing a smoother, more predictable experience.",
            "Delivered Duty Unpaid (DDU): This method calculates and collects duties and taxes upon delivery. While less seamless, some customers prefer DDU to avoid upfront costs or because they hope their package might bypass additional charges."
          ]
        },
        {
          "blockType": "paragraph",
          "text": "Offering both DDP and DDU options is crucial, as Canadian shoppers value flexibility. Businesses that fail to provide these choices risk alienating a significant portion of their customer base."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "The Impact of Duties and Taxes on Consumer Behavior"
        },
        {
          "blockType": "paragraph",
          "text": "Historically, Canadian shoppers could often import goods without significant duties or taxes. However, in recent years, the government has cracked down on uncollected fees to generate revenue. Popular carriers, like FedEx and UPS, now frequently stop packages to assess additional charges, which can include both government taxes and carrier fees for handling these payments. This shift has caused friction in the shopping experience.\nRetailers must be proactive in addressing these challenges. Clear communication about potential fees and the choice between DDP and DDU helps build trust and reduce friction in the purchasing process."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Seasonal Shopping Patterns in Canada"
        },
        {
          "blockType": "paragraph",
          "text": "While Canadian and U.S. holiday shopping schedules are largely similar, Boxing Day (December 26th) is a uniquely Canadian retail event that rivals Black Friday in importance. Retailers should plan their promotions accordingly to capitalize on this major shopping day. Beyond Boxing Day, the general cadence of holiday shopping aligns closely with that of the U.S., making it easier for businesses to plan campaigns that appeal to both markets."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Key Strategies for Retailers Selling to Canada"
        },
        {
          "blockType": "paragraph",
          "text": "To thrive in the Canadian market, retailers must prioritize a tailored approach that addresses the specific preferences of Canadian shoppers. This includes offering competitive CAD pricing, providing flexible shipping options with clear communication about duties and taxes, and capitalizing on key shopping dates like Boxing Day."
        },
        {
          "blockType": "paragraph",
          "text": "By focusing on these strategies, businesses can foster trust, deliver a seamless shopping experience, and secure long-term loyalty in this lucrative market."
        },
        {
          "blockType": "paragraph",
          "text": "These nuances are why it’s important to find the best partner to help you expand into key markets worldwide. Learn how Reach’s Merchant of Record model can help your business succeed in the Canadian market and beyond."
        },
        {
          "blockType": "paragraph",
          "text": "Want to know more about Canadian consumers? Listen to our podcast with our VP Revenue at Reach, Matthew Steinbrecher, for the lowdown."
        }
      ]
    },
    "meta": {
      "title": "Understanding Canadian Consumer Behaviour for Cross-Border Retail Success",
      "description": "Expand your business into Canada with insights on Canadian consumer behavior, payment preferences, pricing strategies, shipping options, and key shopping patterns. Discover how to tailor your approach to succeed in this lucrative market by partnering with Reach’s merchant of record services.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/13c9344f-6e66-81cd-9d49-e46f8fd47133/56f2153c-808c-41f0-9668-10189224a2fe.jpg"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/understanding-canadian-consumer-behaviour-for-cross-border-retail-success"
  },
  {
    "type": "post",
    "title": "Understanding Ecommerce Fraud & Scams in Japan: What Your Global Business Needs to Know",
    "slug": "understanding-ecommerce-fraud-scams-in-japan-what-your-global-business-needs-to-know",
    "excerpt": " Learn what you need to know about ecommerce fraud and scams impacting online payments in Japan.",
    "publishedAt": "2025-05-12T04:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1ee9344f-6e66-801c-9f49-d7495067207a/c5077eea-2177-4880-a9de-18cc143e86a5.jpg",
      "alt": "Understanding Ecommerce Fraud & Scams in Japan: What Your Global Business Needs to Know",
      "filename": "c5077eea-2177-4880-a9de-18cc143e86a5.jpg"
    },
    "authors": [],
    "categories": [
      "Fraud",
      "Japan",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "When most people think of Japan, fraud probably isn’t the first thing that comes to mind. Known for its safety, order, and strong cultural values, Japan has long enjoyed a reputation as a low-crime country. But things are shifting. In 2024, fraud and scam-related losses reached a ten-year high — totaling a staggering 54 billion yen. So, what’s behind this rise, and what should businesses know if they’re operating in or looking to enter this evolving market?"
        },
        {
          "blockType": "paragraph",
          "text": "## A Generational Shift Driving Change"
        },
        {
          "blockType": "paragraph",
          "text": "One of the biggest factors is the changing dynamic between generations. Japan has a rapidly aging population, with fewer young people coming up behind them. Traditionally, the country has been guided by values like trust, honor, and honesty — passed down from older generations."
        },
        {
          "blockType": "paragraph",
          "text": "But as younger people grow up in a world shaped by global media and social platforms, those traditional values are starting to shift. Many young job seekers, eager to keep up with modern lifestyles, are falling victim to job scams. These scams often look like attractive, well-paid online opportunities — but they can lead unsuspecting youth into activities like data theft or even participating in credit card fraud."
        },
        {
          "blockType": "paragraph",
          "text": "## Romance Scams: Exploiting the Lonely"
        },
        {
          "blockType": "paragraph",
          "text": "Another troubling trend is the rise of romance scams, especially targeting older adults. As more seniors live alone or with limited support networks, they can become vulnerable to scammers posing as romantic partners."
        },
        {
          "blockType": "paragraph",
          "text": "Once trust is established, the scammer starts asking for money — sometimes for emergencies, travel expenses, or fake investments. Because the victim believes in the relationship, they may send large sums, sometimes even draining savings or taking out loans. It's a heartbreaking form of fraud that highlights the emotional and generational gaps scammers exploit."
        },
        {
          "blockType": "paragraph",
          "text": "## Fighting Back: Banks and 3D Secure 2.0"
        },
        {
          "blockType": "paragraph",
          "text": "To help combat this wave of fraud, Japanese banks are rolling out 3D Secure 2.0 — an enhanced security system for online payments. It typically involves a one-time password or additional verification step during checkout to confirm that it’s really you making the purchase."
        },
        {
          "blockType": "paragraph",
          "text": "While it’s a smart move for preventing stolen card use, it’s not without its challenges. Many older consumers in Japan aren’t fully comfortable with digital payments as it is — and adding another layer of complexity might discourage them from completing purchases."
        },
        {
          "blockType": "paragraph",
          "text": "Businesses are rightly concerned about what this means for online sales. The key will be ensuring smooth implementation. That means businesses need to be ready to support this added layer of security, and banks must make the process as user-friendly as possible."
        },
        {
          "blockType": "paragraph",
          "text": "## Turning Risk Into Opportunity"
        },
        {
          "blockType": "paragraph",
          "text": "Despite the rise in fraud, Japan still holds strong potential — especially in the growing ecommerce space. Younger generations are embracing online shopping and are increasingly open to international brands and trends."
        },
        {
          "blockType": "paragraph",
          "text": "For companies looking to grow in Japan, understanding these shifting fraud patterns and security updates is essential. It’s not just about preventing financial losses — it’s about building lasting trust with your customers."
        },
        {
          "blockType": "paragraph",
          "text": "Want to dive deeper into what’s happening in Japan’s fraud landscape? Check out recent episode of True Fraud."
        },
        {
          "blockType": "paragraph",
          "text": "Thinking about expanding your sales in Japan? Our Merchant of Record model can help."
        }
      ]
    },
    "meta": {
      "title": "Understanding Ecommerce Fraud & Scams in Japan: What Your Global Business Needs to Know",
      "description": " Learn what you need to know about ecommerce fraud and scams impacting online payments in Japan.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1ee9344f-6e66-801c-9f49-d7495067207a/c5077eea-2177-4880-a9de-18cc143e86a5.jpg"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/understanding-ecommerce-fraud-scams-in-japan-what-your-global-business-needs-to-know"
  },
  {
    "type": "post",
    "title": "Understanding the Corporate Transparency Act (CTA) and Its Impact on U.S. Businesses",
    "slug": "understanding-the-corporate-transparency-act-cta-and-its-impact-on-us-businesses",
    "excerpt": "Businesses operating in the United States should be aware of a critical new regulation: the Corporate Transparency Act (CTA). Learn more in this article.",
    "publishedAt": "2024-10-29T04:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1769344f-6e66-8147-b123-e3969d759397/5d56ca02-db63-46ec-83b1-99ac634c3fcc.jpg",
      "alt": "Understanding the Corporate Transparency Act (CTA) and Its Impact on U.S. Businesses",
      "filename": "5d56ca02-db63-46ec-83b1-99ac634c3fcc.jpg"
    },
    "authors": [],
    "categories": [
      "Compliance",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "As we approach the end of the year, businesses operating in the United States should be aware of a critical new regulation: the Corporate Transparency Act (CTA), which came into effect on January 1, 2024. This legislation introduces new compliance requirements for corporations, limited liability companies, and other entities operating within the U.S."
        },
        {
          "blockType": "paragraph",
          "text": "While there have been legal challenges, notably from the Alabama Federal District Court, only the plaintiffs involved have been granted a stay from the CTA's application. This means most companies must prepare to comply with its provisions, particularly in filing a Beneficial Ownership Information (BOI) report with the U.S. Department of the Treasury’s Financial Crimes Enforcement Network (FinCEN)."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "What is Required Under the CTA?"
        },
        {
          "blockType": "paragraph",
          "text": "The CTA mandates that all legal entities created or registered to do business in the U.S. submit a BOI report. This report must include detailed information about the entity’s beneficial owners and, in the case of newly formed entities, the individuals involved in the formation process. The specific deadlines for submitting these reports vary based on when the entity was established or registered."
        },
        {
          "blockType": "paragraph",
          "text": "Failing to meet these filing requirements can result in penalties, so it is essential to begin preparing your compliance efforts as early as possible."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "The Time to Act is Now"
        },
        {
          "blockType": "paragraph",
          "text": "Given the January 1, 2025, deadline and the high volume of anticipated filings, it’s crucial to begin the compliance process now. FinCEN is expected to experience a significant influx of reports, and delaying could result in unnecessary complications or risks for your business."
        },
        {
          "blockType": "paragraph",
          "text": "By staying ahead of these compliance requirements, your business can avoid potential legal risks and ensure it continues to operate smoothly in the U.S."
        },
        {
          "blockType": "paragraph",
          "text": "File a Beneficial Ownership Information (BOI) report today:"
        },
        {
          "blockType": "paragraph",
          "text": "https://boiefiling.fincen.gov"
        },
        {
          "blockType": "paragraph",
          "text": "Want to learn more? Check out the BOI FAQ:"
        },
        {
          "blockType": "paragraph",
          "text": "https://www.fincen.gov/boi-faqs#B_1"
        }
      ]
    },
    "meta": {
      "title": "Understanding the Corporate Transparency Act (CTA) and Its Impact on U.S. Businesses",
      "description": "Businesses operating in the United States should be aware of a critical new regulation: the Corporate Transparency Act (CTA). Learn more in this article.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1769344f-6e66-8147-b123-e3969d759397/5d56ca02-db63-46ec-83b1-99ac634c3fcc.jpg"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/understanding-the-corporate-transparency-act-cta-and-its-impact-on-us-businesses"
  },
  {
    "type": "post",
    "title": "Understanding USMCA Rules of Origin & Their Impact on Tariffs",
    "slug": "understanding-usmca-rules-of-origin-their-impact-on-tariffs",
    "excerpt": "With the latest tariff adjustments, goods that meet the USMCA (U.S.-Mexico-Canada Agreement) rules of origin will not be subject to the new 25% tariffs. However, those that do not qualify will face the full tariff rate.",
    "publishedAt": "2025-03-10T04:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-81c0-b3a7-e839c7af2e3f/a7ddfae7-250a-4284-8035-c10c3c66dafd.jpg",
      "alt": "Understanding USMCA Rules of Origin & Their Impact on Tariffs",
      "filename": "a7ddfae7-250a-4284-8035-c10c3c66dafd.jpg"
    },
    "authors": [],
    "categories": [
      "Tax",
      "Tarrifs",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "heading",
          "level": "h2",
          "text": "What Are USMCA Rules of Origin?"
        },
        {
          "blockType": "paragraph",
          "text": "Think of these as the “made in North America” rules. USMCA replaced NAFTA and set new standards to ensure that only products with enough North American content qualify for duty-free trade."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Key Rules of Origin Under USMCA:"
        },
        {
          "blockType": "paragraph",
          "text": "1. Regional Value Content (RVC) Requirement"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "A certain percentage of a product’s value must come from North America.",
            "Example: Cars must have 75% North American content (up from NAFTA’s 62.5%)."
          ]
        },
        {
          "blockType": "paragraph",
          "text": "2. Tariff Shift Rule"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "If parts from outside North America are used, the final product must be significantly transformed in a USMCA country to qualify.",
            "Example: A car part made with Chinese steel but fully processed in Mexico might still qualify."
          ]
        },
        {
          "blockType": "paragraph",
          "text": "3. Specific Product Rules"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Some industries (e.g., textiles, chemicals, electronics) have additional origin criteria."
          ]
        },
        {
          "blockType": "paragraph",
          "text": "4. Labor Value Content Requirement (Automotive Industry Only)"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "40-45% of a vehicle’s value must come from workers earning at least $16/hour."
          ]
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Industry-Specific Impact of USMCA Rules"
        },
        {
          "blockType": "paragraph",
          "text": "Electronics Industry"
        },
        {
          "blockType": "paragraph",
          "text": "Fashion Industry"
        },
        {
          "blockType": "paragraph",
          "text": "Personal Care Industry"
        },
        {
          "blockType": "paragraph",
          "text": "Key Takeaways"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Where you assemble a product isn’t enough – If the core materials aren’t North American, it won’t qualify.",
            "Raw materials matter – Products with key components from outside the region face full tariffs.",
            "Sourcing smartly can save money – Using North American ingredients can mean duty-free trade under USMCA."
          ]
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Impact of the New White House Tariff Announcement"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "✅ If a product qualifies under USMCA, it avoids the 25% tariff.",
            "❌ If it doesn’t meet USMCA rules, it is subject to the full tariff.",
            "⚠️ Companies will need to prove USMCA compliance using certificates of origin and detailed supply chain documentation."
          ]
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "How to Prove USMCA Compliance"
        },
        {
          "blockType": "paragraph",
          "text": "To avoid tariffs, companies must prove their products meet USMCA’s origin rules with detailed documentation."
        },
        {
          "blockType": "paragraph",
          "text": "USMCA Certificate of Origin – Your Golden Ticket"
        },
        {
          "blockType": "paragraph",
          "text": "A USMCA Certificate of Origin must be provided by the exporter, producer, or importer to claim duty-free status. It must include:"
        },
        {
          "blockType": "paragraph",
          "text": "✔ Exporter Information (name, address, contact details)"
        },
        {
          "blockType": "paragraph",
          "text": "✔ Product Description & HS Code (first 6 digits)"
        },
        {
          "blockType": "paragraph",
          "text": "✔ Origin Criterion (how the product qualifies under USMCA)"
        },
        {
          "blockType": "paragraph",
          "text": "✔ Certification Statement & Signature (affirming compliance)"
        },
        {
          "blockType": "paragraph",
          "text": "Other Documents You May Need"
        },
        {
          "blockType": "paragraph",
          "text": "U.S. Customs and Border Protection (CBP) might ask for:"
        },
        {
          "blockType": "paragraph",
          "text": "✔ Bill of Materials (BOM) – Showing where each component comes from."
        },
        {
          "blockType": "paragraph",
          "text": "✔ Supplier Declarations – Proof that materials are North American."
        },
        {
          "blockType": "paragraph",
          "text": "✔ Manufacturing Process Records – Evidence of substantial transformation."
        },
        {
          "blockType": "paragraph",
          "text": "✔ Shipping & Import Records – To confirm product details."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "How CBP Verifies USMCA Compliance"
        },
        {
          "blockType": "paragraph",
          "text": "CBP won’t just take your word for it. They may:"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "✅ Request more documents to verify claims.",
            "✅ Audit companies (importers & suppliers) for compliance.",
            "✅ Inspect shipments to ensure details match records."
          ]
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "❌ Deny duty-free benefits and apply full tariffs.",
            "❌ Issue penalties for incorrect or misleading claims."
          ]
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "Final Thoughts"
        },
        {
          "blockType": "paragraph",
          "text": "Businesses need to adjust their supply chains, double-check compliance, and educate customers on duty-free trade options. Those who act early will have a competitive edge as tariffs reshape global trade."
        },
        {
          "blockType": "paragraph",
          "text": "Navigating US tariff changes can be overwhelming. For a broader perspective on the latest developments and their impact on e-commerce, check out my article 2025 US Tariffs Saga for E-commerce: Explained: https://www.linkedin.com/pulse/2025-us-tariffs-saga-e-commerce-explained-grigory-shchichko-23g8f/"
        }
      ]
    },
    "meta": {
      "title": "Understanding USMCA Rules of Origin & Their Impact on Tariffs",
      "description": "With the latest tariff adjustments, goods that meet the USMCA (U.S.-Mexico-Canada Agreement) rules of origin will not be subject to the new 25% tariffs. However, those that do not qualify will face the full tariff rate.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-81c0-b3a7-e839c7af2e3f/a7ddfae7-250a-4284-8035-c10c3c66dafd.jpg"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/understanding-usmca-rules-of-origin-their-impact-on-tariffs"
  },
  {
    "type": "post",
    "title": "Understanding Visa's Acquirer Monitoring Program and Tools for Fraud Prevention",
    "slug": "understanding-visas-acquirer-monitoring-program-and-tools-for-fraud-prevention",
    "excerpt": "Discover how the new Visa Acquirer Monitoring Program (VAMP) launching in April 2025 impacts your business, learn about essential fraud prevention tools such as RDR, Compelling Evidence 3.0, and Pre-Chargeback Alerts and how they can help protect your ecommerce business.",
    "publishedAt": "2024-11-27T05:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1359344f-6e66-8046-b000-f8c7b470f43f/9f1d0f63-ccdc-4882-951f-958a7b2f85dd.jpg",
      "alt": "Understanding Visa's Acquirer Monitoring Program and Tools for Fraud Prevention",
      "filename": "9f1d0f63-ccdc-4882-951f-958a7b2f85dd.jpg"
    },
    "authors": [],
    "categories": [
      "Fraud",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "Managing chargeback and fraud risks for your ecommerce business can be daunting and complex. The"
        },
        {
          "blockType": "paragraph",
          "text": ", launching in April 2025, aims to help merchants and acquirers address these challenges more effectively, but there are some important shifts to know of so that it doesn’t impact your business negatively."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Visa's Acquirer Monitoring Program: What's New?"
        },
        {
          "blockType": "paragraph",
          "text": "Visa's Acquirer Monitoring Program (VAMP) integrates two previously separate programs to reduce fraud and ensure compliance with acceptable chargeback rates. The program holds both merchants and acquirers accountable, with stricter thresholds on allowable chargeback levels. This dual focus shifts from simply monitoring merchant behavior to evaluating the acquirer's role in managing risk within their portfolios.\nThe program's stipulations are stringent: both acquirers and merchants must keep chargeback ratios below certain levels to avoid financial penalties. For acquirers, this adds an extra layer of responsibility, encouraging proactive monitoring and mitigation of fraud risk across their portfolios."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Leveraging Fraud Prevention Tools to Stay Compliant"
        },
        {
          "blockType": "paragraph",
          "text": "Visa's program emphasizes pre-emptive fraud management and utilizes several tools to keep chargeback ratios within compliance. By using pre-chargeback alerts and rapid dispute resolution methods, merchants can address potential issues before they become chargebacks. When used effectively, these tools not only prevent chargebacks but also ensure that certain resolved disputes won't count toward Visa's chargeback ratio requirements."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Key Tools to Combat Chargebacks"
        },
        {
          "blockType": "paragraph",
          "text": "Available through providers like Verifi (by Visa) and Ethoca (by Mastercard), these alerts notify merchants of potential chargebacks, allowing them to address issues proactively. Merchants can offer solutions like refunds or cancellations to avoid costly disputes."
        },
        {
          "blockType": "paragraph",
          "text": "Rapid Dispute Resolution (RDR)"
        },
        {
          "blockType": "paragraph",
          "text": "Offered by Verifi, RDR swiftly resolves disputes by issuing refunds before they become chargebacks, effectively removing them from the chargeback ratio. This is particularly useful for low-value transactions where dispute costs might outweigh the chargeback's financial impact."
        },
        {
          "blockType": "paragraph",
          "text": "Compelling Evidence 3.0"
        },
        {
          "blockType": "paragraph",
          "text": "This advanced tool uses data like device IDs, IP addresses, and purchase histories to provide issuers with evidence of legitimate transactions. Issuers can then assess claims and potentially decline chargeback requests, transferring liability back to themselves if the merchant is not at fault."
        },
        {
          "blockType": "paragraph",
          "text": "Order Insights"
        },
        {
          "blockType": "paragraph",
          "text": "By offering transaction details to customers through their online banking portals, merchants can help consumers recognize purchases, reducing accidental chargebacks."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Managing Compliance and Risk"
        },
        {
          "blockType": "paragraph",
          "text": "VAMP introduces a stricter approach to chargeback management, making it essential for businesses to use these tools as part of a comprehensive fraud management strategy. By setting up customized rules, such as thresholds based on transaction size or frequency, merchants can preemptively address low-value disputes and avoid fines. This layered approach allows businesses to meet Visa's tighter compliance guidelines while protecting their bottom line.\nFor merchants of all sizes, these tools serve a dual purpose: protecting businesses from fraud and maintaining healthy relationships with acquirers by staying within acceptable chargeback thresholds. With the right mix of proactive fraud management tools and strategies, businesses can comply with Visa's new standards and foster a more secure transaction environment."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Looking Ahead"
        },
        {
          "blockType": "paragraph",
          "text": "As digital payment methods evolve, fraud prevention and dispute resolution tools will become increasingly sophisticated. The Visa Acquirer Monitoring Program sets new standards for safer, more compliant payment ecosystems. By embracing these technologies and strategies, businesses can stay vigilant against fraud, minimize dispute-related financial impacts, and operate securely within the broader payment ecosystem."
        },
        {
          "blockType": "paragraph",
          "text": "Does the breadth of tools available seem daunting? Partnering with companies designed to manage your Fraud exposure can help. Reach now partners with ChargebackHelp to ensure all of our clients have access to the top-of-the-line resources so you can avoid hassles with your business."
        },
        {
          "blockType": "paragraph",
          "text": "Listen to our episode of True Fraud with Vinay Shiriwastaw, CCO at DisputeHelp, to hear about how our partnership with the chargeback management company can help your business stay far away from the chargeback thresholds."
        },
        {
          "blockType": "paragraph",
          "text": "Discover how our global experts and Merchant of Record model can maximize your international potential today and in the future here."
        }
      ]
    },
    "meta": {
      "title": "Understanding Visa's Acquirer Monitoring Program and Tools for Fraud Prevention",
      "description": "Discover how the new Visa Acquirer Monitoring Program (VAMP) launching in April 2025 impacts your business, learn about essential fraud prevention tools such as RDR, Compelling Evidence 3.0, and Pre-Chargeback Alerts and how they can help protect your ecommerce business.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1359344f-6e66-8046-b000-f8c7b470f43f/9f1d0f63-ccdc-4882-951f-958a7b2f85dd.jpg"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/understanding-visas-acquirer-monitoring-program-and-tools-for-fraud-prevention"
  },
  {
    "type": "post",
    "title": "What You Need to Know About SOC 2 and PCI DSS Compliance",
    "slug": "what-you-need-to-know-about-soc-2-and-pci-dss-compliance",
    "excerpt": "Learn about the importance of PCI DSS and AICPA SOC 2 compliance and how we help ensure your business’ cross-border payments remain compliant in global markets.\r\n",
    "publishedAt": "2023-06-01T04:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1769344f-6e66-8179-bd81-ef27eec14881/dcadce96-b622-49bf-b70f-19e2dc615241.jpg",
      "alt": "What You Need to Know About SOC 2 and PCI DSS Compliance",
      "filename": "dcadce96-b622-49bf-b70f-19e2dc615241.jpg"
    },
    "authors": [],
    "categories": [
      "Fraud",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "In 2022, it was estimated that over 422 million individuals were impacted by compromised data in the US alone. Due to the rise of such nefarious activity, consumers worldwide want to know that their payment data and information are being protected, and international businesses want to reduce their risk & liability."
        },
        {
          "blockType": "paragraph",
          "text": "To meet these demands, regulatory bodies have created standards of compliance guidelines such as PCI DSS and AICPA SOC 2, which have become a requirement, if not the gold standard, for many industries globally."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "What are PCI DSS and SOC2?"
        },
        {
          "blockType": "paragraph",
          "text": "PCI DSS or The Payment Card Data Security Standard is a mandatory set of control standards for any company that processes, stores, or transmits credit card information. It was established by the Payment Card Industry Security Standards Council which is an independent regulatory body created by major credit card brands such as Mastercard & Visa."
        },
        {
          "blockType": "paragraph",
          "text": "The focus of PCI DSS is to set security guidelines and compliance standards for payment cards and ensure their information is being used/stored in a strict and secure manner. Controls and compliance standards include practices such as:"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Ensuring strong encryption of all cardholder data while in transit over open networks",
            "Regular scanning of all system disks to ensure that no card data is present",
            "Monthly internal vulnerability scans, quarterly reporting to auditor",
            "Annual penetration tests of production infrastructure performed by a third party",
            "Ensuring change management processes are in place"
          ]
        },
        {
          "blockType": "paragraph",
          "text": "SOC2 or Systems and Organization Controls 2 is a voluntary set of standards that outlines the business controls and effectiveness of those controls to maintain a high level of information security to protect their systems. The American Institute of Certified Public Accountants established this set of standards. SOC2 is based on five criteria: security, availability, processing integrity, confidentiality, and privacy. SOC2 Type 1 provides a report of the procedures and controls that an organization has put in place as of a point in time. Type 2 looks over a period of time and tests the effectiveness of the controls which were implemented."
        },
        {
          "blockType": "paragraph",
          "text": "An examination of a description of a service organization’s system and the suitability of the design and operating effectiveness of controls involves the following:"
        },
        {
          "blockType": "list",
          "style": "unordered",
          "items": [
            "Obtaining an understanding of the system and the service organization's service commitments and system requirements.",
            "Performing procedures to obtain evidence about whether the description is presented in accordance with the description criteria.",
            "Performing procedures to obtain evidence about whether controls stated in the description were suitably designed to provide reasonable assurance that the service organization achieved its service commitments and system requirements based on the applicable trust services criteria.",
            "Testing the operating effectiveness of controls stated in the description to provide reasonable assurance that the service organization achieved its service commitments and system requirements based on the applicable trust services criteria.",
            "Evaluating the overall presentation of the description."
          ]
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "Why Should You Care?"
        },
        {
          "blockType": "paragraph",
          "text": "While SOC2 is voluntary, protecting your consumer's data isn't. A breach of your client's data is a surefire way to tarnish your brand's reputation and destroy any trust you may have had with your consumers. By remaining compliant with SOC2, you guarantee your customers that the highest information security standards protect their data. When working with payment information and similar types of information, this level of protection is worth its weight in gold as it decreases your risk and liability while building consumer trust in your brand."
        },
        {
          "blockType": "paragraph",
          "text": "Unlike SOC2, PCI DSS compliance isn’t voluntary, and the repercussions of neglecting these security standards are severe. If your business handles credit card information and lets PCI fall by the wayside, you could be subject to fines as high as $1M if breached. That alone would be enough to sink most businesses, but it doesn’t stop there. Even if you’re big enough to eat those costs, banks and other financial institutions can terminate their relationship with you, limiting the payment options you can offer. So, to avoid these repercussions, it is essential that your business adheres to the strict compliance standards of PCI DSS."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "How Can We Help You Remain Compliant?"
        },
        {
          "blockType": "paragraph",
          "text": "As we’re 100% compliant with PCI DSS & SOC2 Type 1 & 2, every transaction you process with our Merchant of Record model is too. Our all-in pre-built solution for global payments is held to the highest level of compliance standards and is designed to securely manage your customers’ payment data. This enables you to sell internationally with the confidence of knowing our model keeps your buyer’s data protected and allows you to focus on what’s important, growing your international business."
        },
        {
          "blockType": "paragraph",
          "text": "That being said, it is still essential that you maintain your own compliance with PCI DSS for all transactions processed outside of our platform to secure and protect your own platform and customer data."
        },
        {
          "blockType": "paragraph",
          "text": "Learn more about our Merchant of Record model and discover how we help ensure your business’ cross-border payments remain compliant in global markets."
        }
      ]
    },
    "meta": {
      "title": "What You Need to Know About SOC 2 and PCI DSS Compliance",
      "description": "Learn about the importance of PCI DSS and AICPA SOC 2 compliance and how we help ensure your business’ cross-border payments remain compliant in global markets.\r\n",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1769344f-6e66-8179-bd81-ef27eec14881/dcadce96-b622-49bf-b70f-19e2dc615241.jpg"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/what-you-need-to-know-about-soc-2-and-pci-dss-compliance"
  },
  {
    "type": "post",
    "title": "What’s Really Hurting Your SaaS Brand’s Recurring Revenue?",
    "slug": "whats-really-hurting-your-saas-brands-recurring-revenue",
    "excerpt": "According to data compiled by Forbes, it can cost four to five times more money to secure a new customer than to retain an existing one.",
    "publishedAt": "2024-07-11T04:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1769344f-6e66-812a-a231-f13b9845444e/c6be2bb1-4ca3-4250-b477-1feb501ca079.jpeg",
      "alt": "What’s Really Hurting Your SaaS Brand’s Recurring Revenue?",
      "filename": "c6be2bb1-4ca3-4250-b477-1feb501ca079.jpeg"
    },
    "authors": [],
    "categories": [
      "Localized Customer Experience",
      "Integration",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "According to data compiled by Forbes, it can cost four to five times more money to secure a new customer than to retain an existing one. This is particularly acute for digital businesses, who often overlook the principal reason for customer loss: churn."
        },
        {
          "blockType": "paragraph",
          "text": "For global SaaS businesses like yours, churn is often seen as public enemy number one. Churn occurs when a transaction that has already been processed successfully multiple times in the past fails in the present, and the customer and potential future revenue generated from them is lost. These customers are often not recoverable."
        },
        {
          "blockType": "paragraph",
          "text": "There are two types of churn: voluntary churn, which is when a consumer terminates their subscription, and involuntary churn, which is when a transaction fails due to issues such as insufficient funds or simply because the consumer's card has expired. Regardless of the reason, the result is the same. Your SaaS brand loses that future recurring revenue."
        },
        {
          "blockType": "paragraph",
          "text": "Because recurring revenue and the lifetime value of your consumers are the lifeblood of any subscription-based company, reducing churn is a business-critical imperative.But what if we told you there was a more prolific killer of international recurring revenue? This blocker of global success is called a false decline, and it’s arguably worse than churn."
        },
        {
          "blockType": "paragraph",
          "text": "The reason why false declines are more damaging to your bottom line than churn is because they happen on your global consumers’ initial transaction. As 2/3rd of customers that face a false decline will not re-attempt their transaction, you lose that revenue and that customer before you can even realize any of the potential lifetime value. And, as Forbes points out, it will cost you up to five times more to replace that stream of revenue. While focusing on churn and maintaining the long-term value of your current consumers is cheaper than trying to gain net-new customers, you’re hindering your ability to scale and be profitable if you don’t optimize your checkout for that initial international transaction. Optimization can take many forms, but there are clear and actionable steps that you can take to ensure you convert that initial transaction into a steady stream of revenue."
        },
        {
          "blockType": "paragraph",
          "text": "With this in mind, let’s explore false declines, why they happen, and what you can do about them."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "Why are legitimate transactions being declined?"
        },
        {
          "blockType": "paragraph",
          "text": "A false decline, simply put, is when a transaction that is 100% legitimate is declined when it should have been approved. When international consumers attempt to purchase through your global storefront, there are many reasons why their transaction could be falsely declined."
        },
        {
          "blockType": "paragraph",
          "text": "One of the most common reasons they happen to businesses that sell internationally is because the seller’s acquiring bank and the consumer’s issuing bank are unfamiliar with each other. The unfamiliarity of this situation generates perceived risk, and fraud alarms are triggered, ultimately leading to a false decline."
        },
        {
          "blockType": "paragraph",
          "text": "The complexities of global ecommerce and regional compliance, in general, result in an unnecessarily high amount of false declines. There are tens of thousands of international institutions across the globe, and they effectively have to earn each other’s trust before transactions flow seamlessly between issuer and acquirer."
        },
        {
          "blockType": "paragraph",
          "text": "However, there’s no reason to lose customers and recurring revenue because your payments orchestration company or your customer's bank declines a transaction simply because it’s from a foreign country."
        },
        {
          "blockType": "paragraph",
          "text": "With the right international partner, you can navigate the challenges of global ecommerce and its associated risks. In fact, businesses that partner with the right international platform can see an increase in overall profitability of 86%."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "How to deal with false declines without losing customers"
        },
        {
          "blockType": "paragraph",
          "text": "When it comes to global ecommerce, leveraging an international partner can help you navigate the relationships between acquiring and issuing banks to ensure that legitimate transactions aren’t flagged as fraud or deemed too risky and subsequently falsely declined."
        },
        {
          "blockType": "paragraph",
          "text": "Global solutions, like ours, achieve this by acting as the global Merchant of Record for international SaaS businesses. This type of partnership allows us to localize your transactions on your behalf. Localizing a transaction by harnessing the power of a worldwide network ensures that the route it travels sees the highest success rates possible. Processing international transactions locally in this manner can enable your SaaS business to drastically increase its approval rates and significantly reduce costly false declines."
        },
        {
          "blockType": "paragraph",
          "text": "However, some transactions can still be flagged as fraud due to anti-fraud systems. Although these systems can be highly intricate with advanced knowledge of fraud patterns, they can still create false positives. This is why you can also benefit from working with a human-centered fraud team like ours, which pairs advanced machine learning systems with the keen eyes of human intelligence to reduce your fraud risk without hindering your international conversions."
        },
        {
          "blockType": "conclusion",
          "heading": "Conclusion",
          "text": "As demonstrated above, churn is still a costly problem with which global SaaS businesses must grapple. For businesses like yours, ignoring false declines will hurt your bottom line more in the long run. This is because a false decline does not just represent a loss on just one transaction but the loss of the entire lifetime value of that potential customer. Coupled with the associated multiplied cost of new customer acquisition, this dynamic can render international sales in certain markets unviable.\n\nNew subscribers are crucial for sustainable growth and profitability in today's competitive SaaS landscape. By leveraging our international platform, you can localize your global checkout, access our network of global fraud experts, and scale into new markets by increasing your approval rates by over 90%.\n\nChoose a partner that aligns with your international goals and provides the functionality you need to convert new subscribers globally, all while making your SaaS business more profitable. Learn more about how we can empower your international SaaS business here."
        }
      ]
    },
    "meta": {
      "title": "What’s Really Hurting Your SaaS Brand’s Recurring Revenue?",
      "description": "According to data compiled by Forbes, it can cost four to five times more money to secure a new customer than to retain an existing one.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1769344f-6e66-812a-a231-f13b9845444e/c6be2bb1-4ca3-4250-b477-1feb501ca079.jpeg"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/whats-really-hurting-your-saas-brands-recurring-revenue"
  },
  {
    "type": "post",
    "title": "When Online Payments Fraud Leaks, It Pours",
    "slug": "when-online-payments-fraud-leaks-it-pours",
    "excerpt": "As leaks of compromised card information become more prevalent, don’t try and tackle fraud alone. Supplement your fraud controls with our global experts. \r\n",
    "publishedAt": "2023-05-25T04:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1769344f-6e66-817b-993d-dff72b7b9213/6ff703c5-b3dc-4d31-aa4a-c7ff51215735.webp",
      "alt": "When Online Payments Fraud Leaks, It Pours",
      "filename": "6ff703c5-b3dc-4d31-aa4a-c7ff51215735.webp"
    },
    "authors": [],
    "categories": [
      "Fraud",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "Recently the cybersecurity publication “Security Week,” released an article regarding the criminal carding marketplace, \"BidenCash,\" and how they released the compromised information from over 2 million cards on the Dark Web in 2022 alone."
        },
        {
          "blockType": "paragraph",
          "text": "These types of card leaks lead to increased fraudulent transactions that can impact your cross-border business. Worse yet, according to our Head of Risk and Customer Care, Pablo Torres, they are just a drop in the bucket."
        },
        {
          "blockType": "paragraph",
          "text": "\"This is just a tease on the amount of card data available, and all released for free. Though I'm sure most have already been either used or reported, you could try [any of them] since you get all the data you need, CVV, Expiry, Billing, Name, etc. Fraud attacks have been getting more and more sophisticated as well as the people behind them are getting more educated.\""
        },
        {
          "blockType": "paragraph",
          "text": "As leaks of compromised card information continue to flood global marketplaces, how can you protect your business from increased fraudulent transactions? The key is preventative measures. Companies must establish fraud controls, teams, and engines to identify, flag, and respond to cybercrime events like the \"BidenCash\" leak. These measures can help ensure emerging fraud patterns are identified and mitigated before they become a problem."
        },
        {
          "blockType": "paragraph",
          "text": "However, many global businesses don't have the capacity or resources to do this themselves. This is simply because the world's a big place, and staying on top of fraud patterns internationally, let alone patterns in your domestic market, is a daunting task."
        },
        {
          "blockType": "paragraph",
          "text": "That's why many cross-border businesses supplement their existing fraud controls with established expert fraud solutions."
        },
        {
          "blockType": "paragraph",
          "text": "Explore our fraud prevention and risk management solutions to learn how we can supplement your fraud controls and help you sell globally with confidence."
        }
      ]
    },
    "meta": {
      "title": "When Online Payments Fraud Leaks, It Pours",
      "description": "As leaks of compromised card information become more prevalent, don’t try and tackle fraud alone. Supplement your fraud controls with our global experts. \r\n",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1769344f-6e66-817b-993d-dff72b7b9213/6ff703c5-b3dc-4d31-aa4a-c7ff51215735.webp"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/when-online-payments-fraud-leaks-it-pours"
  },
  {
    "type": "post",
    "title": "Why Your Business Needs a Payment Strategy",
    "slug": "why-your-business-needs-a-payment-strategy",
    "excerpt": "Optimize your global checkout! Learn how to create an intentional payment strategy, avoid the \"payments buffet,\" and streamline your customer experience. Boost sales & reduce costs.",
    "publishedAt": "2025-03-26T04:00:00.000Z",
    "heroImage": {
      "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-819f-868f-e50c3e1b43ea/11c8f5b7-29d2-43ef-8b4d-1d31981d0356.jpg",
      "alt": "Why Your Business Needs a Payment Strategy",
      "filename": "11c8f5b7-29d2-43ef-8b4d-1d31981d0356.jpg"
    },
    "authors": [],
    "categories": [
      "Alternative Payment Methods",
      "Localized Customer Experience",
      "Reach blog"
    ],
    "content": {
      "type": "structured",
      "blocks": [
        {
          "blockType": "paragraph",
          "text": "When expanding globally, one of the most overlooked elements is understanding which payment strategy to employ and avoid overcomplicating your checkout with too many or too little payment options. Optimize your checkout by employing an intentional payment strategy."
        },
        {
          "blockType": "paragraph",
          "text": "Having a well-thought-out payment strategy can streamline your checkout so customers experience the least amount of friction possible. This ultimately helps you increase sales, reduce costs, and improve customer satisfaction."
        },
        {
          "blockType": "heading",
          "level": "h2",
          "text": "How to Create a Payment Strategy"
        },
        {
          "blockType": "paragraph",
          "text": "Navigating global ecommerce involves plenty of nuance, especially when it comes to understanding your customers' needs. A big part of this comes down to how your payment strategy is executed. There are a few key factors to keep in mind when building that strategy:"
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "The types of payment methods you offer."
        },
        {
          "blockType": "paragraph",
          "text": "You'll want to offer a variety of payment methods to your customers, so they can choose the one that's most convenient for them. Some popular payment methods include credit cards, debit cards, digital wallets, and buy now, pay later (BNPL) services.\nBuy now, pay later (BNPL) services like Klarna and PayPal's BNPL feature are becoming increasingly popular, especially during the holiday season. These services allow customers to split their purchases into smaller, more manageable payments, which can lead to increased sales and customer loyalty. These services offer several benefits to merchants, including increased customer acquisition and higher average ticket values. By offering customers the option to pay over time, businesses can make their products more accessible and appealing, leading to increased sales and customer satisfaction."
        },
        {
          "blockType": "heading",
          "level": "h3",
          "text": "The way you process payments."
        },
        {
          "blockType": "paragraph",
          "text": "You'll need to choose a payments partner that can handle your transaction volume, cross-border processing, and meet your needs. Being able to communicate between banks in different regions can be nuanced and challenging. Especially when those banks don’t already have a relationship. When customers and sellers are in different countries, the different steps in routing payments can become barred with unnecessary complications, resulting in false declines or high fees adding up.\nPartnering with the right payments team can ensure your payments are routed in the most effective way."
        },
        {
          "blockType": "conclusion",
          "heading": "Conclusion",
          "text": "Building a strong payment strategy is key to long-term growth and earning customer loyalty. By offering a variety of payment options, you make it easier for more customers to buy, ultimately boosting your sales.\n\nSimultaneously, meticulous selection of payment processors and methods can significantly curtail processing costs, contributing to improved financial efficiency. Beyond the fiscal advantages, a well-crafted payment strategy elevates customer satisfaction by streamlining the checkout experience. To achieve this, thorough research into available payment options and their associated fees is essential, alongside a deep understanding of your target market's preferences. Selecting a payment processor that aligns with your specific needs and optimizing the checkout process for user-friendliness are crucial steps.\n\nFinally, continuous monitoring of your payment strategy's performance, including tracking costs and customer feedback, allows for necessary adjustments, ensuring it remains effective and aligned with your business objectives. Ultimately, a carefully constructed and consistently refined payment strategy serves as a powerful tool for driving sales, reducing expenses, and fostering positive customer relationships.\n\nWant to learn more? Check out our podcast with Melissa Pottenger, VP Payment Ops, about how to avoid the ‘payments buffet’.\n\nWith Reach, you can easily optimize your payment strategy with top experts. Discover how our global experts and Merchant of Record model can maximize your international potential today and in the future here."
        }
      ]
    },
    "meta": {
      "title": "Why Your Business Needs a Payment Strategy",
      "description": "Optimize your global checkout! Learn how to create an intentional payment strategy, avoid the \"payments buffet,\" and streamline your customer experience. Boost sales & reduce costs.",
      "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-819f-868f-e50c3e1b43ea/11c8f5b7-29d2-43ef-8b4d-1d31981d0356.jpg"
    },
    "sourceUrl": "https://www.withreach.com/resources/reach-blog/why-your-business-needs-a-payment-strategy"
  }
]