{
  "type": "post",
  "title": "Reach Secures Major Investment to Accelerate its Global Expansion and Fuel Enterprise Merchant Growth",
  "slug": "reach-secures-major-investment-to-accelerate-its-global-expansion-and-fuel-enterprise-merchant-growth",
  "excerpt": "Backed by a significant investment from Primus Capital, Reach is positioned to deliver on its ambitious growth trajectory in 2025.",
  "publishedAt": "2025-02-20T05:00:00.000Z",
  "heroImage": {
    "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-81f9-9d42-d1c17f71111a/1ff6b4c5-76fb-4557-972e-31854e3fc90a.jpg",
    "alt": "Reach Secures Major Investment to Accelerate its Global Expansion and Fuel Enterprise Merchant Growth",
    "filename": "1ff6b4c5-76fb-4557-972e-31854e3fc90a.jpg"
  },
  "authors": [],
  "categories": [
    "Newsroom"
  ],
  "content": {
    "type": "structured",
    "blocks": [
      {
        "blockType": "heading",
        "level": "h2",
        "text": "FOR IMMEDIATE RELEASE"
      },
      {
        "blockType": "paragraph",
        "text": "Annual Gross Merchandise Volume (GMV) for Reach grew 95% year-over-year in Q4 2024 and the organization is primed to extend its leadership in the enterprise MoR market. The investment by Primus Capital will primarily be used to enhance support for enterprise businesses, further develop its ecommerce product mix, and expand its existing global entity network into additional in-demand markets."
      },
      {
        "blockType": "paragraph",
        "text": "“We’re thrilled to have Primus as a strategic partner as we continue to scale our solution for global merchants,” said Sam Ranieri, CEO of Reach. “This investment will allow us to strengthen our infrastructure, expand our international coverage, and empower our clients to unlock new markets and optimize cross-border operations with ease.”"
      },
      {
        "blockType": "paragraph",
        "text": "According to Ron Hess, Managing Director at Primus Capital, investing in Reach came down to a strong belief in the company’s value. “We’ve built a relationship with Sam and his team over the past few years and have witnessed the return on investment realized by Reach’s customers. The company’s impressive growth is driven by its innovative approach to solving the pain points of global expansion for retail and digital businesses. This investment will help fuel the company’s efforts to continue delivering unparalleled value to enterprise customers in the face of the challenges of a globalized marketplace.” Mr. Hess said. As a byproduct of this partnership, Reach is investing in new technology infrastructure and augmenting its team to support its evolving and rapidly-growing customer base, while concurrently developing its ecommerce product suite. The company’s expansion will further simplify cross-border transactions for its clients, which empowers businesses to focus on innovation while Reach handles the complexities of payments, tax, and fraud mitigation at scale."
      },
      {
        "blockType": "paragraph",
        "text": "Leveraging a Merchant of Record is essential for mid-market and enterprise businesses already active in cross-border ecommerce who need to unlock new levels of efficiency, revenue, and international performance. As businesses scale globally, managing local tax regulations and staying compliant with fluctuating tariffs and legal requirements becomes increasingly complex. An MoR simplifies this process by automating tax calculations and ensuring compliance across multiple markets, with much faster time to market than going alone."
      },
      {
        "blockType": "paragraph",
        "text": "“Given the current uncertainty surrounding international trade and cross-border sales, it’s critical for us to provide the most simple, robust, and complete global solution for our clients.” Mr. Ranieri said. “The investment from Primus will help us strengthen our position as a world leader in ecommerce, while continuing to find innovative ways for our clients to navigate the complex financial and regulatory borders standing between them and their customers.”"
      },
      {
        "blockType": "paragraph",
        "text": "RBC Capital Markets acted as the exclusive financial advisor to Reach on the transaction, and Osler, Hoskin & Harcourt LLP and Taft Law acted as legal advisors. Goodwin Procter LLP acted as legal adviser to Primus"
      },
      {
        "blockType": "heading",
        "level": "h3",
        "text": "ABOUT REACH"
      }
    ]
  },
  "meta": {
    "title": "Reach Secures Major Investment to Accelerate its Global Expansion and Fuel Enterprise Merchant Growth",
    "description": "Backed by a significant investment from Primus Capital, Reach is positioned to deliver on its ambitious growth trajectory in 2025.",
    "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1d69344f-6e66-81f9-9d42-d1c17f71111a/1ff6b4c5-76fb-4557-972e-31854e3fc90a.jpg"
  },
  "sourceUrl": "https://www.withreach.com/resources/newsroom/reach-secures-major-investment-to-accelerate-its-global-expansion-and-fuel-enterprise-merchant-growth"
}