{
  "type": "post",
  "title": "Reach Bolsters Executive Leadership Team with Key Strategic Hires",
  "slug": "reach-bolsters-executive-leadership-team-with-key-strategic-hires",
  "excerpt": "New appointments in compliance, marketing, and product underscore Reach’s focus on global scale and subject-matter expertise",
  "publishedAt": "2025-07-24T04:00:00.000Z",
  "heroImage": {
    "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/23a9344f-6e66-80ea-acb5-c2c1a5b0865f/9dffe169-4b76-4500-92c6-a8f43b1e4138.webp",
    "alt": "Reach Bolsters Executive Leadership Team with Key Strategic Hires",
    "filename": "9dffe169-4b76-4500-92c6-a8f43b1e4138.webp"
  },
  "authors": [],
  "categories": [
    "Newsroom"
  ],
  "content": {
    "type": "structured",
    "blocks": [
      {
        "blockType": "paragraph",
        "text": "CALGARY, ALBERTA, CANADA – July 24, 2025 – Reach, a leading Merchant of Record platform enabling seamless global ecommerce, is proud to announce the expansion of its senior leadership team with the appointments of Christopher Wassenaar as Chief Legal and Compliance Officer, Avneet Malhi as SVP of Marketing, and Kirk Johnson as VP of Product. These strategic hires reflect Reach’s continued investment in deep subject-matter expertise to support its rapid growth and strengthen its market leadership."
      },
      {
        "blockType": "paragraph",
        "text": "Christopher Wassenaar brings a wealth of executive and operational experience in international legal, regulatory, and compliance frameworks. With a background spanning multiple private equity and venture capital backed global financial services software and fintech platforms, Christopher will lead Reach's legal, regulatory, and compliance efforts, helping clients confidently navigate complex cross-border ecommerce challenges."
      },
      {
        "blockType": "paragraph",
        "text": "Joining as SVP of Marketing, Avneet Malhi brings two decades of experience leading global product marketing teams and scaling go-to-market operations in high-growth tech companies. Avneet has a strong track record of launching complex products—across Web3, payments, and SaaS—and leading cross-functional strategies. She will lead Reach’s global marketing strategy, brand evolution, and demand generation efforts."
      },
      {
        "blockType": "paragraph",
        "text": "Kirk Johnson, appointed VP of Product, has extensive experience driving product innovation for startups and scale-ups across multiple industries. He has led product teams in rapidly evolving markets, developing solutions that anticipate customer needs and deliver measurable impact. At Reach, Kirk will oversee the product roadmap, ensuring the platform continues to innovate for businesses and address the unique challenges of scaling globally."
      },
      {
        "blockType": "paragraph",
        "text": "“These hires mark an important chapter in Reach’s journey,” said Sam Ranieri, CEO of Reach. “Chris, Avneet, and Kirk each bring specialized expertise that strengthens our ability to serve enterprise businesses around the world. As we grow, we’re focused on assembling a team that not only understands the complexity of global commerce—but can simplify it for our customers.”"
      },
      {
        "blockType": "paragraph",
        "text": "This expanded leadership team is already at work supporting Reach’s mission: to make global ecommerce feel local, no matter where customers and merchants are."
      },
      {
        "blockType": "paragraph",
        "text": "ABOUT REACH"
      },
      {
        "blockType": "paragraph",
        "text": "Reach is the Merchant of Record for high-growth and established ecommerce retailers and SaaS businesses. Reach enables businesses to effortlessly activate global capabilities within the platforms they already use. This unlocks fraud prevention, tax compliance, and localized customer experiences without complex integration. Trusted by global brands, Reach streamlines cross-border operations, reduces costs, and improves transaction approval rates, empowering businesses to scale internationally with ease."
      }
    ]
  },
  "meta": {
    "title": "Reach Bolsters Executive Leadership Team with Key Strategic Hires",
    "description": "New appointments in compliance, marketing, and product underscore Reach’s focus on global scale and subject-matter expertise",
    "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/23a9344f-6e66-80ea-acb5-c2c1a5b0865f/9dffe169-4b76-4500-92c6-a8f43b1e4138.webp"
  },
  "sourceUrl": "https://www.withreach.com/resources/newsroom/reach-bolsters-executive-leadership-team-with-key-strategic-hires"
}