{
  "type": "post",
  "title": "When Online Payments Fraud Leaks, It Pours",
  "slug": "when-online-payments-fraud-leaks-it-pours",
  "excerpt": "As leaks of compromised card information become more prevalent, don’t try and tackle fraud alone. Supplement your fraud controls with our global experts. \r\n",
  "publishedAt": "2023-05-25T04:00:00.000Z",
  "heroImage": {
    "url": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1769344f-6e66-817b-993d-dff72b7b9213/6ff703c5-b3dc-4d31-aa4a-c7ff51215735.webp",
    "alt": "When Online Payments Fraud Leaks, It Pours",
    "filename": "6ff703c5-b3dc-4d31-aa4a-c7ff51215735.webp"
  },
  "authors": [],
  "categories": [
    "Fraud",
    "Reach blog"
  ],
  "content": {
    "type": "structured",
    "blocks": [
      {
        "blockType": "paragraph",
        "text": "Recently the cybersecurity publication “Security Week,” released an article regarding the criminal carding marketplace, \"BidenCash,\" and how they released the compromised information from over 2 million cards on the Dark Web in 2022 alone."
      },
      {
        "blockType": "paragraph",
        "text": "These types of card leaks lead to increased fraudulent transactions that can impact your cross-border business. Worse yet, according to our Head of Risk and Customer Care, Pablo Torres, they are just a drop in the bucket."
      },
      {
        "blockType": "paragraph",
        "text": "\"This is just a tease on the amount of card data available, and all released for free. Though I'm sure most have already been either used or reported, you could try [any of them] since you get all the data you need, CVV, Expiry, Billing, Name, etc. Fraud attacks have been getting more and more sophisticated as well as the people behind them are getting more educated.\""
      },
      {
        "blockType": "paragraph",
        "text": "As leaks of compromised card information continue to flood global marketplaces, how can you protect your business from increased fraudulent transactions? The key is preventative measures. Companies must establish fraud controls, teams, and engines to identify, flag, and respond to cybercrime events like the \"BidenCash\" leak. These measures can help ensure emerging fraud patterns are identified and mitigated before they become a problem."
      },
      {
        "blockType": "paragraph",
        "text": "However, many global businesses don't have the capacity or resources to do this themselves. This is simply because the world's a big place, and staying on top of fraud patterns internationally, let alone patterns in your domestic market, is a daunting task."
      },
      {
        "blockType": "paragraph",
        "text": "That's why many cross-border businesses supplement their existing fraud controls with established expert fraud solutions."
      },
      {
        "blockType": "paragraph",
        "text": "Explore our fraud prevention and risk management solutions to learn how we can supplement your fraud controls and help you sell globally with confidence."
      }
    ]
  },
  "meta": {
    "title": "When Online Payments Fraud Leaks, It Pours",
    "description": "As leaks of compromised card information become more prevalent, don’t try and tackle fraud alone. Supplement your fraud controls with our global experts. \r\n",
    "ogImageUrl": "https://rch-cms-content.s3.us-west-2.amazonaws.com/notion-images/1769344f-6e66-817b-993d-dff72b7b9213/6ff703c5-b3dc-4d31-aa4a-c7ff51215735.webp"
  },
  "sourceUrl": "https://www.withreach.com/resources/reach-blog/when-online-payments-fraud-leaks-it-pours"
}